[{"Unnamed: 0":0,"query":"APT17","text":"APT17: Hiding in Plain\nSight - FireEye and Microsoft Expose Obfuscation Tactic     Threat actors have found a new way to\ndodge security professionals, using popular websites’ legitimate\nfunctionalities to hide their hacking operations. FireEye Threat\nIntelligence and Microsoft Threat Intelligence Center discovered a\nChina-based threat group dubbed APT17 using Microsoft’s TechNet blog\nfor its Command-and-Control (CnC) operation.  Interestingly, APT17 chose not to\ncompromise TechNet, but rather created profiles and posted in forums\nto post its encoded CnC. Doing so made it more difficult for network\nsecurity professionals to determine the CnC’s true location, which\nallowed APT17 to conduct its activities for longer than it might have otherwise.  This report details how we discovered the\noperation, what was done to shut it down, and how other threat groups\nhave already adopted a “hide in plain sight” approach to hacking.  Download the report to find out:   Who APT17 is and who they’re\ntargeting  How they bypassed traditional methods to avoid\ndetection  How this new method of compromise differs from\nprevious tactics  What FireEye and Microsoft did to shut\ndown APT17’s use of the Microsoft TechNet blog   Download the report today.","url":"https:\/\/www.fireeye.com\/\/current-threats\/apt-groups\/rpt-apt17.html"},{"Unnamed: 0":0,"query":"APT17","text":"Download the Kaspersky Security Bulletin: Threat Predictions for 2018  Introduction  As hard as it is to believe, it’s once again time for our APT Predictions. Looking back at a year like 2017 brings the internal conflict of being a security researcher into full view: on the one hand, each new event is an exciting new research avenue for us, as what were once theoretical problems find palpable expression in reality. This allows us to understand the actual attack surface and attacker tactics and to further hone our hunting and detection to address new attacks. On the other hand, as people with a heightened concern for the security posture of users at large, each event is a bigger catastrophe. Rather than consider each new breach as yet another example of the same, we see the compounding cumulative insecurity facing users, e-commerce, financial, and governmental institutions alike.  As we stated last year, rather than thinly-veiled vendor pitching, our predictions are an attempt to bring to bear our research throughout the year in the form of trends likely to peak in the coming year.  Our record – did we get it right?  As a snapshot scorecard of our performance last year, these are some of our 2017 predictions and some examples where relevant:  Espionage and APTs:   Passive implants showing almost no signs of infection come into fashion Yes – https:\/\/securelist.com\/unraveling-the-lamberts-toolkit\/77990\/  Ephemeral infections \/ memory malware Yes – https:\/\/securelist.com\/fileless-attacks-against-enterprise-networks\/77403\/  Espionage goes mobile Yes – https:\/\/android-developers.googleblog.com\/2017\/04\/an-investigation-of-chrysaor-malware-on.html   Financial Attacks:   The future of financial attacks Yes – https:\/\/securelist.com\/lazarus-under-the-hood\/77908\/   Ransomware:   Dirty, lying ransomware Yes – https:\/\/securelist.com\/schroedingers-petya\/78870\/   Industrial threats:   The ICS Armageddon didn’t come yet (and we are happy to be wrong on that), however, we’ve seen ICS come under attack from Industoyer – https:\/\/www.welivesecurity.com\/2017\/06\/12\/industroyer-biggest-threat-industrial-control-systems-since-stuxnet\/   IoT:   A brick by any other name Yes! BrickerBot – https:\/\/arstechnica.com\/information-technology\/2017\/04\/brickerbot-the-permanent-denial-of-service-botnet-is-back-with-a-vengeance\/   Information Warfare:   Yes, multiple examples – https:\/\/citizenlab.ca\/2017\/05\/tainted-leaks-disinformation-phish\/   What can we expect in 2018?   More supply chain attacks. Kaspersky Lab’s Global Research and Analysis Team tracks over 100 APT (advanced persistent threat) groups and operations. Some of these are incredibly sophisticated and possess wide arsenals that include zero-day exploits, fileless attack tools, and combine traditional hacking attacks with handovers to more sophisticated teams that handle the exfiltration part. We have often seen cases in which advanced threat actors have attempted to breach a certain target over a long period of time and kept failing at it. This was either due to the fact that the target was using strong internet security suites, had educated their employees not to fall victim to social engineering, or consciously followed the Australian DSD TOP35 mitigation strategies for APT attacks. In general, an actor that is considered both advanced and persistent won’t give up that easily, they’ll continue poking the defenses until they find a way in. When everything else fails, they are likely to take a step back and re-evaluate the situation. During such a re-evaluation, threat actors can decide a supply chain attack can be more effective than trying to break into their target directly. Even a target whose networks employ the world’s best defenses is likely using software from a third-party. The third party might be an easier target and can be leveraged to attack the better protected original target enterprise.  During 2017, we have seen several such cases, including but not limited to:   Shadowpad  CCleaner  ExPetr \/ NotPetya   These attacks can be extremely difficult to identify or mitigate. For instance, in the case of Shadowpad, the attackers succeeded in Trojanizing a number of packages from Netsarang that were widely used around world, in banks, large enterprises, and other industry verticals. The difference between the clean and Trojanized packages can be dauntingly difficult to notice –in many cases it’s the command and control (C&C) traffic that gives them away.  For CCleaner, it was estimated that over 2 million computers received the infected update, making it one of the biggest attacks of 2017. Analysis of the malicious CCleaner code allowed us to correlate it with a couple of other backdoors that are known to have been used in the past by APT groups from the ‘Axiom umbrella’, such as APT17 also known as Aurora. This proves the now extended lengths to which APT groups are willing to go in order to accomplish their objectives.  Our assessment is that the amount of supply chain attacks at the moment is probably much higher than we realize but these have yet to be noticed or exposed. During 2018, we expect to see more supply chain attacks, both from the point of discovery and as well as actual attacks. Trojanizing specialized software used in specific regions and verticals will become a move akin to waterholing strategically chosen sites in order to reach specific swaths of victims and will thus prove irresistible to certain types of attackers.  More high-end mobile malware. In August 2016, CitizenLab and Lookout published their analysis of the discovery of a sophisticated mobile espionage platform named Pegasus. Pegasus, a so-called ‘lawful interception’ software suite, is sold to governments and other entities by an Israeli company called NSO Group. When combined with zero-days capable of remotely bypassing a modern mobile operating systems’ security defenses, such as iOS, this is a highly potent system against which there is little defense.  In April 2017, Google published its analysis of the Android version of the Pegasus spyware which it called Chrysaor . In addition to ‘lawful surveillance’ spyware such as Pegasus and Chrysaor, many other APT groups have developed their own mobile malware implants. Due to the fact that iOS is an operating system locked down from introspection, there is very little that a user can do to check if their phone is infected. Somehow, despite the greater state of vulnerability of Android, the situation is better on Android where products such as Kaspersky AntiVirus for Android are available to ascertain the integrity of a device.  Our assessment is that the total number of mobile malware existing in the wild is likely higher than currently reported, due to shortcomings in telemetry that makes these more difficult to spot and eradicate. We estimate that in 2018 more high-end APT malware for mobile will be discovered, as a result of both an increase in the attacks and improvement in security technologies designed to catch them.  More BeEF-like compromises with web profiling. Due to a combination of increased interest and better security and mitigation technologies being deployed by default in operating systems, the prices of zero-day exploits have skyrocketed through 2016 and 2017. For instance, the latest Zerodium payout chart lists up to $1,500,000 for a complete iPhone (iOS) Remote jailbreak with persistence attack, which is another way of saying ‘a remote infection without any interaction from the user’.  The incredible prices that some government customers have most certainly chosen to pay for these exploits mean there is increasing attention paid towards protecting these exploits from accidental disclosure. This translates into the implementation of a more solid reconnaissance phase before delivering the actual attack components. The reconnaissance phase can, for instance emphasize the identification of the exact versions of the browser used by the target, their operating system, plugins and other third-party software. Armed with this knowledge, the threat actor can fine tune their exploit delivery to a less sensitive ‘1-day’ or ‘N-day’ exploit, instead of using the crown jewels .  These profiling techniques have been fairly consistent with APT groups like Turla and Sofacy , as well as Newsbeef (a.k.a. Newscaster, Ajax hacking team, or  ‘Charming Kitten’), but also other APT groups known for their custom profiling frameworks, such as the prolific Scanbox. Taking the prevalence of these frameworks into account in combination with a surging need to protect expensive tools, we estimate the usage of profiling toolkits such as ‘BeEF ‘ will increase in 2018 with more groups adopting either public frameworks or developing their own.  Sophisticated UEFI and BIOS attacks. The Unified Extensible Firmware Interface (UEFI) is a software interface which serves as the intermediary between the firmware and the operating system on modern PCs. Established in 2005 by an alliance of leading software and hardware developers, Intel most notable amongst them, it’s now quickly superseding the legacy BIOS standard. This was achieved thanks to a number of advanced features that BIOS lacks: for example, the ability to install and run executables, networking and Internet capabilities, cryptography, CPU-independent architecture and drivers, etc. The very advanced capabilities that make UEFI such an attractive platform also open the way to new vulnerabilities that didn’t exist in the age of the more rigid BIOS. For example, the ability to run custom executable modules makes it possible to create malware that would be launched by UEFI directly before any anti-malware solution – or, indeed, the OS itself – had a chance to start. The fact that commercial-grade UEFI malware exists has been known since 2015, when the Hacking team UEFI modules were discovered. With that in mind, it is perhaps surprising that no significant UEFI malware has been found, a fact that we attribute to the difficulty in detecting these in a reliable way. We estimate that in 2018 we will see the discovery of more UEFI-based malware.  Destructive attacks continue. Beginning in November 2016, Kaspersky Lab observed a new wave of wiper attacks directed at multiple targets in the Middle East. The malware used in the new attacks was a variant of the infamous Shamoon worm that targeted Saudi Aramco and Rasgas back in 2012. Dormant for four years, one of the most mysterious wipers in history has returned. Also known as Disttrack, Shamoon is a highly destructive malware family that effectively wipes the victim machine. A group known as the ‘Cutting Sword of Justice’ took credit for the Saudi Aramco attack by posting a Pastebin message on the day of the attack (back in 2012), and justified the attack as a measure against the Saudi monarchy. The Shamoon 2.0 attacks seen in November 2016 targeted organizations in various critical and economic sectors in Saudi Arabia. Just like the previous variant, the Shamoon 2.0 wiper aims for the mass destruction of systems inside compromised organizations. While investigating the Shamoon 2.0 attacks, Kaspersky Lab also discovered a previously unknown wiper malware that appears to be targeting organizations in Saudi Arabia. We’ve called this new wiper StoneDrill and have been able to link it with a high degree of confidence to the Newsbeef APT group.  In addition to Shamoon and Stonedrill, 2017 has been a tough year in terms of destructive attacks. The ExPetr\/NotPetya attack, which was initially considered to be ransomware , turned out to be a cleverly camouflaged wiper as well. ExPetr was followed by other waves of ‘ransomware’ attacks, in which there is little chance for the victims to recover their data; all cleverly masked ‘wipers as ransomware’. One of the lesser known facts about ‘wipers as ransomware’ is perhaps that a wave of such attacks was observed in 2016 from the CloudAtlas APT, which leveraged what appeared to be ‘wipers as ransomware’ against financial institutions in Russia.  In 2018, we estimate that destructive attacks will continue to rise, leveraging its status as the most visible type of cyberwarfare.  More subversion of cryptography. In March 2017, IoT encryption scheme proposals developed by the NSA came into question with Simon and Speck variant ISO approvals being both withdrawn and delayed a second time . In August 2016, Juniper Networks announced the discovery of two mysterious backdoors in their NetScreen firewalls. Perhaps the most interesting of the two was an extremely subtle change of the constants used for the Dual_EC random number generator, which would allow a knowledgeable attacker to decrypt VPN traffic from NetScreen devices. The original Dual_EC algorithm was designed by the NSA and pushed through NIST. Back in 2013, a Reuters report suggested that NSA paid RSA $10 million to put the vulnerable algorithm in their products as a means of subverting encryption. Even if the theoretical possibility of a backdoor was identified as early as 2007, several companies (including Juniper) continued to use it with a different set of constants, which would make it theoretically secure. It appears that this different set of constants made some APT actor unhappy enough to merit hacking into Juniper and changing the constants to a set that they could control and leverage to decrypt VPN connections.  These attempts haven’t gone unnoticed. In September 2017, an international group of cryptography experts have forced the NSA to back down on two new encryption algorithms, which the organization was hoping to standardize.  In October 2017, news broke about a flaw in a cryptographic library used by Infineon in their hardware chips for generation of RSA primes. While the flaw appears to have been unintentional, it does leave the question open in regards to how secure are the underlying encryption technologies used in our everyday life, from smart cards, wireless networks or encrypted web traffic. In 2018, we predict that more severe cryptographic vulnerabilities will be found and (hopefully) patched, be they in the standards themselves or the specific implementations.  Identity in e-commerce comes into crisis. The past few years have been punctuated by increasingly catastrophic large-scale breaches of personally identifiable information (PII). Latest among these is the Equifax breach reportedly affecting 145.5 million Americans.  While many have grown desensitized to the weight of these breaches, it’s important to understand that the release of PII at scale endangers a fundamental pillar of e-commerce and the bureaucratic convenience of adopting the Internet for important paperwork. Sure, fraud and identity theft have been problems for a long time, but what happens when the fundamental identifying information is so widely proliferated that it’s simply not reliable at all? Commerce and governmental institutions (particularly in the United States) will be faced with a choice between scaling back the modern comforts of adopting the Internet for operations or doubling down on the adoption of other multi-factor solutions. Perhaps thus far resilient alternatives like ApplePay will come into vogue as de facto means of insuring identity and transactions, but in the meantime we may see a slowdown in the critical role of the Internet for modernizing tedious bureaucratic processes and cutting operational costs.  More router and modem hacks. Another known area of vulnerability that has gone vastly ignored is that of routers and modems. Be they home or enterprise, these pieces of hardware are everywhere, they’re critically important to daily operations, and tend to run proprietary pieces of software that go unpatched and unwatched. At the end of the day, these little computers are Internet-facing by design and thereby sitting at a critical juncture for an attacker intent on gaining persistent and stealthy access to a network. Moreover, as some very cool recent research has shown , in some cases attackers might even be able to impersonate different Internet users, making it possible to throw off the trail of an attacker entirely to a different connecting address. At a time of increased interest in misdirection and false flags, this is no small feat. Greater scrutiny of these devices will inevitably yield some interesting findings.  A medium for social chaos. Beyond the leaks and political drama of the past year’s newfound love for information warfare, social media itself has taken a politicized role beyond our wildest dreams. Whether it’s at the hand of political pundits or confusing comedic jabs at Facebook’s CEO by South Park’s writers, eyes have turned against the different social media giants demanding some level of fact-checking and identification of fake users and bots attempting to exert disproportionate levels of social influence. Sadly, it’s becoming obvious that these networks (which base their success on quantified metrics like ‘daily active users’) have little incentive to truly purge their user base of bots. Even when these bots are serving an obvious agenda or can be tracked and traced by independent researchers. We expect that as the obvious abuse continues and large bot networks become accessible to wider swaths of politically unsavory characters, that the greater backlash will be directed at the use of social media itself, with disgusted users eagerly looking for alternatives to the household giants that revel in the benefits of the abuse for profits and clicks.   APT predictions – conclusion  In 2017 we pronounced the death of Indicators of Compromise . In 2018, we expect to see advanced threat actors playing to their new strengths, honing their new tools and the terrifying angles described above.  Each year’s themes and trends shouldn’t be taken in isolation – they build on each other to enrich an ever-growing landscape of threats facing users of all types, be it individuals, enterprise, or government. The only consistent reprieve from this onslaught is the sharing and knowledgeable application of high-fidelity threat intelligence.  While these predictions cover trends for advanced targeted threats, individual industry sectors will face their own distinct challenges. In 2018, we wanted to shine the spotlight on some of those as well – and have prepared predictions for the connected healthcare, automotive, financial services, and industrial security sectors, as well as cryptocurrencies. You can find them all here!  Threat Predictions for Automotive in 2018  Threat Predictions for Connected Health in 2018  Threat Predictions for Financial Services and Fraud in 2018  Threat Predictions for Industrial Security in 2018  Threat Predictions for Cryptocurrencies in 2018  Threat Predictions for Connected Life in 2018","url":"https:\/\/securelist.com\/ksb-threat-predictions-for-2018\/83169\/"},{"Unnamed: 0":0,"query":"APT17","text":"Chinese Threat Group Uses Microsoft's TechNet Portal to Host C&C IPs\r\n\nThe Chinese threat actor known as APT17 and DeputyDog has been using profile pages and forum threads on Microsoft’s TechNet web portal to host IP addresses for command and control (C&C) servers.\nResearchers at FireEye Threat Intelligence and the Microsoft Threat Intelligence Center have prepared a brief report on the advanced persistent threat (APT) actor’s C&C obfuscation techniques.\nExperts have determined that the attackers haven’t actually compromised Microsoft’s website. Instead, they are using the portal’s legitimate functionality to host encoded strings that hide C&C IP addresses.\nAPT17 is a Chinese threat group that has been targeting United States government organizations, the military, law firms, defense contractors, IT firms, mining companies, and NGOs. One of the tools leveraged by the group is BLACKCOFFEE, a backdoor that can be used to upload and download files, create a reverse shell on the infected system, enumerate files and processes, manipulate files, and terminate processes.\nThe malware, which has been used by APT17 since at least 2013, now gets the IP address of the C&C server it’s supposed to communicate with from an encoded string embedded on the TechNet portal.\nThe new version of BLACKCOFFEE contains URLs that point to TechNet forum threads or biography sections in profiles created by the attacker. The encoded string that hides the IP address in plain sight is found in profiles and posts between the “@MICROSOFT” and “CORPORATION” tags.\nIn one example mentioned in the report from FireEye and Microsoft, the encoded IP address was published by the attackers in a forum post that appeared to contain useful information for solving a user’s problem.\nOnce the IP for the C&C is obtained, the malware starts communicating with the server. BLACKCOFFEE uses the C&C server to receive commands and to send information stolen from the infected device back to the malicious actors.\n“If the C2 server is discovered or shut down, the threat actors can update the encoded IP address on TechNet to maintain control of the victims’ machines,” the companies explained in the report.\nExperts have pointed out that the use of a legitimate service, dubbed by some a “dead drop resolver,” and the embedding of an encoded IP address benefits the attackers because it delays detection, and can prevent the discovery of the C&C server’s IP address. FireEye believes other threat groups are already using, or will use, variations of this technique in their operations.\n“After discovering the BLACKCOFFEE activity, the FireEye-Microsoft team encoded a sinkhole IP address into the profile pages and forum threads and locked the accounts to prevent the threat actors from making any changes,” the report noted. “This collaborative approach allowed the team to observe the malware and its victims. With this information, Microsoft and FireEye can work with the anti-virus community to generate signatures to identify and clean systems affected by the malware and alert other forum and message board managers to be on the lookout for this technique.”","url":"https:\/\/www.securityweek.com\/chinese-threat-group-uses-microsofts-technet-portal-host-cc-ips"},{"Unnamed: 0":1,"query":"APT17","text":"Researchers Link CCleaner Attack to State-sponsored Chinese Hackers\r\n\nThe sophisticated supply chain attack that resulted in millions of users downloading a backdoored version of the popular CCleaner PC software utility was the work of state-sponsored Chinese hackers, according to a new report.\nThe attack started with the compromise of a CCleaner server in early July, which allowed hackers to inject backdoor code in two versions of the tool, namely 32-bit CCleaner v5.33.6162 and CCleaner Cloud v1.07.3191. Between August 15 and September 12, over 2.27 million users downloaded the infected binaries.\nInvestigation into the attack revealed that the backdoored code was only the first stage of the intended user compromise, and that a second-stage payload had been delivered to a small number of selected targets.\nAfter finding the backup of a deleted database containing information on the infected machines, investigators discovered that a total of 1,646,536 unique machines (based on MAC addresses) reported to the command and control (C&C) server. The stage 2 payload, however, was served to only 40 of them.\nSoon after the investigation started, the security researchers looking into the incident discovered some connections to a known group of Chinese hackers, but no definite attribution was made.\nNow, Intezer researchers suggest that the attack was state-sponsored and that it can indeed be attributed to Chinese hackers that are part of the Axiom group.\nAlso referred to as APT17 or DeputyDog, the group was previously associated with Operation Aurora, which started in 2009 and targeted companies such as Google, Adobe Systems, Juniper Networks, Rackspace, Yahoo, Symantec, Northrop Grumman, and Dow Chemical. The group specializes in supply chain attacks and Operation Aurora is considered one of the most sophisticated incidents ever.\nAccording to Intezer, an analysis of the stage 2 payload used in the CCleaner attack provided a clear link to the Chinese hackers after the first payload (the backdoor in the installer) revealed shared code with Axiom group.\nWhile looking at the backdoor, the researchers discovered unique code implementation “only previously seen in APT17 and not in any public repository.” Now, they reveal that the stage 2 payload contains code that is an exact match to APT17 malware seen before.\n“The author probably copied and pasted the code, which is what often happens to avoid duplicative efforts: rewriting the same code for the same functionality twice. Due to the uniqueness of the shared code, we strongly concluded that the code was written by the same attacker,” Intezer’s Jay Rosenberg notes.\nAnalysis of the stage 2 payload revealed that one of the dropped modules is another backdoor designed to connect to a few domains. It would also connect to an IP to grab the next stage payload, which the researchers haven’t been able to identify until now.\n“The complexity and quality of this particular attack has led our team to conclude that it was most likely state-sponsored. Considering this new evidence, the malware can be attributed to the Axiom group due to both the nature of the attack itself and the specific code reuse throughout that our technology was able to uncover,” Rosenberg concludes.\nRelated: Backup Database Reveals Scale of CCleaner Hack\nRelated: Attack on Software Firm Was Sophisticated, Highly Targeted","url":"https:\/\/www.securityweek.com\/researchers-link-ccleaner-attack-state-sponsored-chinese-hackers"},{"Unnamed: 0":2,"query":"APT17","text":"CCleaner Incident Investigation Reveals Possible Stage 3 Payload\r\n\nCANCUN - KASPERSKY SECURITY ANALYST SUMMIT - The investigation into the September 2017 CCleaner incident has revealed what appears to be a stage three payload that attackers supposedly intended to deliver to infected users.\nThe attack was disclosed on September 18, when security firm Avast revealed that 2.27 million users worldwide had downloaded an infected CCleaner installation file between August 15 and September 12. Hackers had added a backdoor to the 32-bit CCleaner v5.33.6162 and CCleaner Cloud v1.07.3191 releases, Avast revealed.\nWhat led to this was the compromise of the distribution servers of Piriform, the company developing CCleaner, in the months before Avast purchased the software firm. The code in the modified installers could collect non-sensitive information from the infected machines, and could also deliver a second stage binary.\nThis revealed that the incident was in fact a highly targeted attack, as the second-stage payload was delivered to only 40 computers out of the millions that downloaded stage one. While no stage three binary was found on the affected systems, Avast now says that the attackers, the Chinese hacking group Axiom (also known as APT17 or DeputyDog), apparently had plans to deliver such malware as well.\nDuring its investigation of the Piriform infrastructure, the security firm discovered not only stage one and stage two binaries on the network, but also evidence of a third stage on four computers. Dubbed ShadowPad, this is a specialized tool that provides cybercriminals with remote control capabilities.\nIn an August 2017 report, Kaspersky revealed that the ShadowPad backdoor was found in NetSarang’s products, which are used by hundreds of companies in the financial, software, media, energy, electronics, insurance, industrial, construction, manufacturing, retail, telecoms, pharmaceutical, and transportation sectors.\n“The tool was installed on the four Piriform computers on April 12th, 2017, while the preliminary version of the second stage had been installed on the computers March 12th, 2017,” Avast says.\nThe command and control (C&C) server the older second stage variant was attempting to connect to was no longer up during the investigation and the researchers don’t know exactly what it was supposed to download. However, given the timeline of events, they assume that it “had downloaded and installed ShadowPad on the four Piriform computers.”\nThe fact that ShadowPad is believed to have been developed by the Axiom group, the same actor behind the CCleaner attack, is also a strong indicator that this malware was intended to become the third stage payload, Avast says.\nThe ShadowPad version used in the attack was custom-built, leading investigators to suspect it was explicitly created for Piriform.\nThe security firm also discovered ShadowPad log files containing encrypted key strokes from a keylogger that became active on the infected machines on April 12, 2017. Other tools were also installed on the four computers, including a password stealer, along with tools that could install more software and plugins on the infected machines.\n“While ShadowPad was installed on the Piriform network itself and, as far as we can tell through our investigations today, not on any of the CCleaner customers’ computers, we believe that this tool was the intended third stage for the CCleaner customers,” Avast says.\nThe second-stage malware deployed to only 40 computers of the millions that downloaded the infected CCleaner versions, but Avast couldn’t determine whether the third stage payload was meant for all of them or only a few, if any.\nRelated: Researchers Link CCleaner Attack to State-sponsored Chinese Hackers\nRelated: Backdoors Found in Tools Used by Hundreds of Organizations","url":"https:\/\/www.securityweek.com\/ccleaner-incident-investigation-reveals-possible-stage-3-payload"},{"Unnamed: 0":3,"query":"APT17","text":"Researchers Link Several State-Sponsored Chinese Spy Groups\r\n\nResearchers have discovered links between several cyber espionage groups believed to be sponsored by the Chinese government and found that at least some of them may be working from the Xicheng District of Beijing.\nA report published last week by 401TRG, the threat research and analysis team at ProtectWise, revealed links between several campaigns conducted over the past decade. Researchers claim that various threat groups previously attributed to Chinese-speaking actors are all connected to China’s state intelligence apparatus under what they call the “Winnti umbrella.”\nThreat actors such as Winnti, Gref, PlayfullDragon, APT17, DeputyDog, Axiom, BARIUM, LEAD, PassCV, Wicked Panda, and ShadowPad are all believed to be part of the Winnti umbrella based on the use of similar tactics, techniques, and procedures (TTPs), and overlaps in infrastructure and operations. Experts believe they are “the work of individual teams, including contractors external to the Chinese government, with varying levels of expertise, cooperating on a specific agenda.”\nThese hacker groups have been active since at least 2009 – possibly as early as 2007 – and their initial targets are often gaming studios and high-tech companies located in countries such as the United States, Japan, South Korea and China. The main goal appears to be harvesting code-signing certificates and manipulating software, with a secondary objective of financial gain.\nResearchers said the Winnti umbrella’s main targets appear to be political, such as Uyghur and Tibetan activists, Tibetan and Chinese journalists, the government of Thailand (e.g. Bookworm), and major international tech companies.\nThese groups continue to launch campaigns, with operations seen as recently as late March. In the attacks observed this year, the hackers have focused on phishing – particularly targeted at Office 365 and Gmail accounts – rather than malware and exploits.\nThe cyberspies often target cloud storage accounts from which they hope to obtain code-signing certificates. In some cases, they also seek files and documents that could help them escalate privileges and move laterally within the victim’s network.\nWhile the attackers have taken steps to hide their identity, they have made some mistakes, providing investigators important clues about their possible location.\n“In the attackers’ ideal situation, all remote access occurs through their own C2 infrastructure, which acts as a proxy and obscures their true location,” 401TRG said in its report. “However, we have observed a few cases of the attackers mistakenly accessing victim machines without a proxy, potentially identifying the true location of the individual running the session. In all of these cases, the net block was 221.216.0.0\/13, the China Unicom Beijing Network, Xicheng District.”\nRelated: 'Tick' Cyber Espionage Group Linked to China\nRelated: China-Linked Spies Used New Malware in U.K. Government Attack\nRelated: Chinese Cyberspies Deliver New Malware via CPL Files","url":"https:\/\/www.securityweek.com\/researchers-link-several-state-sponsored-chinese-spy-groups"},{"Unnamed: 0":4,"query":"APT17","text":"Cyber Espionage Targets Interests in South China Sea\r\n\nA cyber espionage campaign has been discovered apparently targeting participants in the recent Permanent Court of Arbitration case brought by the Philippines against China over Chinese claims of sovereignty in the South China Sea. The case was found against China last month. China itself did not accept the validity of the case, did not attend the arbitration, and has since rejected the ruling.\nThe cyber espionage campaign was discovered by F-Secure. It named it NanHaiShu, and has today published an analysis  of the methodology and malware involved. NanHaiShu (南海鼠) translates to \"South China Sea Rat\" in English.\nThe malware was delivered by highly targeted emails in which individually crafted messages demonstrate that only specific organizations were targeted. These include the Philippines Court of Justice, the organizers of last November's APEC Summit held in the Philippines (during which it was expected that the South China Sea dispute would be discussed), and a major international law firm that represents one of the parties in the dispute.\nThe malware delivered to the law firm was contained in an Excel macro. The message talks about \"the range of salaries and\/or bonuses\", and the XLS attachment filename is 'Salary and Bonus Data.xls'. The combination of the email message and a VBA delivery mechanism suggests that considerable effort was put into researching the targets and socially engineering the attack. VBA simply will not work for targets with Excel's default settings, suggesting that the attackers were aware that their targets specifically allow macros within their day to day work.\nThe malware itself is a remote access trojan (RAT) capable of downloading additional malware and exfiltrating files to the C&C server. F-Secure doesn't know what files might have stolen from the victims, so cannot absolutely confirm the arbitration case as the primary motive. The timeline of infections, targets and notable events around the arbitration does, however, provide compelling circumstantial evidence.\nThe malware shows strong indications of Chinese origins, with code reused from Chinese forums. \"The malware's VBA base64 decoder function seems to be popular among Chinese programmers,\" notes the report. \"Searching for the variable names on the Internet leads to a handful of Chinese websites.\"\nBut F-Secure does not attribute the attacks to the Chinese government, nor even to a specific Chinese malware group. F-Secure cyber security advisor Erka Koivunen told SecurityWeek that he cannot say for certain that the malware relates to any existing group (although some researchers are looking for similarities with the APT 17 group and the BLACKCOFFEE). He also said that attributing the attacks to the Chinese government would be a step too far; but he did say that he expects to see more of this group in the future.\nDespite F-Secure's refusal to describe this campaign as state-sponsored, there will undoubtedly be those who will make such an assumption. Since China was not present at an international arbitration case involving their own territorial claims means they would not have direct access to some of the information presented or discussed. Espionage would be one way to obtain this information.\nUnder such an assumption, the NanHaiShu gang become the equivalent of LEA informants -- neither under the control of nor working to the instructions of the LEA, but nevertheless providing welcome information to that LEA.\nOne thing is certain -- Chinese feelings in the South China Sea run deep. Soon after after the ruling it commenced a major wargames exercise with, according to ZeroHedge, \"some 300 ships, dozens of fighter planes, and involved troops that are responsible for coastal defense radars, communications, and electronic warfare defense.\"\nIn a separate publication, F-Secure provides information on how this and similar malware campaigns can be discovered and defeated.","url":"https:\/\/www.securityweek.com\/cyber-espionage-targets-interests-south-china-sea"}]