[{"Unnamed: 0":0,"query":"APT12","text":"China-Linked Spies Target Taiwan With IE Exploit\r\n\nA cyberespionage group linked to China has been spotted targeting government organizations in Taiwan using an Internet Explorer vulnerability patched by Microsoft earlier this year.\nResearchers have been monitoring a campaign they’ve dubbed “CNACOM,” in which attackers have used compromised websites to deliver a piece of malware. One of the compromised sites, known as a watering hole, belonged to a major public service organization in Taiwan.\nWhen users accessed this website’s registration page, an iframe injected into the footer loaded an exploit landing page. The Internet Explorer vulnerability leveraged by this exploit, tracked as CVE-2016-0189, was fixed by Microsoft in May, but it had been seen in targeted attacks against users in South Korea before a patch was made available.\nA few weeks after Microsoft resolved the flaw, researchers published a proof-of-concept (PoC) exploit. The PoC code was used by cybercriminals to integrate the security hole into several exploit kits.\nThe same PoC code has been used in the CNACOM campaign, but the payload has been invoked through an Internet Explorer sandbox escape flaw tracked as CVE-2015-0016.\nIn the CNACOM attacks, the exploit code collects information from the device, including its IP address. If the victim uses Internet Explorer and the IP address is known to belong to the Taiwanese government, the exploit delivers a variant of the malware dubbed Ixeshe.\nIxeshe has been around since at least 2009 and it has been observed in attacks aimed at East Asian governments and electronics manufacturers, including in Taiwan. The malware was also linked to the attacks launched in 2012 against The New York Times.\nThe group behind Ixeshe, also known as APT12, Numbered Panda and DynCalc, is believed to be operating out of China.\nAccording to Zscaler, the Ixeshe variant spotted in the recent Taiwan attacks is different from older versions as the campaign codes it uses are embedded into the malware, which could indicate that the threat relies on a more centralized tracking system.\nZscaler is not the only security firm to monitor China-linked attacks aimed at Taiwan’s government. Palo Alto Networks and FireEye also reported seeing such attacks in the past few months.\nRelated: China-Linked Cyberspies Lure Victims With Security Conference Invites\nRelated: China-Linked APT3 Group Focuses Attacks on Hong Kong","url":"https:\/\/www.securityweek.com\/china-linked-spies-target-taiwan-ie-exploit"},{"Unnamed: 0":1,"query":"APT12","text":"APT Attackers Target Japanese Word Processor Zero-Day\r\n\nSymantec has issued an alert to warn organizations about targeted attacks against a previously undocumented security hole in Ichitaro, a word processing software program used by central and local governments as well as educational institutions in Japan.\nJustsystems, the company that markets the Ichitaro software, has confirmed the issue and warns that live attacks are leading to full remote system compromise.\nAccording to a post on the Symantec Security Response blog, the attacks may be linked to the APT 12 group that successfully hacked into the New York Times earlier this year.\nSymantec said it first spotted attempts to exploit the Ichitaro vulnerability in September 2013.\n\"Our analysis revealed that the samples, detected as Trojan.Mdropper, for these attacks all contained the same back door Trojan, which Symantec detected as Backdoor.Vidgrab. If the exploit is successful, in theory the shell code would be executed to drop and launch the simplified Chinese version of notepad.exe while compromising the system, with the back door connecting to a remote site,\" Symantec warned.\nThe company noted that the identical backdoor variant was used as a payload for a watering hole attack that hit a Microsoft Internet Explorer vulnerability which was patched in October 2013.\nThe research team is speculating that the same malware group is using vulnerabilities in multiple software to launch APT attacks.\n\"[This backdoor] is known to be used to target the Asia-Pacific region with government sectors being the primary targets according to Trend Micro. Symantec telemetries do not dispute this claim,\" the company said. \nIn the latest Ichitaro attacks, Symantec says the Trojan is delivered as e-mail attachments with Ichataro's .jtd file extension. However, the malicious files are actually rich text format files that cannot be opened using Microsoft Word as they are designed to work only with Ichitaro.\n\"An interesting point of this attack campaign is that the malware group used unusual subject lines and email content that are not commonly used in targeted attacks,\" Symantec said.\nThis is a classic spear-phishing attack that attempts to lure the targets to a popular Japanese online shopping site. If the target opens the file, the zero-day vulnerability is exploited and malware is placed on the machine that attempts to connect to a web site associated with the APT 12 group.\nSecurity researchers are noticing a spike in advanced attacks against Japanese targets. Earlier this year, Kaspersky Lab warned about the Icefog cyber-espionage campaign that targeted governmental institutions, military contractors, maritime and ship-building groups, telecom operators, satellite operators, industrial and high technology companies and mass media, mainly in South Korea and Japan.","url":"https:\/\/www.securityweek.com\/apt-attackers-target-japanese-word-processor-zero-day"},{"Unnamed: 0":0,"query":"APT12","text":"Yet Another Zero-Day: Japan Hit with Ichitaro Vulnerability The security industry, as well as IT administrators across the globe, has been busy recently dealing with multiple zero-day vulnerabilities emerging in quick succession. Before anyone has time to draw a breath after the barrage, yet another zero-day has appeared, ready to cause people problems. Well, for people in Japan at least, since the vulnerability is in the Japanese word-processing software Ichitaro. Ichitaro developer JustSystems recently announced that the Multiple Ichitaro Products Unspecified Remote Code Execution Vulnerability (CVE-2013-5990), allowing the execution of arbitrary code, exists in Ichitaro products. In September 2013, Symantec discovered attacks in the wild attempting to exploit this vulnerability; however, the exploits did not properly work to compromise the system in our testing environment. As always, we exercised the responsible vulnerability disclosure process following this discovery. Our analysis revealed that the samples, detected as Trojan.Mdropper, for these attacks all contained the same back door Trojan, which Symantec detected as Backdoor.Vidgrab. If the exploit is successful, in theory the shell code would be executed to drop and launch the simplified Chinese version of notepad.exe while compromising the system, with the back door connecting to a remote site. Coincidently, the identical Backdoor.Vidgrab variant was used as a payload for a watering hole attack exploiting the Microsoft Internet Explorer Memory Corruption Vulnerability (CVE-2013-3893), which was patched in October 2013. It is reasonable to assume that the same malware group, or another group with close connections, is behind the attacks that utilized the Internet Explorer and Ichitaro vulnerabilities. Backdoor.Vidgrab is known to be used to target the Asia-Pacific region with government sectors being the primary targets according to TrendMicro. Symantec telemetries do not dispute this claim. Although Trojan.Mdropper is sent to targets as email attachments with the Ichitaro file extension .jtd, the files are actually .rtf or rich text format files. The files cannot be opened using Microsoft Word as they are designed to work only with Ichitaro. An interesting point of this attack campaign is that the malware group used unusual subject lines and email content that are not commonly used in targeted attacks. One of the emails used in this targeted attack campaign can be seen in the following figure. The email solicits a recipient to buy various goods from a popular Japanese online shopping site. The email also states that all members will earn double the usual points for their purchases and will also receive free shipping. The email attachment is a flyer containing the Ichitaro exploit. In June 2013, Symantec came across a similar Trojan.Mdropper variant with the .jtd file extension, sent to an organization that received the malware mentioned above. The main difference is the file format. While rich text format was used in the recent attacks, a Microsoft Word document file with an embedded Microsoft graph chart was used for the previous attack campaign. The specially-crafted Word document was created with Microsoft Office in the Simplified Chinese language. According to our research, this exploit code also failed to successfully exploit a vulnerability. If successful, the shellcode would have downloaded malware from the following URL : http:\/\/googles.al[REMOVED]my.com\/index.html The server hosting this domain has been associated with the group referred to as APT 12 by Mandiant. The malware itself is detected as Trojan.Krast. The attackers, possibly belonging to the APT12 group who may have also developed BackdoorVidgrab, are persistently targeting similar, if not the identical, targets by attempting to exploit Ichitaro. The attackers may also be using the targets as guinea pigs to test if the exploit code works properly. The attack may also be a precursor, the attackers could have run the tests in order to find effective email contents and subject lines, for example, that are enticing enough lure targets into opening the malicious attachment. The .jtd files described in this blog are detected as Trojan.Mdropper. Also Symantec’s .Cloud products effectively block emails with the malicious Ichitaro attachment. To prevent a possible compromise, Ichitaro users are advised to download and apply the latest patch from JustSystems.","url":"https:\/\/www.symantec.com\/connect\/blogs\/yet-another-zero-day-japan-hit-ichitaro-vulnerability"}]