[{"Unnamed: 0":0,"query":"APT1","text":"Introduction\nIn April 2017, a previously unknown group calling itself IntrusionTruth began releasing blog posts detailing individuals believed to be associated with major Chinese intrusion campaigns. Although the group’s exact motives remain unclear, its initial tranche of information exposed individuals connected to long-running GOTHIC PANDA (APT3) operations, culminating in a connection to the Chinese firm Boyusec (博御信息) and, ultimately, Chinese Ministry of State Security (MSS) entities in Guangzhou.\nRecently, in July and August 2018, IntrusionTruth has returned with new reporting regarding actors with ties to historic STONE PANDA (APT10) activity and has ultimately associated them with the MSS Tianjin Bureau (天津市国家安全局). Though CrowdStrike® Falcon Intelligence™ is currently unable to confirm all of the details provided in these most recent posts with a high degree of confidence, several key pieces of information can be verified.\n\nSeveral of the named individuals have been active registering domains as recently as June 2018, and they responded to the IntrusionTruth blog posts by scrubbing their social media or by following IntrusionTruth’s Twitter account.\nNamed individuals ZHANG Shilong and GAO Qiang have significant connections to known Chinese hacking forums, and they have sourced tools currently in use by China-based cyber adversaries. \nZHANG has registered several sites with overlapping registrant details that show both his affiliation with several physical technology firm addresses as well as his residence in Tianjin. \nNamed firm Huaying Haitai has been connected to a Chinese Ministry of Industry and Information Technology (MIIT) sponsored attack and defense competition; this is similar to GOTHIC PANDA’s ties to an active defense lab sponsored by China Information Technology Evaluation Center (CNITSEC).\nHuaying Haitai has previously hired Chinese students with Japanese language skills; this is significant, as STONE PANDA has engaged in several campaigns targeting Japanese firms. \nThe MSS Tianjin Bureau is confirmed to be located at the described address, not far from many of the registrant addresses listed by ZHANG as well the firms GAO was likely recruiting for. \n\nMore details that may further illuminate these findings and provide a higher confidence in connecting STONE PANDA to the MSS Tianjin Bureau are likely to emerge.\nBackground\nThroughout May 2017, using a variety of historical information and open-source intelligence (OSINT), IntrusionTruth released several blog posts identifying several individuals connected to Boyusec. Though CrowdStrike Intelligence had suspected GOTHIC PANDA was an MSS contractor for several years, the IntrusionTruth posts and subsequent research by RecordedFuture into MSS ties to the China Information Technology Evaluation Center (CNITSEC\/中国信息安全测评中心) corroborated additional details from various sources and provided a higher degree of confidence. Confidence in these findings was further boosted when the U.S. Department of Justice named Boyusec and several of the described individuals in an indictment, and detailed GOTHIC PANDA tactics, techniques, and procedures (TTPs) in detail.\nCrowdStrike Falcon Intelligence was able to independently verify the majority of this information and concluded that not only is CNITSEC associated with the MSS, but its former director WU Shizhong (吴世忠) was simultaneously dual-hatted as the director of the MSS Technology\/13th Bureau (国家安全部科技局局长)1 2 3,  implying that the MSS plays a crucial role in China’s code review of foreign products and is now able to cherry pick high-value vulnerabilities from its own capable domestic bug hunting teams. CNITSEC’s role in code review for foreign entities has led to its access to Microsoft’s source code dating back to 2003 and the use by KRYPTONITE PANDA of a high-value vulnerability (CVE-2018-0802), discovered by Chinese firm Qihoo 360, a month before it was publicly revealed.\nWU Shizhong Presenting on the “Digital Silk Road” at the Second Wuzhen World Internet Conference in 2015\nAs research into the IntrusionTruth leads on STONE PANDA continues, Falcon Intelligence has already observed some consistencies with known MSS operations.\nSinking Like a STONE   \nGAO Qiang (高\/郜 强)\nMany of the personal details for GAO were scrubbed shortly after IntrusionTruth’s post introducing him went live, including his Tencent QQ account. The blog connects him to the moniker fisherxp via an initial spear-phishing campaign from 2010 previously attributed to STONE PANDA. Multiple sites with profile pictures appear to show the owner of the fisherxp accounts, though this has yet to be independently confirmed as GAO. Fisherxp’s QQ shows his alternate username as 肥猪 or “big porker”. IntrusionTruth later links GAO to several documented Uber rides to the MSS Tianjin Bureau’s office address where both his first name, Qiang\/强, and 猪 are used by the app to identify him and tie him to the QQ number 420192. CrowdStrike cannot confirm the validity of these Uber receipts at this time.\nHowever, fisherxp’s account on popular Chinese technology forum 51CTO is still active and shows that he has downloaded not only the open-source DarkComet RAT and numerous password cracking tools, but more importantly, several favorite tools used by a plethora of known Chinese cyber adversaries including Gh0st RAT 3.6, zxarps (an ARP-spoofing tool by legacy hacker LZX), and lcx.exe (a port-forwarding tool by legacy hacker LCX)4.\nZHANG Shilong (张世龙)\nZHANG was originally introduced by IntrusionTruth as a reciprocal follower of fisherxp’s Twitter account via his own @baobeilong account. Baobeilong (宝贝龙\/”Baby Dragon”) also maintained a GitHub account that had forked both the Quasar and Trochilus RATs, two open-source tools historically used by STONE PANDA, but the account has since been scrubbed. This information was verified by CrowdStrike before being removed completely. Falcon Intelligence recently independently conducted detailed analysis of the RedLeaves malware used to target numerous Japanese defense groups and found it was directly sourced from Trochilus code, but it has undergone several evolutions and contains prefixes suggesting it could also be used to target Russia and the DPRK. There is no conclusive evidence at this time that RedLeaves is solely attributed to STONE PANDA. \nBaobeilong did maintain a Flickr account with numerous pictures that proved key in identifying his location later, similar to how cpyy’s photos helped identify his affiliation to the People’s Liberation Army (PLA) in CrowdStrike’s PUTTER PANDA report.\nIntrusionTruth then drew connections from baobeilong’s other online accounts to registrant details for xiaohong[.]org, which dated back to 2007 and revealed ZHANG’s full name—ZHANG Shilong. From there, a trail of overlapping registrant details reveals ZHANG’s hanzi characters for his name (张世龙), likely one of his personal home addresses, potential work addresses and several email addresses:\n\nlong@xiaohong[.]org\nbaobei@xiaohong[.]org\natreexp@yahoo[.]com.cn \nrobin4700@foxmail[.]com\neshilong@vip.qq[.]com   \n\nSpecifically tracing registrant details from atreexp → robin4700 → eshilong shows that ZHANG was active registering sites as recently as June 5, 2018, including a personal blog where his picture and name features prominently along with several technology-related blog posts.  \nA picture from baobeilong’s Flickr account shows a fire at the Tianjin Medical Center 120\nLaoying Baichen Instruments\nThe original blog post on GAO lists his contact information in recruitment postings for two separate companies, one of which is Laoying Baichen Instruments (characters unknown at the time of this writing). No records could be found for such a firm, however, IntrusionTruth lists the address associated with it as Room 1102, Guanfu Mansion, 46 Xinkai Road, Hedong District, Tianjin (天津市河东区新开路46号冠福大厦1102). \nDuring the course of investigating Laoying and the Guanfu mansion, Falcon Intelligence noticed that the Guanfu Mansion is also the registered address of a firm called Tianjin Henglide Technology Co., Ltd. (恒利德天津科技有限公司), which is listed as one of only a few “review centers” certified by CNITSEC in Tianjin5. Laoying and Henglide are listed as being on different floors, however having a CNITSEC review center in the same building is noteworthy given CNITSEC’s connection to MSS and previous linkage to Boyusec\/GOTHIC PANDA.\nZhang is believed to have taken the photo of the fire from the Wanchan Meizhuan Mansion. This is relatively close to both the Yuyang Complex (one of Zhang’s listed registrant addresses) and the Guanfu Mansion, Laoying Baichen’s listed address.\nTianjin Huaying Haitai Science and Technology Development Company \nThe other firm GAO appears to have been recruiting for is Huaying Haitai (天津华盈海泰科技发展有限公司). As the IntrusionTruth blog post mentions, it is a registered firm with two listed representatives, Fang Ting (方亭) and Sun Lei (孙杰), and a listed address of 1906 Fuyu Mansion (天津市河西区解放南路中段西侧富裕大厦1-1906). \nSearches for more information on Huaying Haitai turned up two interesting government documents. One is a recruitment Excel sheet detailing recent graduates, their majors and their new employers and addresses. Huaying Haitai is listed as having hired a recently graduated female student from Nankai University in 2013 who majored in Japanese. This is interesting considering STONE PANDA’s extensive targeting of Japanese defense firms after this time period, but it is by no means conclusive evidence that the firm is connected to STONE PANDA.\n\nThe second government document lists Huaying Haitai as the co-organizer of a Network Security Attack and Defense competition with the Ministry of Industry and Information Technology’s (MIIT) national training entity, NSACE6. It was open for all students of Henan Province. \nNSACE appears to be a national education body that teaches network information security, including offensive activity7. This information is particularly interesting given Boyusec’s previous work at CNITSEC’s Guangdong subsidiary setting up a joint active defense lab8.  It suggests that these technology firms act as both shell companies and recruitment grounds for potential MSS use in cyber operations.\n\nMSS Tianjin Bureau\nThe most recent IntrusionTruth post assesses that GAO’s Uber rides frequently took him from Huaying’s address at the Fuyu Mansion to 85 Zhujiang Road (珠江道85号). \n\nWhen observed closely, the compound is a striking one complete with towers, a fenced perimeter with surveillance cameras, guarded entrances, and a building with a significant number of satellite dishes.\n\nThere are no markers on the building and no government listed address; however, it is apparently difficult for locals to determine where the Tianjin Bureau’s location is as well. There are several Baidu questions asking what transportation routes are best to get to that specific address. Three separate ones specifically mention the 85 Zhujiang Road address as the headquarters for the MSS’s Tianjin Bureau and the difficulty in finding its location9 10 11.\n\nAs with most cyber-enabled operations, satellite arrays are often indicative of installations with significant signals intelligence (SIGINT) capabilities. The Tianjin Bureau appears to have the potential for such capabilities, housing several large arrays that appear to have existed since at least January 2004.\nBarely visible satellite dishes from the street view of 85 Zhujiang Road outside the compound\nConclusion\nThere are still significant intelligence gaps that prevent Falcon Intelligence from making an assessment about STONE PANDA’s potential connections to the MSS Tianjin Bureau with a high degree of confidence. However, additional information is likely to materialize either directly from IntrusionTruth or from other firms in the infosec community who are undoubtedly looking at this material as well and may have unique insight of their own. Ultimately, IntrusionTruth’s prior releases on GOTHIC PANDA proved accurate and led to a U.S. Department of Justice indictment resulting in the dismantling of Boyusec. From their latest post, which contains GAO’s Uber receipts, it is clear the group’s information likely goes beyond merely available OSINT data. \nIt cannot be ignored that there are striking similarities between the entities associated with GOTHIC PANDA and the actors and firms mentioned in the blogs about STONE PANDA. In addition, FalconIntelligence notes that following the late 2015 Sino-U.S. brief cyber detente, much of the responsibility for western cyber intrusion operations was handed to the MSS as the PLA underwent an extensive reform that is still currently underway, and which is consolidating its military cyber forces under the Strategic Support Force. \nThough the detente saw an initial drop in Chinese intrusion activity, it has steadily been increasing over the past several years, with a majority of the intrusions into western firms being conducted by suspected contractors. These adversaries are tracked by CrowdStrike as GOTHIC PANDA, STONE PANDA, WICKED PANDA, JUDGMENT PANDA, and KRYPTONITE PANDA. Many of these adversaries have begun targeting supply chain and upstream providers to establish a potential platform for future operations and enable the collection of larger sets of data.\nWhile the APT1, PUTTER PANDA, and Operation CameraShy reports all exposed PLA units at a time when Chinese military hacking against western firms was rampant, the attention has now swung toward identifying MSS contractors. The exposure of STONE PANDA as an MSS contractor would be another blow to China’s current cyber operations given STONE PANDA’s prolific targeting of a variety of sectors, and may prompt an additional U.S. investigation at a tenuous time for Sino-U.S. relations during an ongoing trade war. However, it is important to note that such public revelations often force these actors to cease operations, improve their operational security (OPSEC), and then return stronger than before. As such, CrowdStrike Falcon Intelligence assesses that although Boyusec may have shuttered, elements of GOTHIC PANDA are likely to still be active. The same is likely to be true for STONE PANDA following a period of silence.   \nThe activities of STONE PANDA impact entities in the Aerospace & Defense, Government,  Healthcare, Technology,  Telecommunications Services of several nations. \nFor more information on how to incorporate intelligence on threat actors like STONE PANDA into your security strategy, please visit the Falcon Intelligence product page.\nFootnotes\n\nhttp:\/\/kjbz.mca.gov[.]cn\/article\/mzbzhzcwj\/201106\/20110600157934.shtml\nhttp:\/\/bjgwql[.]com\/a\/hezuojiaoliu\/2011\/0422\/288.htm\nhttp:\/\/alumni.ecnu.edu[.]cn\/s\/328\/t\/528\/3b\/02\/info80642.htm\nhttp:\/\/down.51cto[.]com\/424761\/down\/1\/\nhttp:\/\/www.djbh[.]net\/webdev\/web\/LevelTestOrgAction.do?p=nlbdLv3&id=402885cb35d11a540135d168e41e000c\nhttp:\/\/rjzyjsxy.zzia.edu[.]cn\/picture\/article\/25\/27\/01\/6c8b24a143f9959a85301d4527f0\/801f81cf-8f30-4aa4-8428-7f9d4e778e76.doc\nhttp:\/\/www.yingjiesheng[.]com\/job-001-607-536.html\nhttps:\/\/www.recordedfuture.com\/chinese-mss-behind-apt3\/\nhttps:\/\/zhidao.baidu[.]com\/question\/1046720364336588899.html?fr=iks&word=%CC%EC%BD%F2%CA%D0%D6%E9%BD%AD%B5%C085%BA%C5%CA%C7%CA%B2%C3%B4%B5%A5%CE%BB%C2%EF&ie=gbk\nhttps:\/\/zhidao.baidu[.]com\/question\/146035392.html?fr=iks&word=%CC%EC%BD%F2%CA%D0%D6%E9%BD%AD%B5%C085%BA%C5%CA%C7%CA%B2%C3%B4%B5%A5%CE%BB%C2%EF&ie=gbk\nhttps:\/\/zhidao.baidu[.]com\/question\/223614321.html?fr=iks&word=%CC%EC%BD%F2%CA%D0%D6%E9%BD%AD%B5%C085%BA%C5%CA%C7%CA%B2%C3%B4%B5%A5%CE%BB%C2%EF&ie=gbk","url":"https:\/\/www.crowdstrike.com\/blog\/two-birds-one-stone-panda\/"},{"Unnamed: 0":1,"query":"APT1","text":"The CrowdStrike Intelligence Team’s primary focus is to track adversaries associated with nation-state actors and monitor their activity.  Typically one never wants to disclose one’s amassed intelligence in a way that may compromise the ability to collect more intelligence; this is clearly a losing game.  However, occasionally the release of some intelligence is required or beneficial, and the loss of the intelligence collection capability is outweighed by the perceived benefit of the release.  This is often characterized as ‘Intelligence Gain\/Loss’ by intelligence professionals, and it is often a hotly debated calculus.\nI’ll outline the current CrowdStrike position on IGL related to intelligence disclosure. (Spoiler alert: There will be a disclosure after that.)\nIntelligence Gain\/Loss\nIt has become apparent in recent months, as cyber intelligence comes to the forefront of the national and community dialogs, that we have a few problems in the way we discuss and disseminate cyber intelligence information.  One of the biggest points of confusion for people is the nomenclature that we use to describe adversaries and malware.\nAt CrowdStrike we believe firmly in focusing on the adversary. What adversary, you may ask?  Well, that’s where all this is going. Some in the community refer to the adversary by the malware detection name from a specific anti-virus vendor, e.g. Hydraq.  This is sometimes useful, but when the adversary is using a malware that is detected as Generic.Downloader.234, you have a much harder time communicating.  Additionally, every A\/V vendor uses different names, so one might have Generic.Downloader.234 and another might have Downloader.863, which makes it difficult to share intelligence with groups that don’t use the same A\/V as you.\nAdversaries use multiple malware packages during their attacks, and once they gain access to the victim enterprise, they use a whole other set of tools and  utilities to accomplish their objectives.  This is where we start categorizing adversaries by their Tools and Techniques, which is the right approach but multiple names have emerged and are inconsistently used by the community.  As an example, we all know Comment Crew, A\/K\/A Comment Team, A\/K\/A APT-1, A\/K\/A Comment, etc, etc.  This is where we are going to run into problems – we are starting to develop the same naming schemes as A\/V, which will eventually lead to confusion.  To attempt to help the community avert the naming dilemma, we are sharing with the research community the CrowdStrike cryptonyms for some of the more prolific and active adversaries. In addition to helping ensure we all know who these adversaries are and when they are active, we are sharing some signatures that will help identify them on the enterprises they frequent.\nGain\n\n​Common and unambiguous nomenclature to help the community discuss these adversaries\nAbility to detect these adversaries on the wire\nMore visibility to the problem of targeted attack aimed at stealing intellectual property and opportunity from governments, businesses, human rights activists, and non-profit groups\nThe adversary has to change tactics, techniques, and practices which raises the cost of their espionage tradecraft\n\nLoss\n\nMomentary loss of visibility on the adversary\nWe have to work hard to stay on the adversary and generate more intelligence\n\nThe choice for us is clear – the Gain outweighs the Loss.\n\nMeet Anchor Panda\n\nWe presented this information at the RSA conference several weeks ago in a presentation called ‘Hacking Exposed: PLA(N) Edition’.  This is an adversary that CrowdStrike has tracked extensively over the last year targeting both civilian and military maritime operations in the green\/brown water regions primarily in the area of operations of the South Sea Fleet of the PLA Navy.  In addition to maritime operations in this region, Anchor Panda also heavily targeted western companies in the US, Germany, Sweden, the UK, and Australia, and other countries involved in maritime satellite systems, aerospace companies, and defense contractors.  Not surprisingly, embassies and diplomatic missions in the region, foreign intelligence services, and foreign governments with space programs were also targeted.  We won’t share too many details about this adversary – we don’t want to make it too easy for them – but we will share some signatures specific to Anchor Panda. These signatures will help you find Anchor Panda, just remember to change the Signature ID (sid).\nalert tcp $VICTIM any -> $CONTROLLER any (msg: \"[CrowdStrike] ANCHOR PANDA - Adobe Gh0st Beacon\"; flow: established, to_server; content: \"Adobe\"; offset: 0; depth: 5; content: \"|e0 00 00 00 78 9c|\"; distance: 4; within: 15; sid: xxx; rev: 1; reference: url,https:\/\/www.crowdstrike.com\/blog\/whois-anchor-panda\/index.html; )\n\nalert tcp $CONTROLLER any -> $VICTIM any (msg: \"[CrowdStrike] ANCHOR PANDA - Poison Ivy Keep-Alive - From Controller\"; dsize: 48; flow: established, from_server; content: \"|54 90 1d b0 18 1b 7c ce f4 5b 24 2f ec c7 d2 21|\"; depth: 16; sid: xxx; rev: 1; reference: url,https:\/\/www.crowdstrike.com\/blog\/whois-anchor-panda\/index.html; )\n\nalert tcp $VICTIM any -> $CONTROLLER any (msg: \"[CrowdStrike] ANCHOR PANDA - Poison Ivy Keep-Alive - From Victim\"; dsize: 48; flow: established, to_server; content: \"|af c0 bb 65 5d 07 e0 0d  bf ab 75 2f 82 79 ae 26|\"; depth: 16;  sid: xxx; rev: 1; reference: url,https:\/\/www.crowdstrike.com\/blog\/whois-anchor-panda\/index.html; )\n\nalert tcp $VICTIM any -> $CONTROLLER any (msg: \"[CrowdStrike] ANCHOR PANDA Torn RAT Beacon Message Header Local\";  flow: established, to_server; dsize: 16; content: \"|00 00 00 11 c8 00 00 00 00 00 00 00 00 00 00 00|\"; depth: 16; flowbits: set,toread_header; flowbits: noalert; sid: xxx; rev: 1; reference: url,https:\/\/www.crowdstrike.com\/blog\/whois-anchor-panda\/index.html; )\n\nalert tcp $VICTIM any -> $CONTROLLER any (msg: \"[CrowdStrike] ANCHOR PANDA Torn RAT Beacon Message\"; dsize: 200; flow: to_server,established; flowbits: isset,toread_header; content: \"|40 7e 7e 7e|\"; offset: 196; depth: 4; sid: xxx; rev: 1; reference: url, https:\/\/www.crowdstrike.com\/blog\/whois-anchor-panda\/index.html; )\n\n\nBe sure to follow @CrowdStrike on Twitter as we continue to provide more intelligence and adversaries over the coming weeks.  If you have any questions about these signatures or want to hear more about Anchor Panda and their tradecraft, please contact: intelligence@crowdstrike.com and inquire about our intelligence-as-a-service solutions.\n ","url":"https:\/\/www.crowdstrike.com\/blog\/whois-anchor-panda\/"},{"Unnamed: 0":0,"query":"APT1","text":"It's hard to believe that we've reached the end of another year. In the realm of cybersecurity, 2013 was a memorable year not for breaches, but for tectonic-level shifts that completely changed how we perceive cybersecurity and its impact on how we run our businesses, how our leaders govern, and more importantly, how we understand national security.  In other words, for those in the C-Suite, technical issues were tangible business problems. This was highlighted by our APT1 report and the growing awareness that cybersecurity threats aren't just irritating, they severely impact an organization's bottom line.  In case you missed some of our most read posts, here is a list that will give you insight into what content was top of mind with our Suite Spot M-Unition readers:  Mandiant Exposes APT1 - One of China's Cyber Espionage Units & Releases 3,000 Indicators  The Mandiant® Intelligence Center™ released an unprecedented report exposing APT1′s multi-year, enterprise-scale computer espionage campaign. APT1 is one of dozens of threat groups Mandiant tracks around the world and we consider it to be one of the most prolific in terms of the sheer quantity of information it has stolen.  Chinese Leadership Change and the Advanced Persistent Threat  We at Mandiant have considered the strategic impact of the Chinese change in leadership and its impact on Advanced Persistent Threat (APT) groups and the current cyber espionage campaign that has been traced back to the PRC. We have determined that the new leaders will only enhance the influence that the People's Liberation Army (PLA), State Owned Enterprises (SOE), and national-level central planning initiatives have already had in contributing to an environment which produces and nurtures APT.  APT1 Three Months Later - Significantly Impacted, Though Active & Rebuilding  Three months later, Mandiant has observed a decrease in APT1's operations. However, we can confirm that APT1 continues cyber espionage operations against targeted computer networks. While Mandiant's APT1 report seems to have affected APT1 operations, APT1 is still active using a well-coordinated and well-defined attack methodology against a wide set of industries - with a discernible post-report shift towards new tools and infrastructure.  Richard Bejtlich on His Latest Book, \"The Practice of Network Security Monitoring\"  Everyone wants to know how to find intruders on their networks. In this post, Richard Bejtlich writes about his first experiences learning to find intruders when he served in the Air Force Computer Emergency Response Team (AFCERT). These experiences spurred the decision to start writing books and to share his knowledge with the information security community. He also previews his latest book, \"The Practice of Network Security Monitoring.\"","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2013\/12\/apt1-threat-actors-breaches.html"},{"Unnamed: 0":1,"query":"APT1","text":"In the week since we released our report on APT1 , we have observed an amazing response, not only in the media but also by individuals who have taken the data we provided and conducted their own research. We are excited to see people using our data, both for online research and for their network defense. In this post we want to highlight and summarize information that others have discovered.  1. The phone number used by the APT1 DOTA persona was also a contact phone number for an apartment rental advertisement in 2009. This apartment is 600 meters away from the Unit 61398 headquarters building and further links the DOTA persona to that location.  Chinese-speaking netizens disclosed on Twitter that the phone number we associated with DOTA (159-2193-7229) was also the contact phone number listed at http:\/\/shanghai.favolist.com\/05953558.shtml . This page is a rental advertisement dated 2009-10-09 and shown in Figure 1 with the phone number underlined. Figure 2 is an English translation of the advertisement title and body.  Figure 1: Rental advertisement at http:\/\/shanghai.favolist.com\/05953558.shtml Figure 2: Translation of the rental advertisement at http:\/\/shanghai.favolist.com\/05953558.shtml The apartment complex name, Yixinyuan (怡心苑), the location Waigaoqiao, and the description \"about a 10-minute walk away from Gangcheng Road subway station\" together pinpoint the apartment complex to be at Huashan Road 609 Long, Pudong, Shanghai, China, according to the Yixinyuan website at http:\/\/yixinyuan021.soufun.com . This apartment complex is only a 600-meter walk away from the Unit 61398 headquarters building, as depicted in Figure 3.  Figure 3: Walking directions from Yixinyuan apartment complex to Unit 61398 headquarters We observed DOTA\/APT1 using the phone number in June 2011 and again in September 2011, showing that the number was not a simple \"throw-away\" number registered for one-time use. The date of the advertisement and the date we observed DOTA using the phone number are separated by over one and a half years. It is plausible that DOTA (or someone in APT1) worked for Unit 61398, lived in the Yixinyuan apartment complex and wrote this advertisement.[1] The remaining possibilities seem significantly less likely, including:   The phone number did not belong to APT1 in 2009, and it is a coincidence that the user of the phone at the time was associated with an apartment so close to Unit 61398.  A member of APT1 lived 600 meters from Unit 61398, but APT1 is not Unit 61398.  APT1 is not operating in Pudong but is intentionally trying to frame Unit 61398 or a Pudong-based organization. In 2011, someone in APT1 saw the rental advertisement from 2009 and configured a phone to successfully accept text messages to the phone number in the advertisement on multiple occasions.   2. The APT1 SuperHard persona may have been a student at the PLA's Information Engineering University, one of the Chinese military's premier training grounds for computer network operations.  On his blog, Cyb3rsleuth disclosed a person using the username \"Superhard_M\" and the email address mei_qiang_82@hotmail.com. In a job profile, this person \"mentions that his interests are network security and developing hacking tools.\" This person's address in 2005 was listed as \"Henan Zhengzhou 1001 mailbox 774\". Cyb3rsleuth noted this address \"belongs to the famous PLA Information Engineering University [and] implies he was a student at PLAIEU.\"[2] Furthermore, a person named Mei Qiang (梅强) co-authored two papers in 2007 and 2008 that are associated with the PLAIEU. The papers are titled \"HTTP Session Hijacking on Switch LAN and Its Countermeasures\" and \"Stack Protection Mechanisms in Windows Vista\". In a 2012 report prepared for the U.S.-China Economic and Security Review Commission, Northrop Grumman analysts noted, \"The PLA Information Engineering University (PLAIEU), located in Zhengzhou, Henan Province, is perhaps the military university with the most comprehensive involvement in information warfare and computer network operations training, planning, and possibly also execution.\" This information is consistent with the APT1 SuperHard persona, and given SuperHard's development skills, it would not be surprising if SuperHard was trained at the PLAIEU.  3. The APT1 UglyGorilla persona may have been a student at Shanghai Jiaotong University in 2004.  Cyb3rsleuth also disclosed that a person with the username \"uglygorilla\" was logged as \"on station 2 times\" by the Shanghai Jiaotong University (SJTU) bulletin board system in August 2004. This person logged in from the Shanghai IP address 210.22.114.46. Other people may use the name \"uglygorilla\" and this may not be the APT1 UglyGorilla persona. However, if it is, it would indicate that he was probably a student at SJTU when he posed his question about Chinese cyber troops to Zhang Zhaozhong.  4. In 2004, Unit 61398 was located in Pudong, Shanghai and was recruiting computer science students from Zhejiang University.  An article published in the China Digital Times disclosed a 2004 recruitment notice on the Zhejiang University website advertising, \"Unit 61398 of China's People's Liberation Army (located in Pudong District, Shanghai) seeks to recruit 2003-class computer science graduate students.\" This corroborates our assertions concerning the kinds of personnel that Unit 61398 recruits. This also indicates Unit 61398 has been operating in Pudong since 2004, even though the current headquarters facility was not built and operational until years later.  Finally, our thanks to Wendy Nather, who expanded on our Occam's Razor arguments in her Idoneous Security blog. We appreciated the entire blog post, but especially these closing words:    From what Mandiant has presented, the simplest explanation is the one it's offering. It's politically explosive, of course, and that's why belief comes into play. But if you have to do more work to deny something than to accept it, you might want to reconsider your chain of logic.    [1] We are aware Marketplace reported that they called the phone number and reached someone unaffiliated with Unit 61398 or hacking activities. Marketplace said in the podcast that they called the number that the narrator said. This is when we discovered an unfortunate typo in the video narration script, which read \"7729\" instead of \"7229\" that was on the screen. The number was correctly published as \"7229\" in our main report.   [2] The link between the PLAIEU and this address seems to be corroborated in this paper: http:\/\/file.lw23.com\/6\/60\/607\/6071f3f4-40e6-4c7b-8868-3b0b21a9f601.pdf","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2013\/02\/netizen-research-bolsters-apt1-attribution.html"},{"Unnamed: 0":2,"query":"APT1","text":"On 18 February 2013, Mandiant released a report exposing one of China's cyber espionage units. The group, which Mandiant calls APT1, is one of the most prolific we track in terms of the sheer quantity of information it has stolen. The scale and impact of APT1′s operations compelled us to write the report and release more than 3,000 Indicators to help organizations defend against APT1's tactics. The report linked APT1 to a unit within China's People's Liberation Army and received widespread attention from the media and from the U.S. government.  Three months later, Mandiant has observed a decrease in APT1's operations. However, we can confirm that APT1 continues cyber espionage operations against targeted computer networks. While Mandiant's APT1 report seems to have affected APT1 operations, APT1 is still active using a well-coordinated and well-defined attack methodology against a wide set of industries -- with a discernible post-report shift towards new tools and infrastructure.  Mandiant's report and the simultaneous release of 3,000+ indicators hindered APT1's operations by causing the group to retool and change some operational methodology. Since the report, APT1 has stopped using the vast majority of the infrastructure that was disclosed with the release of the indicators. However, APT1 maintained an extensive infrastructure of computer systems around the world, and it is highly likely that APT1 still maintains access to those systems or has utilized those systems to establish new attack infrastructure in the last three months.  One thing that has not changed is the activity level of many of the 20+ Advanced Persistent Threat (APT) groups of suspected Chinese origin that Mandiant tracks. These groups are still very active and Mandiant has observed no significant changes in their operations after the release of the APT1 report. These groups also conduct cyber espionage campaigns against a broad range of victims and, based on Mandiant's observations, they were not directly affected by the release of the Mandiant APT1 report.  The discovery and attribution of APT1 to China's 2nd Bureau of the People's Liberation Army (PLA) General Staff Department's (GSD) 3rd Department (Military Unit Cover Designator 61398) also elevated the public dialogue about cyber espionage and the theft of intellectual property to a level not seen before. President Obama's National Security Advisor, Thomas Donilon, said that cyber espionage has moved to the \"forefront\" of the US agenda in its relationship with China and called for the Chinese Government to stop the hacking and to join an international process for limiting economic espionage.  Congress is taking action as well. Earlier this month, Senators Levin, McCain, Coburn and Rockefeller introduced S. 884, the Deter Cyber Theft Act , which would require the Government to publish an annual report listing foreign countries that engage in economic espionage and block imports from those countries made with stolen technologies. This bill is designed to be that next step not only to \"name and shame\" the bad actors but also to punish them economically.  The subject of Chinese attacks, such as those conducted by APT1, seems poised to stay front and center on the diplomatic agenda where, according to the New York Times , it will be a \"central issue in an upcoming visit to China by President Obama's national security adviser, Thomas Donilon.\"","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2013\/05\/apt1-months-significantly-impacted-active-rebuilding.html"},{"Unnamed: 0":3,"query":"APT1","text":"A little over a year ago, Mandiant released a report that brought the term “Advanced Persistent Threat” (APT) into the public conversation and made these types of targeted attacks top of mind for government and commercial organizations around the world. Recently, FireEye COO, Kevin Mandia took the stage at RSA USA 2014 to take a look back and share his perspective on the activities that led to the release of the APT1 report and the aftermath. While the initial report caused a media frenzy, unquestionably, the most important part of the story is the aftermath. Mandiant released the report to elevate the dialogue and address the frustration of organizations that were throwing money at cybersecurity problems and still facing attacks. Yet, the results were not what we expected. Watch the video below for Kevin’s full speech and feel free to drop a comment below to continue the discussion. http:\/\/youtu.be\/88o-uifbJSE","url":"https:\/\/www.fireeye.com\/\/blog\/executive-perspective\/2014\/04\/apt1-the-state-of-the-hack-one-year-later.html"},{"Unnamed: 0":4,"query":"APT1","text":"It was only a matter of time. Today, Mandiant learned of at least two malicious versions of our APT1 report that attempt to lure users into opening PDF documents titled \"Mandiant\" and \"Mandiant_APT2_Report. \" We are currently tracking the threat actors behind the activity and have no indication that APT1 itself is associated with either variant.  Symantec and Brandon Dixon's 9B+ blog uncovered the two permutations of the report. Hashes for the malicious PDFs are available on their blogs. Thanks to both for posting their findings.  Mandiant has not been compromised. Reports downloaded, previously and currently from our website, do not contain exploits.  We recommend that you only retrieve Mandiant's reports from: http:\/\/intelreport.mandiant.com , then check the hash of the downloaded files against the hashes posted on our web site.","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2013\/02\/threat-actors-mandiant-apt1-report-spear-phishing-lure.html"},{"Unnamed: 0":5,"query":"APT1","text":"Today, The Mandiant® Intelligence Center™ released an unprecedented report exposing APT1's multi-year, enterprise-scale computer espionage campaign. APT1 is one of dozens of threat groups Mandiant tracks around the world and we consider it to be one of the most prolific in terms of the sheer quantity of information it has stolen.  Highlights of the report include:   Evidence linking APT1 to China's 2nd Bureau of the People's Liberation Army (PLA) General Staff Department's (GSD) 3rd Department (Military Cover Designator 61398).  A timeline of APT1 economic espionage conducted since 2006 against 141 victims across multiple industries.  APT1's modus operandi (tools, tactics, procedures) including a compilation of videos showing actual APT1 activity.  The timeline and details of over 40 APT1 malware families.  The timeline and details of APT1's extensive attack infrastructure.   Mandiant is also releasing a digital appendix with more than 3,000 indicators to bolster defenses against APT1 operations. This appendix includes:   Digital delivery of over 3,000 APT1 indicators, such as domain names, and MD5 hashes of malware.  Thirteen (13) X.509 encryption certificates used by APT1.  A set of APT1 Indicators of Compromise (IOCs) and detailed descriptions of over 40 malware families in APT1's arsenal of digital weapons.  IOCs that can be used in conjunction with Redline ™, Mandiant's free host-based investigative tool, or with Mandiant Intelligent Response® (MIR) , Mandiant's commercial enterprise investigative tool.   The scale and impact of APT1's operations compelled us to write this report. The decision to publish a significant part of our intelligence about Unit 61398 was a painstaking one. What started as a \"what if\" discussion about our traditional non-disclosure policy quickly turned into the realization that the positive impact resulting from our decision to expose APT1 outweighed the risk of losing much of our ability to collect intelligence on this particular APT group. It is time to acknowledge the threat is originating from China, and we wanted to do our part to arm and prepare security professionals to combat the threat effectively. The issue of attribution has always been a missing link in the public's understanding of the landscape of APT cyber espionage. Without establishing a solid connection to China, there will always be room for observers to dismiss APT actions as uncoordinated, solely criminal in nature, or peripheral to larger national security and global economic concerns. We hope that this report will lead to increased understanding and coordinated action in countering APT network breaches.  We recognize that no one entity can understand the entire complex picture that many years of intense cyber espionage by a single group creates. We look forward to seeing the surge of data and conversations a report like this will likely generate.  Dan McWhorter  Managing Director, Threat Intelligence","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2013\/02\/mandiant-exposes-apt1-chinas-cyber-espionage-units.html"},{"Unnamed: 0":6,"query":"APT1","text":"As we noted yesterday , Brandon Dixon's 9B+ blog and Symantec reported the discovery of two malicious versions of our APT1 report. We wanted to provide follow-on details based on our analysis of these samples. Additionally, we have attached Indicators of Compromise (IOCs) so folks can begin using them to detect the malware.  PDF1 - \"Mandiant_APT2_Report\" Lure  MD5: 14A6E24977FF6E7E8A8661AADFA1A1F3  This is a password protected PDF using the password \"hello\" and exploits the CVE-2011-2462 vulnerability from back in December of 2011. Once opened it drops %TEMP% AdobeArm.tmp (4D9A1144E08E7FAE7D6DB8BC606F5BE5) and %TEMP% Mandiant_APT2_Report.pdf (29E9494E2EBA1D8F8AD9EE308FFE53EF). The newly dropped report is opened and the AdobeArm.tmp binary is executed.  The AdobeArm.tmp malware is a variant of the Bisrala downloader Trojan outlined here: http:\/\/www.symantec.com\/security_response\/writeup.jsp?docid=2011-061607-2451-99&tabid=2 . The malware can download and execute additional malware, list processes and files, load additional DLLs, and overwrite system files. The malware executes its main functionality from an embedded shellcode payload.  Before executing its payload the malware creates a thread that will monitor for windows created containing text related to AVG firewall notifications. The malware attempts to dismiss these notifications by selecting the button that will add an exception for this connection in the AVG firewall. The malware then extracts its main payload and initially decodes it using a single byte XOR key of 0x99 . An additional buffer is then decoded within the decoded shellcode using a single byte XOR key of 0xFF . Throughout execution, shellcode and configuration data are re-encoded to prevent the malware from being fully decoded in memory. This buffer contains configuration data that will be used later by the malware and is shown below.  Figure 1: Decoded configuration data The malware's main payload is implemented using multiple shellcode buffers that are decoded and re-encoded throughout their execution. The malware then attempts to load the following DLLs and call an exported function from each which are listed below:   The malware attempts to load the DLL named %SYSTEMROOT% system32appmgmt.dll and calls an exported function named dll .  The malware attempts to load the DLL named %SYSTEMROOT% system32PurpleTrans.dll and calls an exported function named RealWork .   The malware copies its embedded configuration data to a file named %TEMP% winbha.dat that is used to store additional configuration information encoded with a large XOR key. The malware then attempts to connect to the configured server at itsec.eicp.net using TCP port 443 to download files to the infected system.  Other indicators include:   It creates the following mutexes: \"0x1A7B4C9F\" and \"0123456AB\"  Creates the registry key: HKCUSoftwareMicrosoftWindowsCurrentVersionRunLoad: %TEMP% AdobeArm.tmp   PDF2 - Japanese email reported by Symantec  MD5: 2A42BF17393C3CAAA663A6D1DADE9C93  The second PDF appears to be targeting Japanese entities, as identified by Symantec. The PDF exploits the CVE-2013-0641 vulnerability in Adobe Reader. This causes the PDF to drop the file %TEMP% D.T (CB33E97F46A219804DDB373FF982D694). The binary has already been discussed previously at http:\/\/www.symantec.com\/connect\/blogs\/new-adobe-pdf-zero-day-unleashes-trojanswaylib . D.T is responsible for decrypting and dropping the next piece at %TEMP% L2P.T (A7310E731271BBB98FF09818E06f4A4D), loading and executing L2P.T and displaying the following message box:  Figure 2: Message box displayed by the D.T DLL loaded within Adobe Reader The L2P.T that is executed is different from what was previously described elsewhere. It drops a clean PDF at %TEMP% Adobe Reader.pdf (44374BE2AEAA7E46DEFE3DA50569EB9E) and a malicious binary at %TEMP% AdobeARM.exe (41915B34FC50FFDD2A6A0969E3F55FF1). The clean PDF is then displayed for the user while AdobeARM.exe is executed in the background.  AdobeARM.exe first copies itself to C:Documents and SettingsAll UsersDocumentsMy MusicAcroRd32Info.exe and then points the following Run key to its new copy: HKCUSoftwareMicrosoftWindowsCurrentVersionRunShStatEXE . At this point AdobeARM.exe has the ability to communicate out to several different servers on port 80. The GET request URIs are created by using the hostname along with the language ID of the infected system. The malware takes the hostname string (up to 0x14 characters), increments each character by one and then appends the language ID string. Potential servers and URI's include:  Figure 3: Servers and URI's hardcoded in AdobeARM.exe If successful, the malware downloads data to %TEMP% mp .dat . The data received is encrypted using RC4 where the key is seeded with the string \" http:\/\/.www. \" repeated for a total of 256 characters. After the received data is decrypted, the malware verifies that it begins with \"MZ\" and then executes the binary. The malware sleeps for 15 minutes before it tries to connect out again.  Special shout-out to Will Gibb and the Mandiant Intel Team for their contributions!  Download related IOCs here  ZIP Attachment MD5: ABD9DE4EFE115EAF5FA4338557395739","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2013\/02\/threat-actors-mandiant-apt1-report-spear-phishing-nitty.html"},{"Unnamed: 0":7,"query":"APT1","text":"The following are MD5 and SHA1 hashes for the DER encoded SSL certificates released in Appendix F of the recent Mandiant APT1 report . We are releasing these to aid network detection of APT1 SSL-encrypted malware traffic.    SIGNATURES  MD5  SHA1","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2013\/03\/md5-sha1.html"},{"Unnamed: 0":8,"query":"APT1","text":"Yesterday, the U.S. Department of Justice (DOJ) announced the indictment of five members of the Second Bureau of the People’s Liberation Army (PLA) General Staff Department’s Third Department, also known as PLA Unit 61398.  This is the same unit that Mandiant publicly unmasked last year in the APT1 report . At the time it was originally released, China denounced the report, saying that it lacked sufficient evidence . Following the DOJ’s indictment, however, China’s usual response changed from “you lack sufficient evidence” to “ you have fabricated the evidence ”, calling on the U.S. to “correct the error immediately.” This is a significant evolution in China’s messaging; if the evidence is real, it overwhelmingly demonstrates China's unilateral attempts to leapfrog years of industrial development -- by using cyber intrusions to access and steal intellectual property. The evidence provided in the indictment includes Exhibit F (pages 54-56), which shows three charts based on Dynamic DNS data. These charts indicate that the named defendants (Unit 61398 members) were re-pointing their domain names at a Dynamic DNS provider during Chinese business hours from 2008 to 2013. The China work day, particularly for government offices, is very predictable, as noted on this travel site : \"Government offices, institutions and schools begin at 8:00 or 8:30, and end at 17:00 or 17:30 with two-hour noon break, from Monday to Friday. They usually close on Saturday, Sunday and public holidays.\" What Exhibit F shows is a spike of activity on Monday through Friday around 8am in Shanghai (China Standard Time), a roughly 2-hour lull at lunchtime, and then another spike of activity from about 2pm to 6pm. The charts also show that there were very few changes in Dynamic DNS resolution on weekends. At Mandiant (now a FireEye company), we can corroborate the DOJ’s data by releasing additional evidence that we did not include in the APT1 report. In the APT1 report, we specified the following: Over a two-year period (January 2011 to January 2013) we confirmed 1,905 instances of APT1 actors logging into their hop infrastructure from 832 different IP addresses with Remote Desktop. Of the 832 IP addresses, 817 (98.2%) were Chinese and belong predominantly to four large net blocks in Shanghai which we will refer to as APT1’s home networks. In order to make a user’s experience as seamless as possible, the Remote Desktop protocol requires client applications to forward several important details to the server, including their client hostname and the client keyboard layout. In 1,849 of the 1,905 (97%) APT1 Remote Desktop sessions we observed in the past two years , the keyboard layout setting was “Chinese (Simplified) — US Keyboard.” One thing we did not originally provide was an analysis of the time of day and day of week that these 1,905 Remote Desktop (RDP) connections occurred. However, when we look at these connections in bar chart format, obvious patterns appear: Figure 1: APT1 Remote Desktop login times distributed by hour of day (China Standard Time)  Figure 2: APT1 Remote Desktop login times distributed by day of week (China Standard Time) Essentially, APT1 conducted almost all of the 1,905 RDP connections from 2011 to 2013: (1) On week days (Monday through Friday), (2) between 8am and noon, 2pm and 6pm, and 7pm and 10pm CST. On some occasions, APT1 personnel appear to have worked on weekends, but these are minor exceptions to the norm. Consider the following evidence together for the 1,905 RDP connections: 98.2% of IP addresses used to log in to hop points (which help mask the real point of origin to victim organizations) were from Shanghai networks 97% of the connections were from computers using the Simplified Chinese language setting 97.5% of the connections occurred on weekdays, China Standard Time 98.8% of the connections occurred between 7am and midnight China Standard Time 75% occurred between 8am to noon or between 2pm to 6pm 15% occurred between 7pm and 10pm The simplest conclusion based on these facts is that APT1 is operating in China, and most likely in Shanghai. Although one could attempt to explain every piece of evidence away, at some point the evidence starts to become overwhelming when it is all pointing in one direction. Our timestamp data, derived from active RDP logins over a two year period, matches the DOJ’s timestamp data, derived from a different source -- active Dynamic DNS re-pointing over a five year period. These data sets show that APT1 is either operating in China during normal Chinese business hours or that APT1 is intentionally going to painstaking lengths to look like they are. The data used to produce the charts above are archived in raw format and we are confident that any computer networking expert would certify them as genuine and non-fabricated in a court of law. But, that isn’t really the issue. The real issue is: will this activity continue and for how long? Regardless, FireEye remains focused on how these threats evolve over time, in order to reduce the time from “detect” to “fix”, as these and other actors continue targeting potential victims.","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2014\/05\/the-pla-and-the-800am-500pm-work-day-fireeye-confirms-dojs-findings-on-apt1-intrusion-activity.html"},{"Unnamed: 0":9,"query":"APT1","text":"FireEye, Inc. (NASDAQ: FEYE), the leader in stopping today’s advanced\ncyber attacks, today announced it will participate in four sessions at RSA Conference 2014 , February 24 th through February 28 th in San Francisco. The sessions will\nbe highlighted by Kevin Mandia discussing the impact of last year’s\ngroundbreaking APT1 report , with researchers from FireEye also\ndiscussing the advancement of malware and the shortcomings of\nanti-virus software. Attendees can visit FireEye at RSA in the North\nExpo Hall at booth #2813 and Mandiant in the South Expo Hall at booth #501.  FireEye speakers and presentations include:   WHAT: “ New Frontiers in Security ”   WHEN: Tuesday, February 25, 2:40 – 3:40 PM   WHERE: Moscone West, Room #3018   WHO: Kevin Mandia, SVP and COO, FireEye  Industry experts Kevin Mandia (Founder and Former CEO of Mandiant)\nwith Ted Schlein (Kleiner Perkins Caufield & Byers), Nate Fick\n(Founder and CEO of Endgame), and Lieutenant General Ken Minihan\n(Paladin Capital, Former Director of NSA) discuss why and how\norganizations must rethink their security approach as well as how\ncompanies should prioritize to protect themselves today as well as tomorrow.   WHAT : \" Twilight of Legacy AV Models – A Different Long Tail Story \"   WHEN : Tuesday, February 25, 1:20 – 2:20 PM   WHERE : Moscone North, Room #132   WHO : Zheng Bu, Vice President, FireEye Research Labs, FireEye  Malware has a very short lifetime. But how short is it? Zheng Bu will\npresent his study on the surprisingly fat-head, long-tail lifetime of\nmalware and the challenges that arise from this. With the anti-virus\nindustry presenting a reactive model that performs very badly on the\nfat-head, Bu will demonstrate a possible mitigation plan based on the\nlengthy life of malware.   WHAT: \" DLL Side-Loading: A Thorn in the Side of the\nAnti-Virus (AV) Industry \"   WHEN: Wednesday, February 26, 12:00 ­– 12:20 PM   WHERE: Moscone West, Room #3006   WHO: Amanda Stewart, Malware Research Engineer, FireEye  What is DLL Side-Loading? How do you recognize it? How do you prevent\nit? Malware research engineer Amanda Stewart will dig into the\ntechniques that sneak malware past anti-virus scanners and how APT\ndevelopers used this technique in a highly targeted attack against a\nFortune 50 company last year.   WHAT: \" State\nof the Hack: One Year After the APT1 Report \"   WHEN: Thursday, February 27, 3:55 – 4:20 PM   WHERE: Moscone South, Esplanade Ballroom   WHO: Kevin Mandia, SVP and COO, FireEye  A year after exposing China’s espionage efforts, Kevin Mandia returns\nto discuss the impact the groundbreaking APT1 report has had on the\nworld. Hear what approaches attackers are now using to compromise\norganizations and what organizations should be doing to narrow their\nsecurity gap in this radically changed landscape.  Attendees of RSA Conference 2014 in San Francisco will be able to\nview live demonstrations of the expanded FireEye Security Platform at\nthe FireEye booth (North Expo #2813) from February 24– 27, 2014.  For more information visit http:\/\/www.fireeye.com\/ , and be\nsure to follow @FireEye for the latest threat research and updates from the company during RSA\nConference 2014.   About FireEye, Inc.   FireEye has invented a purpose-built, virtual machine-based\nsecurity platform that provides real-time threat protection to\nenterprises and governments worldwide against the next generation of\ncyber attacks. These highly sophisticated cyber attacks easily\ncircumvent traditional signature-based defenses, such as\nnext-generation firewalls, IPS, anti-virus, and gateways. The FireEye\nThreat Prevention Platform provides real-time, dynamic threat\nprotection without the use of signatures to protect an organization\nacross the primary threat vectors and across the different stages of\nan attack life cycle. The core of the FireEye platform is a virtual\nexecution engine, complemented by dynamic threat intelligence, to\nidentify and block cyber attacks in real time. FireEye has over 1,500\ncustomers across more than 40 countries, including over 100 of the\nFortune 500.   Media Contact  Vitor De Souza  FireEye, Inc.  vitor.desouza@fireeye.com  (415) 699-9838  # # #  © 2014 FireEye, Inc. All rights reserved. FireEye and Mandiant are\nregistered trademarks or trademarks of FireEye, Inc. in the United\nStates and other countries. All other brands, products, or service\nnames are or may be trademarks or service marks of their respective owners.","url":"https:\/\/www.fireeye.com\/\/company\/press-releases\/2014\/fireeye-to-discuss-post-apt1-world-shortcomings-of-anti-virus-at-rsa-conference-2014.html"},{"Unnamed: 0":0,"query":"APT1","text":"Download the Kaspersky Security Bulletin: Threat Predictions for 2018  Introduction  As hard as it is to believe, it’s once again time for our APT Predictions. Looking back at a year like 2017 brings the internal conflict of being a security researcher into full view: on the one hand, each new event is an exciting new research avenue for us, as what were once theoretical problems find palpable expression in reality. This allows us to understand the actual attack surface and attacker tactics and to further hone our hunting and detection to address new attacks. On the other hand, as people with a heightened concern for the security posture of users at large, each event is a bigger catastrophe. Rather than consider each new breach as yet another example of the same, we see the compounding cumulative insecurity facing users, e-commerce, financial, and governmental institutions alike.  As we stated last year, rather than thinly-veiled vendor pitching, our predictions are an attempt to bring to bear our research throughout the year in the form of trends likely to peak in the coming year.  Our record – did we get it right?  As a snapshot scorecard of our performance last year, these are some of our 2017 predictions and some examples where relevant:  Espionage and APTs:   Passive implants showing almost no signs of infection come into fashion Yes – https:\/\/securelist.com\/unraveling-the-lamberts-toolkit\/77990\/  Ephemeral infections \/ memory malware Yes – https:\/\/securelist.com\/fileless-attacks-against-enterprise-networks\/77403\/  Espionage goes mobile Yes – https:\/\/android-developers.googleblog.com\/2017\/04\/an-investigation-of-chrysaor-malware-on.html   Financial Attacks:   The future of financial attacks Yes – https:\/\/securelist.com\/lazarus-under-the-hood\/77908\/   Ransomware:   Dirty, lying ransomware Yes – https:\/\/securelist.com\/schroedingers-petya\/78870\/   Industrial threats:   The ICS Armageddon didn’t come yet (and we are happy to be wrong on that), however, we’ve seen ICS come under attack from Industoyer – https:\/\/www.welivesecurity.com\/2017\/06\/12\/industroyer-biggest-threat-industrial-control-systems-since-stuxnet\/   IoT:   A brick by any other name Yes! BrickerBot – https:\/\/arstechnica.com\/information-technology\/2017\/04\/brickerbot-the-permanent-denial-of-service-botnet-is-back-with-a-vengeance\/   Information Warfare:   Yes, multiple examples – https:\/\/citizenlab.ca\/2017\/05\/tainted-leaks-disinformation-phish\/   What can we expect in 2018?   More supply chain attacks. Kaspersky Lab’s Global Research and Analysis Team tracks over 100 APT (advanced persistent threat) groups and operations. Some of these are incredibly sophisticated and possess wide arsenals that include zero-day exploits, fileless attack tools, and combine traditional hacking attacks with handovers to more sophisticated teams that handle the exfiltration part. We have often seen cases in which advanced threat actors have attempted to breach a certain target over a long period of time and kept failing at it. This was either due to the fact that the target was using strong internet security suites, had educated their employees not to fall victim to social engineering, or consciously followed the Australian DSD TOP35 mitigation strategies for APT attacks. In general, an actor that is considered both advanced and persistent won’t give up that easily, they’ll continue poking the defenses until they find a way in. When everything else fails, they are likely to take a step back and re-evaluate the situation. During such a re-evaluation, threat actors can decide a supply chain attack can be more effective than trying to break into their target directly. Even a target whose networks employ the world’s best defenses is likely using software from a third-party. The third party might be an easier target and can be leveraged to attack the better protected original target enterprise.  During 2017, we have seen several such cases, including but not limited to:   Shadowpad  CCleaner  ExPetr \/ NotPetya   These attacks can be extremely difficult to identify or mitigate. For instance, in the case of Shadowpad, the attackers succeeded in Trojanizing a number of packages from Netsarang that were widely used around world, in banks, large enterprises, and other industry verticals. The difference between the clean and Trojanized packages can be dauntingly difficult to notice –in many cases it’s the command and control (C&C) traffic that gives them away.  For CCleaner, it was estimated that over 2 million computers received the infected update, making it one of the biggest attacks of 2017. Analysis of the malicious CCleaner code allowed us to correlate it with a couple of other backdoors that are known to have been used in the past by APT groups from the ‘Axiom umbrella’, such as APT17 also known as Aurora. This proves the now extended lengths to which APT groups are willing to go in order to accomplish their objectives.  Our assessment is that the amount of supply chain attacks at the moment is probably much higher than we realize but these have yet to be noticed or exposed. During 2018, we expect to see more supply chain attacks, both from the point of discovery and as well as actual attacks. Trojanizing specialized software used in specific regions and verticals will become a move akin to waterholing strategically chosen sites in order to reach specific swaths of victims and will thus prove irresistible to certain types of attackers.  More high-end mobile malware. In August 2016, CitizenLab and Lookout published their analysis of the discovery of a sophisticated mobile espionage platform named Pegasus. Pegasus, a so-called ‘lawful interception’ software suite, is sold to governments and other entities by an Israeli company called NSO Group. When combined with zero-days capable of remotely bypassing a modern mobile operating systems’ security defenses, such as iOS, this is a highly potent system against which there is little defense.  In April 2017, Google published its analysis of the Android version of the Pegasus spyware which it called Chrysaor . In addition to ‘lawful surveillance’ spyware such as Pegasus and Chrysaor, many other APT groups have developed their own mobile malware implants. Due to the fact that iOS is an operating system locked down from introspection, there is very little that a user can do to check if their phone is infected. Somehow, despite the greater state of vulnerability of Android, the situation is better on Android where products such as Kaspersky AntiVirus for Android are available to ascertain the integrity of a device.  Our assessment is that the total number of mobile malware existing in the wild is likely higher than currently reported, due to shortcomings in telemetry that makes these more difficult to spot and eradicate. We estimate that in 2018 more high-end APT malware for mobile will be discovered, as a result of both an increase in the attacks and improvement in security technologies designed to catch them.  More BeEF-like compromises with web profiling. Due to a combination of increased interest and better security and mitigation technologies being deployed by default in operating systems, the prices of zero-day exploits have skyrocketed through 2016 and 2017. For instance, the latest Zerodium payout chart lists up to $1,500,000 for a complete iPhone (iOS) Remote jailbreak with persistence attack, which is another way of saying ‘a remote infection without any interaction from the user’.  The incredible prices that some government customers have most certainly chosen to pay for these exploits mean there is increasing attention paid towards protecting these exploits from accidental disclosure. This translates into the implementation of a more solid reconnaissance phase before delivering the actual attack components. The reconnaissance phase can, for instance emphasize the identification of the exact versions of the browser used by the target, their operating system, plugins and other third-party software. Armed with this knowledge, the threat actor can fine tune their exploit delivery to a less sensitive ‘1-day’ or ‘N-day’ exploit, instead of using the crown jewels .  These profiling techniques have been fairly consistent with APT groups like Turla and Sofacy , as well as Newsbeef (a.k.a. Newscaster, Ajax hacking team, or  ‘Charming Kitten’), but also other APT groups known for their custom profiling frameworks, such as the prolific Scanbox. Taking the prevalence of these frameworks into account in combination with a surging need to protect expensive tools, we estimate the usage of profiling toolkits such as ‘BeEF ‘ will increase in 2018 with more groups adopting either public frameworks or developing their own.  Sophisticated UEFI and BIOS attacks. The Unified Extensible Firmware Interface (UEFI) is a software interface which serves as the intermediary between the firmware and the operating system on modern PCs. Established in 2005 by an alliance of leading software and hardware developers, Intel most notable amongst them, it’s now quickly superseding the legacy BIOS standard. This was achieved thanks to a number of advanced features that BIOS lacks: for example, the ability to install and run executables, networking and Internet capabilities, cryptography, CPU-independent architecture and drivers, etc. The very advanced capabilities that make UEFI such an attractive platform also open the way to new vulnerabilities that didn’t exist in the age of the more rigid BIOS. For example, the ability to run custom executable modules makes it possible to create malware that would be launched by UEFI directly before any anti-malware solution – or, indeed, the OS itself – had a chance to start. The fact that commercial-grade UEFI malware exists has been known since 2015, when the Hacking team UEFI modules were discovered. With that in mind, it is perhaps surprising that no significant UEFI malware has been found, a fact that we attribute to the difficulty in detecting these in a reliable way. We estimate that in 2018 we will see the discovery of more UEFI-based malware.  Destructive attacks continue. Beginning in November 2016, Kaspersky Lab observed a new wave of wiper attacks directed at multiple targets in the Middle East. The malware used in the new attacks was a variant of the infamous Shamoon worm that targeted Saudi Aramco and Rasgas back in 2012. Dormant for four years, one of the most mysterious wipers in history has returned. Also known as Disttrack, Shamoon is a highly destructive malware family that effectively wipes the victim machine. A group known as the ‘Cutting Sword of Justice’ took credit for the Saudi Aramco attack by posting a Pastebin message on the day of the attack (back in 2012), and justified the attack as a measure against the Saudi monarchy. The Shamoon 2.0 attacks seen in November 2016 targeted organizations in various critical and economic sectors in Saudi Arabia. Just like the previous variant, the Shamoon 2.0 wiper aims for the mass destruction of systems inside compromised organizations. While investigating the Shamoon 2.0 attacks, Kaspersky Lab also discovered a previously unknown wiper malware that appears to be targeting organizations in Saudi Arabia. We’ve called this new wiper StoneDrill and have been able to link it with a high degree of confidence to the Newsbeef APT group.  In addition to Shamoon and Stonedrill, 2017 has been a tough year in terms of destructive attacks. The ExPetr\/NotPetya attack, which was initially considered to be ransomware , turned out to be a cleverly camouflaged wiper as well. ExPetr was followed by other waves of ‘ransomware’ attacks, in which there is little chance for the victims to recover their data; all cleverly masked ‘wipers as ransomware’. One of the lesser known facts about ‘wipers as ransomware’ is perhaps that a wave of such attacks was observed in 2016 from the CloudAtlas APT, which leveraged what appeared to be ‘wipers as ransomware’ against financial institutions in Russia.  In 2018, we estimate that destructive attacks will continue to rise, leveraging its status as the most visible type of cyberwarfare.  More subversion of cryptography. In March 2017, IoT encryption scheme proposals developed by the NSA came into question with Simon and Speck variant ISO approvals being both withdrawn and delayed a second time . In August 2016, Juniper Networks announced the discovery of two mysterious backdoors in their NetScreen firewalls. Perhaps the most interesting of the two was an extremely subtle change of the constants used for the Dual_EC random number generator, which would allow a knowledgeable attacker to decrypt VPN traffic from NetScreen devices. The original Dual_EC algorithm was designed by the NSA and pushed through NIST. Back in 2013, a Reuters report suggested that NSA paid RSA $10 million to put the vulnerable algorithm in their products as a means of subverting encryption. Even if the theoretical possibility of a backdoor was identified as early as 2007, several companies (including Juniper) continued to use it with a different set of constants, which would make it theoretically secure. It appears that this different set of constants made some APT actor unhappy enough to merit hacking into Juniper and changing the constants to a set that they could control and leverage to decrypt VPN connections.  These attempts haven’t gone unnoticed. In September 2017, an international group of cryptography experts have forced the NSA to back down on two new encryption algorithms, which the organization was hoping to standardize.  In October 2017, news broke about a flaw in a cryptographic library used by Infineon in their hardware chips for generation of RSA primes. While the flaw appears to have been unintentional, it does leave the question open in regards to how secure are the underlying encryption technologies used in our everyday life, from smart cards, wireless networks or encrypted web traffic. In 2018, we predict that more severe cryptographic vulnerabilities will be found and (hopefully) patched, be they in the standards themselves or the specific implementations.  Identity in e-commerce comes into crisis. The past few years have been punctuated by increasingly catastrophic large-scale breaches of personally identifiable information (PII). Latest among these is the Equifax breach reportedly affecting 145.5 million Americans.  While many have grown desensitized to the weight of these breaches, it’s important to understand that the release of PII at scale endangers a fundamental pillar of e-commerce and the bureaucratic convenience of adopting the Internet for important paperwork. Sure, fraud and identity theft have been problems for a long time, but what happens when the fundamental identifying information is so widely proliferated that it’s simply not reliable at all? Commerce and governmental institutions (particularly in the United States) will be faced with a choice between scaling back the modern comforts of adopting the Internet for operations or doubling down on the adoption of other multi-factor solutions. Perhaps thus far resilient alternatives like ApplePay will come into vogue as de facto means of insuring identity and transactions, but in the meantime we may see a slowdown in the critical role of the Internet for modernizing tedious bureaucratic processes and cutting operational costs.  More router and modem hacks. Another known area of vulnerability that has gone vastly ignored is that of routers and modems. Be they home or enterprise, these pieces of hardware are everywhere, they’re critically important to daily operations, and tend to run proprietary pieces of software that go unpatched and unwatched. At the end of the day, these little computers are Internet-facing by design and thereby sitting at a critical juncture for an attacker intent on gaining persistent and stealthy access to a network. Moreover, as some very cool recent research has shown , in some cases attackers might even be able to impersonate different Internet users, making it possible to throw off the trail of an attacker entirely to a different connecting address. At a time of increased interest in misdirection and false flags, this is no small feat. Greater scrutiny of these devices will inevitably yield some interesting findings.  A medium for social chaos. Beyond the leaks and political drama of the past year’s newfound love for information warfare, social media itself has taken a politicized role beyond our wildest dreams. Whether it’s at the hand of political pundits or confusing comedic jabs at Facebook’s CEO by South Park’s writers, eyes have turned against the different social media giants demanding some level of fact-checking and identification of fake users and bots attempting to exert disproportionate levels of social influence. Sadly, it’s becoming obvious that these networks (which base their success on quantified metrics like ‘daily active users’) have little incentive to truly purge their user base of bots. Even when these bots are serving an obvious agenda or can be tracked and traced by independent researchers. We expect that as the obvious abuse continues and large bot networks become accessible to wider swaths of politically unsavory characters, that the greater backlash will be directed at the use of social media itself, with disgusted users eagerly looking for alternatives to the household giants that revel in the benefits of the abuse for profits and clicks.   APT predictions – conclusion  In 2017 we pronounced the death of Indicators of Compromise . In 2018, we expect to see advanced threat actors playing to their new strengths, honing their new tools and the terrifying angles described above.  Each year’s themes and trends shouldn’t be taken in isolation – they build on each other to enrich an ever-growing landscape of threats facing users of all types, be it individuals, enterprise, or government. The only consistent reprieve from this onslaught is the sharing and knowledgeable application of high-fidelity threat intelligence.  While these predictions cover trends for advanced targeted threats, individual industry sectors will face their own distinct challenges. In 2018, we wanted to shine the spotlight on some of those as well – and have prepared predictions for the connected healthcare, automotive, financial services, and industrial security sectors, as well as cryptocurrencies. You can find them all here!  Threat Predictions for Automotive in 2018  Threat Predictions for Connected Health in 2018  Threat Predictions for Financial Services and Fraud in 2018  Threat Predictions for Industrial Security in 2018  Threat Predictions for Cryptocurrencies in 2018  Threat Predictions for Connected Life in 2018","url":"https:\/\/securelist.com\/ksb-threat-predictions-for-2018\/83169\/"},{"Unnamed: 0":1,"query":"APT1","text":"Download the full report (PDF)  Targeted attacks and malware campaigns  Cha-ching! Skimming off the cream  Earlier in the year, as part of an incident response investigation, we uncovered a new version of the Skimer ATM malware","url":"https:\/\/securelist.com\/it-threat-evolution-in-q2-2016-overview\/75615\/"},{"Unnamed: 0":2,"query":"APT1","text":"CVE-2015-2545 is a vulnerability discovered in 2015 and corrected with Microsoft’s update MS15-099. The vulnerability affects Microsoft Office versions 2007 SP3, 2010 SP2, 2013 SP1 and 2013 RT SP1.  The error enables an attacker to execute arbitrary code using a specially crafted EPS image file. The exploit uses PostScript and can evade Address Space Layout Randomization (ASLR) and Data Execution Prevention (DEP) protection methods.  The exploit was discovered in the wild in August 2015, when it was used in a targeted attack by the Platinum group , presumably against targets in India. Over the following months, there was significant growth in the number of threat actors using the vulnerability as a primary tool for initial penetration, with both the attack groups and their targets located in South-East and Central Asia and the Far East.  In this research paper, we discuss examples of attacks using the CVE-2015-2545 vulnerability undertaken by some of these groups.  Overview of groups using CVE-2015-2545   Platinum (also known as TwoForOne)  The group is believe to originate from South-East Asia. Its attacks can be traced as far back as 2009. The group is notable for exploiting 0-day vulnerabilities and carrying out a small number of highly focused targeted attacks – mostly against government agencies in Malaysia, Indonesia, China and India.  This group was the first to exploit the CVE-2015-2545 vulnerability. After the vulnerability was corrected with Microsoft updates in September and November 2015, no new Platinum attacks exploiting this vulnerability have been detected.  Microsoft presented the activity of this group at the SAS conference in February 2016, and in its paper: PLATINUM: Targeted attacks in South and Southeast Asia .  APT16  The group has been known for several years and is believed to be of Chinese origin. In November and December 2015, it used a modified exploit for CVE-2015-2545 in attacks against information and news agencies in Taiwan. These attacks were described in a FireEye research paper – The EPS Awakens – Part 2 .  EvilPost  In December 2015, Kaspersky Lab became aware of a targeted attack against the Japanese defense sector. In order to infect victims, the attacker sent an email with an attached DOCX file exploiting the CVE-2015-2545 vulnerability in Microsoft Office using an embedded EPS (Encapsulated Postscript) object. The EPS object contained a shellcode that dropped and loaded a 32-bit or 64-bit DLL file depending on the system architecture. This, in turn exploited another vulnerability to elevate privileges to Local System (CVE-2015-1701) and download additional malware components from the C&C server.  The C&C server used in the attack was located in Japan and appears to have been compromised. However, there is no indication that it has ever been used for any other malicious purpose. Monitoring of the server activity for a period of several months did not result in any new findings. We believe the attackers either lost access to the server or realized that it resulted in too much attention from security researchers, as the attack was widely discussed by the Japanese security community.  According to our research partner in Japan, the original EvilPost attack in December 2015 arrived as a spear-phishing email with a Word document attached.  This document embedded an EPS object file, which triggered a vulnerability in the EPS format handler in Microsoft Word. Even with an exploit component, Microsoft Word rendered the document correctly and displayed the decoy message. The document is written in good Japanese, as shown below.   It has been used to decoy New Year impressions of defense-related organizations.  This attack was also described in the FireEye report , mentioned above.  An overview of the activity of the EvilPost group activity was provided to subscribers of the Kaspersky Lab Threat Intelligence Service in March 2016. For information about the service, please write to intelreports@kaspersky.com .  SPIVY  In March and April 2016, a series of emails laced with an exploit forCVE-2015-2545 were detected. The emails were sent in spear-phishing attacks, presumably targeting organizations in Hong Kong. Identifying a specific group behind these attacks is difficult because they used a new variant of a widely available backdoor known as PoisonIvy (from which the name of the group, SPIVY, is derived). A description of these incidents can be found in the PaloAlto blog .  Danti and SVCMONDR  These two groups have not yet been publicly described. An overview of their attacks and the tools used is provided in this report.   Danti attacks  Danti (Kaspersky Lab’s internal name) is an APT actor that has been active at least since 2015, predominantly targeting Indian government organizations. According to our telemetry, Danti has also been actively hitting targets in Kazakhstan, Kyrgyzstan, Uzbekistan, Myanmar, Nepal and the Philippines","url":"https:\/\/securelist.com\/cve-2015-2545-overview-of-current-threats\/74828\/"},{"Unnamed: 0":3,"query":"APT1","text":"Q1 in figures   According to KSN data, Kaspersky Lab products detected and neutralized 1 345 570 352 threats in Q1 2013.  A total of 22,750 new modifications of malicious programs targeting mobile devices were detected this past quarter — that’s more than half of the total number of modifications detected in all of 2012.  Some 40% of the exploits seen in the first quarter of this year target vulnerabilities in Adobe products.  Nearly 60% of all malicious hosts are located in three countries: the US, Russia, and the Netherlands.   Overview  The first quarter of 2013 turned out to be a busy time in IT security. This report will address the most significant events.  Cyberespionage and cyberweapons  Red October  At the very beginning of the year, Kaspersky Lab published a significant report with the results of a study on the global cyberespionage operation known as Red October . These attacks targeted various government agencies, diplomatic organizations and companies around the world. Analyzing the files and reconstructing the structure of the attack took several months. However, after a labor-intensive study, we were able to determine several key facts.  The attackers have been active over the past five years. The multifunctional platform that they used helped them quickly use new, expanded modules to collect information. In order to control and manage infected systems, they created more than 60 different domain names and several servers hosted in different countries. The command sever infrastructure is comprised of a chain of proxy servers.  In addition to traditional targeted attacks on workstations, Red October is also capable of stealing data from mobile devices, collecting data from network equipment, collecting files from USB drives, stealing email databases from local Outlook archives or from remote POP\/IMAP servers, and extracting files from local FTP servers on the Internet.  MiniDuke  In February, FireEye published an analysis of a new malicious program that penetrates systems using a 0-day vulnerability in Adobe Reader (CVE-2013-0640). This became the first exploit capable of bypassing the Acrobat Reader sandbox. It downloaded a backdoor meant to steal data from an infected system. After obtaining examples of this malicious program for analysis, we gave it the name ItaDuke.  In time, we discovered several similar incidents targeting the very same vulnerability, only with different threats. The malicious program used by the cybercriminals was dubbed MiniDuke. An investigation into these incidents was conducted by the Hungarian company CrySys Lab. MiniDuke’s victims turned out to be government agencies located in Ukraine, Belgium, Portugal, Romania, the Czech Republic and Ireland, as well as a research organization in Hungary, in addition to a research institute, two scientific research centers and a medical facility in the US. In total, we detected 59 victims in 23 countries.  One of the most interesting characteristics of the MiniDuke attacks was the combination of a threat with code written using a complex, ‘old school’ approach, and relatively new, yet tried-and-true, exploit technologies targeting Adobe Reader vulnerabilities.  The attackers sent out malicious PDF documents with exploits targeting versions 9 through 11 of Adobe Reader. The documents contained information about a seminar on human rights (ASEM), news about Ukraine’s foreign policy, and the plans of NATO countries. If an exploit was successful, the victim’s computer would be infiltrated by a unique backdoor, small at just 20 KB, written in Assembler.  The cybercriminals used Twitter in this attack: in order to obtain C&C server addresses and subsequently download new malicious modules, the backdoor sought out special tweets from previously created accounts. As soon as the infected system established a connection with the command server, it would begin to receive encrypted modules (backdoors) bundled with GIF files. These modules had relatively simple functions: copying, moving and deleting files, creating directories, and downloading new malicious programs.  APT1  In February, Mandiant published a large PDF report on the attacks launched by a certain group of Chinese hackers going by the name of APT1. The term APT (Advanced Persistent Threat) is still a buzz word. Yet sometimes it refers to threats or attacks that aren’t exactly “advanced”. However, in the case of APT1, “advanced” is no exaggeration — this campaign run by Chinese hackers is large-scale and not to be taken lightly.  The Mandiant reports starts off by stating that APT1 appears to be a division of the Chinese army. The company even included a possible physical address for the division, and estimated the number of people involved and the infrastructure used. Mandiant believes that APT1 has been operating since 2006, and that over the course of 6 years it has managed to steal terabytes of data from at least 141 organizations. The victim organizations are primarily located in English-speaking countries. No doubt these massive attacks would not have been possible without real support from hundreds of people and a developed, modern infrastructure.  This is definitely not the first time that China has faced accusations of its involvement of cyberattacks against government agencies and organizations in countries around the world. And there is nothing particularly surprising about the Chinese government’s firm rejection of the assertions made in the Mandiant report.  Note that up till now, no country has ever claimed responsibility for any cyberespionage attack, or has admitted to involvement in cyberespionage under pressure from public or agency evidence.  TeamSpy  In March 2013, information was published about the latest in a line of complex attacks targeting high-ranking politicians and human rights advocates in the CIS and Eastern Europe. The operation was dubbed “ TeamSpy ,” as the remote admin program TeamViewer was used by the attackers to control victim computers. The main objective of this attack was to gather information from user computers, starting with screenshots and ending with copies of .pgp files, including passwords and encryption keys.  Even though the tools used in the TeamSpy operation — and even the operation itself — didn’t seem all that sophisticated or professional compared to the Red October operation, the TeamSpy attacks were also successful.  Stuxnet 0.5  Incidents that require months of persistent effort to investigate are relatively rare in the antivirus industry. Even rarer are events that remain relevant even three years after they take place — like the detection of Stuxnet, for example. Although this worm has been studied by numerous antivirus companies, there are still many modules that have barely been examined, if at all. It is important to remember that there were several version of Stuxnet, and that the earliest of them appeared back in 2009. Experts suggested several times that there were (or still are) even earlier versions of this worm, although there was no hard evidence.  But in the end, those assertions were confirmed. In late February, Symantec published a study on a new “old” version of the worm — Stuxnet 0.5. This version turned out to be the earliest known modification of Stuxnet, and was active between 2007 and 2009. Furthermore, this version had some very interesting characteristics:   First of all, it was created on the same platform as Flame, not Tilded like subsequent Stuxnet modifications.  Second, the worm spread using infected files generated with Simatic Step 7 , and did not contain any exploits for Microsoft products.  Third, Stuxnet 0.5 was no longer proliferated after July 4, 2009 .  Finally, it was Stuxnet 0.5 that featured complete compatibility with Siemens 417 PLC (later versions of the work did not have this feature in full).   The results of the study of Stuxnet version 0.5 have provided more information about this malicious program in general. It’s likely that we will find out even more information in the future. The same can be said about examples of cyberweapons detected after Stuxnet, as well as malware used in cyberespionage — there’s a lot we still don’t know.  Targeted attacks  Attacks against Tibetan and Uyghur activists  In the first quarter of 2013, targeted attacks continued against Tibetan and Uyghur activists. In order to achieve their goals, the attackers used everything at their disposal, and users of Mac OS X, Windows, and Android were subjected to attacks.  In January-February, Kaspersky Lab detected a substantial increase in the number of targeted attacks on Uyghurs using Mac OS X. All of these attacks used the CVE-2009-0562 vulnerability, which was patched by Microsoft nearly four years ago. The exploit for this vulnerability was sent out in MS Office documents, which were easy to recognize from the “captain” author tag. If the exploit was successfully executed, a backdoor for Mac OS X was downloaded in the form of a Mach-O file. This small backdoor has a very specific function: it installs another backdoor and a program that steals personal data (contacts).  Kaspersky Lab recorded the attacks against the Tibetan activists in mid-March 2013. This time, the attackers used the exploit mentioned above (CVE-2013-0640 — previously used in ItaDuke attacks) to get around the sandbox in Acrobat Reader X and infect the targeted computers.  In late March 2013, users of Android devices also fell victim to this wave of attacks. After the inbox of a well-known Tibetan activist was hacked, mailings from his address started coming out with an APK file attachment, which turned out to be a malicious program for Android (Kaspersky Lab products have labeled it Backdoor.AndroidOS.Chuli.a). This threat stealthily notifies its command server of a successful infection, and then begins to collect data stored on the device: contacts, call logs, text messages, GPS data and device information. Then the malware encrypts the stolen data using Base64 and uploads it to the command server. Kaspersky Lab’s investigation of the command server shows that the attackers speak Chinese.  Just a few days after the results of our study were published, research organization The Citizen Lab published the results of its study of a similar incident. The target of the attack were people who were in one way or another associated with Tibet or Tibetan activists, and the malicious program that was used has a similar function (stealing personal information), but is an infected version of the Kakao Talk messenger.  Hacking corporate networks  Unfortunately, the first quarter of the year turned out to be chock full of incidents involving hacked corporate infrastructures and password leakages. Victims included Apple, Facebook, Twitter, and Evernote, among others.  In early February, Twitter made an official announcement that malicious users had managed to steal user data (including hash passwords) from 250,000 members of the social network. Two weeks later, Facebook issued a statement that the computers of several of the company’s staff members had been infected by exploits during visits to a mobile developer site. Facebook described this as a sophisticated, targeted attack, noting that the goal was to penetrate Facebook’s corporate network. Luckily, company representatives stated that Facebook was able to avoid any leakage of user information.  Just a few days later, Apple announced that several company employees had fallen victim to the very same attack while visiting a website for mobile developers. Apple’s data showed that no data leakages had taken place. In early March, Evernote reported that their internal network had been hacked and that malicious users had attempted to gain access to their data.  In 2011, we witnessed mass hacking of various companies and mass user data leakages. It might seem like these attacks all came to nothing — but not so! Malicious users remain as interested as ever in hacking large companies and getting their hands on confidential data, including user information.  Mobile threats  Kaspersky Lab’s report on the evolution of threats targeting smartphones, tablets, and other mobile devices in 2012 was published in February 2013. Our data shows that in 2012 Android became the number-one target among virus writers, and that the number of threats over the course of the year grew steadily. Has this upswing in the number of mobile threats continued in 2013 so far? Indeed it has.  A few numbers  January is traditionally a quiet month for mobile virus writers — “only” 1,262 new modifications appeared in the first month of the year. But over the past few months, Kaspersky Lab has detected over 20,000 new mobile malware modifications. In February, we detected 12,044 mobile malware modifications, and another 9,443 in March. To compare — a total of 40,059 modifications of malicious programs targeting mobile devices were detected over the whole of 2012.  SMS Trojans, which send unauthorized text messages to short, premium-rate numbers, are still the most prevalent category of mobile threats and currently represent 63.6% of all attacks.  A total of 99.9% of new mobile threat detections target the Android platform.  According to KSN data, the Top 20 most commonly used malicious or potentially unwanted programs for Android are:      Rank  Name  % of all attacks    1  Trojan-SMS.AndroidOS.FakeInst.a  29,45%    2  Trojan.AndroidOS.Plangton.a  18,78%    3  Trojan-SMS.AndroidOS.Opfake.a  12,23%    4  Trojan-SMS.AndroidOS.Opfake.bo  11,49%    5  Trojan-SMS.AndroidOS.Agent.a  3,43%    6  Trojan-SMS.AndroidOS.Agent.u  2,54%    7  RiskTool.AndroidOS.AveaSMS.a  1,79%    8  Monitor.AndroidOS.Walien.a  1,60%    9  Trojan-SMS.AndroidOS.FakeInst.ei  1,24%    10  Trojan-SMS.AndroidOS.Agent.aq  1,10%    11  Trojan-SMS.AndroidOS.Agent.ay  1,08%    12  Trojan.AndroidOS.Fakerun.a  0,78%    13  Monitor.AndroidOS.Trackplus.a  0,75%    14  Adware.AndroidOS.Copycat.a  0,69%    15  Trojan-Downloader.AndroidOS.Fav.a  0,66%    16  Trojan-SMS.AndroidOS.FakeInst.ee  0,55%    17  HackTool.AndroidOS.Penetho.a  0,54%    18  RiskTool.AndroidOS.SMSreg.b  0,52%    19  Trojan-SMS.AndroidOS.Agent.aa  0,48%    20  HackTool.AndroidOS.FaceNiff.a  0,43%      First place this past quarter goes to Trojan-SMS.AndroidOS.FakeInst.a (29.45%). This threat targets primarily Russian speaking Internet users attempting to download software for Android devices from dubious sites. Often, cybercriminals use these websites to spread malware under the guise of useful software.  (18.78%), an adware Trojan ranked second. This threat is seen primarily in European countries, where it is used by the developers of free software to monetize products by displaying ads.  Third and fourth place both went to SMS Trojans from the Opfake family: Trojan-SMS.AndroidOS.Opfake.a (12.23%) and Trojan-SMS.AndroidOS.Opfake.bo (11.49%). The first modifications of the Opfake family of threats were disguised as the latest version of Opera, a popular mobile browser. Today, the malicious programs in this family are disguised as new versions of other popular apps (Skype, Angry Birds, etc.).  Incidents  We would like to touch on two of the most interesting virus incidents of the first quarter this year:   a new threat going by the name of Perkele or Perkel, which hunts for mTANs,  and the MTK botnet.   Another important event that took place this past quarter was the targeted attacks against Android users that we addressed above.  Perkel  During the first two weeks of March, the well-known journalist Brian Krebs detected information on underground Russian-language forums about a new banking Trojan targeting mobile devices and allegedly affecting users in 69 countries. As rumor had it, the new threat had already infected no small number of devices. Krebs suggested that this Trojan was created by Russian speaking virus writers, since the combination of tools used to create it are made available on Russian-language forums.  This news naturally drew the attention of antivirus professionals, but no examples of the software were available for a while.  Several days later, the first modifications of Perkel were detected. After Kaspersky Lab performed an analysis, it became clear that there were some new additions to the family of malicious programs designed to steal text messages containing mTANs. The functions seen in the Perkel family are typical of this group, with two exceptions:   Perkel tends to use text messages rather than HTTP to communicate with the command server and upload stolen data (in addition to text messages with mTANs, the threat also collects information about the infected device).  The threat is capable of performing self-updates by downloading a new copy of itself from a remote server.   The MTK Botnet  In mid-January, word came out about the existence of a botnet that had infected up to one million Android devices owned primarily by Chinese users. As it turned out, the spread of a malicious program in China was at the root of the botnet (Kaspersky Lab has dubbed this malicious program Trojan.AndroidOS.MTK). It spread via unofficial Chinese app stores with popular, cracked games. In addition to stealing information about the infected smartphone, user contact data and messages, threats in this family also hype up a variety of apps. To do so, the Trojans stealthily download and install apps on the victim’s mobile device, and then give that app the highest possible rating in the app store. Then, they report their actions to a remote server. The number of apps for Android is constantly on the rise, and it is often a challenge to gain popularity with users — which is why these illegitimate tactics are becoming all the more common.  TurkTrust’s certificates revoked  In the first quarter of 2013, we saw yet another incident involving root certificates . Microsoft, Mozilla, and Google all revoked two root certificates issued by the certificate authority TurkTrust, thus removing them from their respective browser databases.  As it turned out, TurkTrust had released redundant root certificates to two organizations in place of typical SSL certificates. They could be used to make SSL certificates for any resource on the Internet, and the browsers used to access these resources would accept these certificates as ‘trusted’.  In December, Google found that one of the certificates issued by TurkTrust SSL for *.google.com had been involved in a “man-in-the-middle” type attack. Naturally, the fact that Google had been attacked meant that the certificates issued in the same way could be involved in attacks against other companies.  This latest in a line of major incidents related to root certificates and trust issues has shown that the malicious use of legitimate certificates remains a critical problem. However, the malicious usage of these types of certificates has only ever been identified after the fact, as currently there are no effective means of preventing these types of incidents at this time.  Statistics  em>All statistical data used in the report has been obtained from the cloud-based Kaspersky Security Network (KSN). The statistics were acquired from KSN users who consented to share their local data. Millions of users of Kaspersky Lab products in 213 countries take part in the global information exchange on malicious activity.","url":"https:\/\/securelist.com\/it-threat-evolution-q1-2013\/36660\/"},{"Unnamed: 0":0,"query":"APT1","text":"'Operation Oceansalt' Reuses Code from Chinese Group APT1\r\n\nA recently observed cyber-espionage campaign targeting South Korea, the United States and Canada is reusing malicious code previously associated with state-sponsored Chinese group APT1, McAfee reports.\nExposed in a Mandiant report in 2013 and also known as Comment Crew, APT1 was thought to be a unit of China’s People’s Liberation Army (PLA) and was considered both one of the most persistent of China's cyber threat actors and highly prolific in terms of the quantity of information it had stolen.\nThe newly observed campaign is unlikely the work of APT1, which has remained silent ever since the Mandiant report half a decade ago. Previously, the group had launched cyber-attacks on more than 141 U.S. companies from 2006 to 2010.\nDubbed Oceansalt, the malware implant used in the new campaign shows code similarities with a tool employed by APT1, namely Seasalt. This means that the actor behind the new operation had direct access to Comment Crew’s source code, although it was never made public.\nMcAfee’s report (PDF) on Oceansalt doesn’t provide a clear answer on who is behind these attacks, but notes that the code overlap could suggest that another group had access to the original code, or that it is a case of code-sharing between actors. Of course, it could also be a “false flag” operation.\nMcAfee’s security researchers discovered that Oceansalt was launched in five attack waves adapted to the targets.\nWhile the first two attacks were spearfishing-based and used malicious Korean-language Microsoft Excel documents to download the implant, the third switched to Microsoft Word documents instead. Waves four and five targeted a small number of entities outside of South Korea, including the U.S. and Canada.\nDuring the attacks, the hackers used multiple command and control (C&C) servers, showing that the campaign is active in countries such as Canada, Costa Rica, the United States, and the Philippines.\nOceansalt and Seasalt, McAfee notes, not only contain two exact same strings (Upfileer and Upfileok), but also show similarities in command handler and index table, and execute their capabilities in the same way. Furthermore, both use the exact same response codes to indicate the success or failure of command execution.\nBoth implants use the same codes for drive and file reconnaissance, and for the creation of reverse-shells (which are based on cmd.exe). Unlike Seasalt, however, Oceansalt uses an encoding and decoding mechanism, and a hardcoded control server address, but employs no persistence method.\nAccording to McAfee, evidence that suggests code-sharing between Oceansalt authors and Comment Crew include the different mechanism for getting the C&C IP addresses, as well as the lack of reverse-shell capability in some Oceansalt samples, the presence of debug strings in Oceansalt, and the presence of new functions in one Oceansalt variant.\nThe implant, the researchers reveal, packs a broad range of capabilities to capture data from the victims’ machines, but it is only a first-stage component, with additional stages downloaded through commands. The malware, however, provides operators with the ability to perform various actions on the system.\nOceansalt includes support for a dozen commands: extract drive information, send information about a specific file, execute a command line using WinExec(), delete file, create file, get information on the running processes, terminate process, create\/operate\/terminate reverse shell, and test receive and send capabilities.\n“Our research shows that Comment Crew’s malware in part lives on in different forms employed by another advanced persistent threat group operating primarily against South Korea. This research represents how threat actors including nation-states might collaborate on their campaigns,” McAfee concludes.\nRelated: Researchers Say Code Reuse Links North Korea's Malware\nRelated: 'GreyEnergy' Cyberspies Target Ukraine, Poland","url":"https:\/\/www.securityweek.com\/operation-oceansalt-reuses-code-chinese-group-apt1"},{"Unnamed: 0":1,"query":"APT1","text":"Lessons from Mandiant’s APT1 Report\r\n\nLast week Mandiant released a powerful report that exposed what certainly appears to be a state-sponsored hacking initiative from China, dubbed by Mandiant as APT1. If you haven’t already, I highly encourage you to read the full report available here. The report not only provides analysis of the organization behind the attacks, but also includes a wealth of detail into specific techniques used by the groups as well as indicators that you can use in your own security practices.\nIn this article I will summarize some of the key indicators as well as some of the techniques that may help you find other indicators of advanced attacks in your network.\n3,000 Indicators\nIt was certainly heartwarming to see Mandiant release a large number of very specific indicators of APT1 that security teams can put to good use. Far too often, a security vendor will report about how they uncovered a breach, but often lack the details that would help real infosec professionals to better do their job.\nIn this report, Mandiant has done the industry a solid by disclosing a variety of very specific indicators that they have been able to tie to APT1, including domains used by the attacking infrastructure, SSL certificates used to encrypt the attacker’s traffic, MD5 hashes of APT1 malware and a variety of other open-source “indicators of compromise”.\nThis provides very actionable information, but information that we all have to realize will also very short-lived. Given the sophistication of the APT1 organization, it’s quite likely that the referenced domains, hashes and certificates that were exposed have been decommissioned or will be soon. The indicators of compromise delve more deeply into the techniques of the attackers as opposed to certs and domain, which are effectively disposable.\nPatterns and Techniques\nBeyond the easily identifiable indicators, the Mandiant report provided insight into the lifecycle of an APT1 attack from the initial infection, escalation and ongoing theft of data.\nFirst, as one might expect, APT1 used highly targeted spear-phishing techniques to infect a target, which included creating fake email accounts in the name of someone that the target would recognize. Secondly, the infecting files were often zipped to avoid analysis and often contained executables designed to look like pdfs.\nThis provides two important lessons – one technical and one practical. First, it means that when looking for advanced malware, we absolutely must look within zipped payloads. But secondly, it destroys the all-to-common idea of malware infections being the source of the “stupid user”. That’s not to say that “stupid users” don’t exist and that they don’t lead to malware infections – they certainly do on both counts. But the point is rather that highly targeted phishing can be constructed to fool even savvy well-trained users, and we can’t rely on training to solve the problem on its own. Instead, we need to proactively test and analyze content to programmatically determine if it is malicious or benign.\nThe report also shared that once the infection was established, the attackers would often rely on RDP (remote desktop protocol) to administer the ongoing attack. This protocol is obviously highly common on enterprise networks and allows the attacker to control the compromised machine remotely. RDP has been strongly linked to advanced attacks shared in a variety of other reports, including this year’s Verizon Data Breach Report. The lesson here is pretty clear – RDP and related protocols are one of the key tools of persistent attacks and security teams to have strict control over RDP, limiting its use to only the few users who must have it, and requiring two-factor authentication for RDP users.\nAPT1 also used a myriad of techniques to hide its communications with command-and-control servers. This included sharing data via HTTP, custom protocols written by the attackers, and a variety of modified protocols designed to look like normal application traffic, such as MSN Messenger, Gmail Calendar, and Jabber (a protocol used in a variety of instant messaging applications). All of these traffics were often used in conjunction with SSL to further obscure the traffic. This again highlights the need to look within SSL-encrypted traffic as well as the need to find customized traffic and unusual traffic that deviates from protocol. This is an emerging art, but certainly possible using firewalls and threat prevention solutions that finely decode network and application protocols.\nOnce it was time to steal data, the attackers predominantly relied on FTP. As with the infecting file, exfiltrated data was often compressed, this time mostly with RAR. FTP is very popular with malware because it is small, flexible and often allowed in networks. However, security teams should remember to closely analyze FTP and certainly take a closer look at FTP used to transport RAR files.\nLearn to See What Doesn’t Belong\nWhile the Mandiant report is incredibly illuminating, it is also not a panacea. If anything, the more we learn about sophisticated attacks the more it is obvious that security products will never be enough without security skill. Certainly, we will continue to need and use signatures and systems that can automatically block the bad things on our networks. But it is also equally clear that this alone won’t be enough. We need to actively seek out and test the unknowns in our network, whether that is anomalous traffic or unknown, potentially malicious files.\nWe need to know the application fingerprint of our networks and users so that we can see when something is amiss. Security is fast becoming the front-lines for enterprises and one of the most strategic roles in any organization, but it requires us to be actively and intellectually engaged. That is a daunting task, but one we can meet.","url":"https:\/\/www.securityweek.com\/lessons-mandiant%E2%80%99s-apt1-report"},{"Unnamed: 0":2,"query":"APT1","text":"Lockheed: Attackers Went Quiet After APT1 Report Exposed Chinese Hackers\r\n\n\nLockheed Martin Says Attackers Went Quiet After Mandiant's APT1 Report Called Out Chinese Cyber Spies\nThreat actors targeting Lockheed Martin immediately halted their cyberattacks against the defense contractor following the release of Mandiant’s APT1 report, Lockheed executives said Wednesday.\nIn February 2013, Mandiant released its bold, unprecedented report that made direct allegations and exposed a multi-year, massive cyber state-sponsored espionage campaign from a unit of China’s People’s Liberation Army (PLA).\nThe threat actor group, dubbed APT1 by FireEye-owned Mandiant, is alleged to be one of the most persistent of China's cyber threat actors, which the security firm claims has “systematically stolen hundreds of terabytes of data” from at least 141 organizations.\nHowever, as Mandiant explained in a follow-up report released in May 2013, the threat actors immediately began curtailing their attacks after being called out and began to shift techniques, something that Lockheed witnessed in its own environment. \n“Since the Mandiant report came out, we saw an immediate decrease in attacks,” Charles “Charlie” Croom, VP of Cyber Strategy and Government Relations at Lockheed Martin Information Systems & Global Solutions, told SecurityWeek. “I think all our strategic partners saw that,” he said.\nSpeaking to SecurityWeek at the company’s Global Vision Center in Arlington, Virginia, Croom said the adversary that Mandiant exposed was one that a number of companies, including Lockheed Martin, had been tracking for over a year. “We were familiar with this adversary, and were familiar with their tactics and procedures,” he said.\n“Because of the characteristics of the attacks, and who they are attacking, we know who the team is,” Croom said.\nWhile Mandiant’s report was met with criticism by some, particularly around the challenges of attribution, it’s clear that the report had a significant impact and triggered a reaction from the alleged state sponsored threat actors.\n“We’re glad Mandiant stood up,” Croom said.\n“[The report] was a trigger point”, Darrell Durst, VP of Cyber Solutions at Lockheed Martin, said during a panel discussion at the Lockheed Martin Defense and Intelligence Technology Media Summit on Wednesday. “Things were dying down even before the report came out, but you could clearly see a shift in actions.”\nTargeting Suppliers\nWhile not necessarily as a result of the APT1 report, Croom, who while in the U.S. Air Force served as Director of the Defense Information Systems Agency (DISA) and Commander of the Joint Task Force for Global Network Operations, said that Lockheed’s hardened IT security infrastructure is forcing some attackers to find other means to attack.\n“The good news is that they are not attacking Lockheed Martin any more because we are too hard, so they are going to our suppliers,” he said.\n“The threat over the last ten years has gotten extremely aggressive,” Durst said. “[Attackers] are actually being very strategic in where it is that they want to get the information and how they are going to go about doing that.”\n“They will wait,” Durst said, adding that attackers will take their time in order to get in and achieve their objectives.\n“They will go to a supplier who has the connection to Lockheed Martin from an IT perspective, or even in a sharing of documentation,” Durst said.\nWhile Durst says the defense giant has been successful in thwarting a number of attackers, he said new adversaries with new techniques continue to emerge and campaigns continue to increase.\n“We have seen a number of the adversaries gone quiet,” he said. “I think we have successfully been able to counter a number of adversaries relative to our networks.\"\nWhile some attackers may have gone quiet, the company does not believe they have gone away for good, but have rather shifted tactics.\n“Even if it were two years, that’s not necessarily an indication that they have gone away,” Durst said.\n“We are assuming they are taking a different approach,” said Tim Reardon, Vice President and General Manager Lockheed’s Defense & Intelligence Solutions group.\nWhile Lockheed did not specify the tactics used against them by the APT1 attackers, Mandiant’s report explained that the group used highly targeted spear-phishing techniques to infect a target, which included creating fake email accounts in the name of someone that the target would recognize.\nWhen asked if they were able to trace the attacks back to China, Croom reiterated the company’s policy of non-attribution.\n“We’re interested more in their attributes, and how their attributes can reveal them coming into our network so that we can spot them and kick them out.”\nRelated Reading:  Cyber Espionage Campaign Targeting Supply Chain Through Precision 'Hit and Run' Attacks","url":"https:\/\/www.securityweek.com\/lockheed-attackers-went-quiet-after-apt1-report-exposed-chinese-hackers"},{"Unnamed: 0":3,"query":"APT1","text":"Unit In China's PLA Behind Massive Cyber Espionage Operation: Report\r\n\nAPT1: Mandiant Exposes One of China's Most Active Cyber Espionage Units\nIn a fascinating, unprecedented, and statistics-packed report, security firm Mandiant made direct allegations and exposed a multi-year, massive cyber espionage campaign that they say with confidence is the work of China, more specifically, a unit of China’s People’s Liberation Army (PLA).\nMandiant has named the attack group “APT1”, what is likely a government-sponsored group that is one of the most persistent of China's cyber threat actors, and considered to be one of the most prolific in terms of quantity of information it has stolen.\nTo further its claims that there are actual individuals behind the keyboard, Mandiant also revealed three “personas” that they say are associated with APT1 attacks.\nAccording to Mandiant’s investigations, APT1 has taken hundreds of terabytes of data from at least 141 organizations across many industries going as far back as 2006, but representing just a small fraction of the overall cyber espionage that APT1 has conducted.\nIt was the massive scale and impact of APT1's operations that compelled Mandiant to write and publically release the report.\nHistorically, Mandiant has said there was no way to determine the extent of China’s involvement in many attacks, but the firm now says it has enough evidence to confidently say that “the groups conducting these activities are based primarily in China and that the Chinese Government is aware of them.”\nWhile many firms steer away from publicly calling out China as a culprit in cyber attacks, Mandiant is taking a stance and boldly pointing fingers at China, and bringing many statistics and research to back its case.\nMandiant believes APT1 is the 2nd Bureau of the People’s Liberation Army (PLA) General staff Department’s (GSD) 3rd Department, commonly known by its Military unit Cover Designator (MUCD) as Unit 61398.\nThe security firm estimates that Unit 61398 is staffed by hundreds, or even thousands of people, and that China Telecom provided special fiber optic communications infrastructure for the unit. Additionally, Mandiant said that it conservatively estimates that APT1’s current attack infrastructure includes over 1,000 servers across dozens of countries.\nMandiant said that it was able to confirm 937 command and control servers running on 849 distinct IP addresses and has confirmed 2,551 domain names attributed to APT1 in the last several years.\n“Our research and observations indicate that the Communist Party of\u2028 China is tasking the Chinese People’s Liberation Army (PLA) to commit systematic cyber espionage and data theft against organizations around the world,” the report alleged.\nWhen APT1 launches an attack against a target, it’s typically not a one shot deal or a quick hit. In fact, according to Mandiant’s research, APT1 maintained access to victim networks for an average of 356 days. The longest time period APT1 maintained access to a victim’s network was four years and ten months.\nIn one operation, Mandiant witnessed APT1 steal 6.5 terabytes of compressed data from a single organization over a ten-month time period. APT1’s targets include organizations across a broad range of industries, mainly in the United States and other English-speaking countries.\n\nIn over 97% of the 1,905 times Mandiant witnessed APT1 intruders connecting to their attack infrastructure, APT1 used IP addresses registered in Shanghai and systems set to use the Simplified Chinese language.\n“Once the group establishes access to a victim’s network, they continue to access it periodically over several months or years\u2028 to steal large volumes of valuable intellectual property, including technology blueprints, proprietary manufacturing processes, test results, business plans, pricing documents, partnership agreements, emails and contact lists from victim organizations’ leadership,” the report explained.\nHacking For Economic Gain and Advantage\nMandiant’s investigations show that APT1 has targeted at least four of the seven strategic emerging industries that China identified in its 12th Five Year Plan, and warns that any industry related to China’s strategic priorities are potential attack targets.\nMandiant highlighted an attack in 2008 that compromised the network of a company involved in a wholesale industry. According to Mandiant, over the next two and a half years, APT1 used various tools to steal an unknown number of files from the victim and repeatedly accessed the email accounts of several executives, including the conpany's CEO and General Counsel. During this same time period, news organizations reported that China had successfully negotiated a double-digit decrease in price per unit with the victim organization for one of its major commodities, Mandiant said.\nChina continues to deny claims\nAs usual, China denied that its Army had supported any kind of hacking activity.\n\"Not only are reports that China's army has been involved in hacking unprofessional, they do not fit with the facts,\" China's defense ministry said in a statement to AFP. \"Hacking attacks are a global problem. Like other countries, China also faces the threat of hacking attacks, and is one of the main countries falling victim to hacking attacks.\"\nChina’s foreign ministry also reminded that China was itself a major victim, saying that most overseas cyberattacks against it originate in the US.\nRecent attacks against several high-profile US media outlets, Including The New York Times, The Wall Street Journal, The Washington Post, and Bloomberg, as well as against Twitter and others, have further raised concerns over Chinese hackers.\nIn late January, The New York Times said hackers stole corporate passwords and targeted the computers of 53 employees including former Beijing bureau chief Jim Yardley, who is now the South Asia bureau chief at the Times based in India, after the newspaper published a report on the vast wealth amassed by Premier Wen Jiabao's family.\nMandiant was hired to investigate the attacks against The Times. \nWhile Mandiant hopes its efforts will lead to increased understanding and coordinated action in countering targeted cyber attacks, it also acknowledged that releasing this report has put itself somewhat at risk.\n“We are acutely aware of the risk this report poses for us,” Mandiant noted. “We expect reprisals from China as well as an onslaught of criticism.”\nIn addition to the detailed report, Mandiant provided more than 3,000 APT1 indicators of compromise, including domain names, IP addresses, X.509 encryption certificates and MD5 hashes of malware used by APT1's attackers, in order to help organizations identify and defend against APT1 operations.\nThe full report from Mandiant can be found here (PDF), and the Appendix and 3,000+ APT1 Indicators can be found here (.zip). Mandiant also provided a video showing actual APT1 activity which is embedded below.\nThis report is likely to be one of the most important reports of the year and should be required reading for any information security professional—or if it were up to me, everyone within an organization.\n","url":"https:\/\/www.securityweek.com\/cyber-unit-chinas-pla-behind-massive-cyber-espionage-operation-report"},{"Unnamed: 0":4,"query":"APT1","text":"China's APT1 Changing Tactics, Rebuilding: Mandiant\r\n\nIt appears the Chinese cyber-espionage crew behind attacks on as many as 100 businesses is cutting back on some of its attacks and looking for alternative tools, Mandiant said.\nBack in February, Mandiant released a 74-page report with loads of information on the group, dubbed APT1, including its attack methods, operational methodology, and organizations it had previously infiltrated. The report accused APT1 of retrieving hundreds of terabytes of stolen data. Even if APT1 wasn't an official entity within the Chinese government, the report made a strong case that the government was at least aware of its operations.\n\nSince the publication of the report, the group may have had to change some of its methods, Mandiant said in a follow-up report this week. The original report included more than 3,000 APT1 indicators used by APT1, including domain names, 832 IP addresses, 13 digital certificates used to encrypt data, and MD5 hashes of over malware. Recent analysis indicates they are still active, but they are changing their methods.\n\"APT1 is still active using a well-coordinated and well-defined attack methodology against a wide set of industries -- with a discernible post-report shift towards new tools and infrastructure,\" wrote Dan Mcwhorter, Mandiant's managing director for threat intelligence.\nThe report was the first time a private sector company had laid out evidence to link the China to cyber-espionage campaigns against businesses and government entities around the world.\nAPT1 relied on social engineering methods, remote access tools, and more than 40 malware families to carry out their operations, the original report said. The report's goal was to make it harder to the group to carry out their attacks and slow them down, since organizations now knew what to look for in their logs and network traffic. It appears to have had some effect, as the information \"hindered APT1's operations,\" Mcwhorter wrote.\n\"APT1 has stopped using the vast majority of the infrastructure that was disclosed with the release of the indicators,\" Mcwhorter wrote.\nThe group has not been knocked out yet, as it probably still has access to an extensive infrastructure of computers around the world. While there was speculation that Mandiant's publication of APT1 indicators would have resulted in the group dismantling itself, the follow-up reports indicates that is not the case.\nMandiant noted that APT1 is only one of more than 20 Advanced Persistent Threat groups operating out of China that the company is aware of. Mandiant's report disrupted only APT1, not the others.\n\"Mandiant has observed no significant changes in their operations,\" the follow-up report said. \nRelated Reading: Lessons from Mandiant's APT1","url":"https:\/\/www.securityweek.com\/chinas-apt1-changing-tactics-rebuilding-mandiant"},{"Unnamed: 0":5,"query":"APT1","text":"Chinese Whispers, Chinese Lies: Analyzing Mandiant's APT1 Report\r\n\nIn the weeks since the Mandiant APT1 Report was released, the conclusions presented by Mandiant have been extensively repeated and commented on by pretty much everyone. Worryingly, the narrative was accepted almost unequivocally, brushing aside many inconsistencies and disregarding any opposing interpretations. In the case of most of the commentators, it appeared they had either only briefly skipped through or not even read the original report.\nWhat struck me and many others as most suspicious, were the glaring operational security lapses that this supposedly “highly professional” hacking group seems to have made over the course of several years. Most obvious is the continued use of the “hugesoft.org” domain name.\n\nWe are meant to believe that a covert, special operations team member was allowed to bring with him a tainted domain from his civilian, cybercrime days. What that would indicate is that in this vast, huge group (Mandiant alleges several hundred or even thousands) no one knows anything about operational security procedures, such as executing regular reviews for example, that would and should have eventually made the Comment Crew themselves aware of these smoking guns. The group evidently has sufficient knowhow and is able to use OSINT to construct targeted attacks and provide them with situational awareness to operate, yet appears to be unable to cover their tracks.\nWe are also told that APT1 was so careless or brazen, depending on the interpretation, that they habitually entered partially correct information for domain registration data, even using email addresses that could be Google’d or traced using OSINT methods. Not consistently though – only sometimes. At other times, they made them up.\nThe analysis of the WHOIS records by Mandiant was hilarious. On Page 47 (PDF), we are treated to the ludicrous assumption that the spelling, of all things, of the fake registry information is of any consequence. All it shows is that whoever did it did not care about the accuracy of the contents of a fake dns registration. Because it’s fake, duh. Mandiant’s conclusion is again, comical:\nUncoordinated DNS registration campaign – where some registrants fabricated fake data and others did not. What is that even supposed to mean? An “uncoordinated campaign” is something of an oxymoron anyway.\nThe report lists many domains that were spotted by Mandiant. The only problem is that they are consolidated, and not listed or sorted in any way that allow a 3rd party to recognize in which context, constellation and grouping they were actually originally identified. This is disingenuous, because it means that it is not transparent whether the attribution of all of these to one individual group is correct, or if there were other patterns within the individual incidents. Essentially, the veracity of the claim that all of these domains belong to one group is something we have seen no actual evidence for. It is based solely on word of mouth. Of course, many of these can be verified by other 3rd parties, and has been done, but not all of them together. That can give the false impression that the Indicators of Compromise have been verified.\nThe indicators tying the Comment Crew to PLA Group 61398 are also tenuous, so tenuous that if you plucked them with your finger, they would probably tear. The Information on PLA Group 61398 is undisputable. There is absolutely no doubt that this group exists. What is in question however, is that the group identified (although even the evidence that the activity is solely of one group is questionable) as the Comment Crew are in fact one and the same. Mandiant provides nothing in hard evidence, instead stringing together coincidences and leaps of logic that would seem more at home on a conspiracy forum.\nMost of the characteristics that match (Page 59, Table 12, Matching Characteristics) between APT1 and Unit 61398 would apply almost to any active Hacking Group. It is like identifying a murderer by saying that murderers have 2 arms, 2 legs, and kill people, hence so-and-so did it.\nEven the geographical attribution is unreliable in the sense that there could be other hacking groups acting in such a vast and populated area, that has a population of over 5 million, is home to several thousand businesses and 2 universities. In the same vein, you could attribute any hack originating in London to the UK Ministry of Defense.\nThese are the main points that the entire synopsis of the Mandiant Report hinges on. It is also worth pointing out that many of the subsequent conclusions are based on huge leaps of faith and many assumptions. In addition, much of the report is filled with information and OSINT sources that only corroborate and strengthen the evidence for the existence of the Comment Crew, and the existence of PLA Unit 61398, but not that they are indeed one and the same.\nThere is one secondary indicator that has been made a great deal of. On page 52, the report cites an incident involving the actor identified as “Ugly Gorilla” in 2004, who asked a prominent Professor whether China had a “cyber army”. Whilst an interesting find, it really proves very little in the way of any association between “Ugly Gorilla” and the PLA, but keep a mental note of it, as we will revisit it later.\nI am a great believer in the principle of Occam’s Razor. Whatever hypothesis makes the least assumptions is the most likely. Applying that to many of the findings in the Mandiant Report and the narrative that was provided as an explanation seems prone to relying on too many assumptions.\nThe problems identified with the report have not been entirely overlooked. Considering the obvious lapses in operational security that the alleged Comment Crew displayed even Mandiant has conceded in the meantime that the Crew is not China’s “A-Team”. No kidding, Sherlock! It is in fact well known that China has some operational offensive cyber-teams of a high caliber. In this of course, they are not alone. According to Mandiant:\nApplying Occam’s razor here again: Why would the Chinese have these elite groups that appear to work without leaving anywhere near as many traces, and then instead let the B-List go on a rampage doing most of the work? Even if it is argued that it is a matter of resources, it seems unlikely that these teams would not, over time, train the others, or that Operational Security Procedures, Tools and Knowhow would be shared.\nWhen pressed if the Comment Crew were more “regimented” than a group of freelancers, Richard Bejtlich, the CEO of Mandiant retorts, “Other units are more regimented and have better opsec [or operational security,] and that’s why we didn’t talk about them.”\nIt seems just a little bit as though Mandiant caught a Minnow, and back at the pub with each telling the arms go wider apart taking on the size of a pike. Not to trivialize the damage done, but one needs to keep in mind that the Comment Crew in particular used a lot of off-the-shelf tools and relied far less on 0days than the more sophisticated groups, not to mention the less than stellar OpSec, leaving a trail like bull in a China shop (obligatory pun intended).\nEven latest finding, of old blog entries from an individual purported to be a member of PLA Group 61398 and the Comment Crew, whilst sounding plausible at first glance makes you scratch your head in wonderment once you think about it. How was it possible that this individual was able to post this information on a public blog for so many years, without arousing the attention of his colleagues, superiors, or any of the other various organs of the Peoples Party that otherwise monitor and censor all else. Even project details are disclosed. There are examples of information being censored for far less.\nThis is the problem when you are trying to match the evidence against a foregone conclusion. We like to compare this to solving a jigsaw puzzle, which is a bad analogy. You always know what a jigsaw puzzle looks like before, and just try to fit the pieces to make that picture. This is more like a riddle, where you are given clues that are meant to lead to the answer. I am not in any way saying that the good folks at Mandiant are up to anything sinister or are colluding with anyone , far from that. The release of the Indicators of Compromise were a boon to the entire community, and their technical ability is undoubtedly of the highest quality and caliber. But we are all human and cannot overcome our personal and innate preconceptions and preconceived notions. The technical work was excellent-- the drawing of conclusions less so.\nThere are far too many assumptions there for it to be the most likely explanation. Occam’s razor states that these guys are not military grade. That is the only possible conclusion based on all the evidence there currently is.\nThe foremost problem with the Mandiant report is that it relies on a view of China and the Chinese Cyber-Operations that has very little to do with situational conditions on the ground. It clings on to the stereotype of a regimented, centralized China with total top down control. If that China ever existed, that is certainly not the case now.\nIf you have followed the news and reports coming out from China the past years, and especially the last months, you will have heard of widespread governmental and industrial and economic corruption. This corruption is endemic and the main driver behind the prolific hacking. The majority of the hackers are indeed freelancers, paid bonuses and fees for valuable information. There is evidence to support this, with instances of alleged Chinese government operations being found hosted side by side with criminal activities. Once again, a surefire sign that military or intelligence services operational security are not being followed by these kinds of threat actors. The risk of losing operational integrity is too high.\nEven the prevailing and popular theory that these freelancers are in the employ of the Chinese government is often incorrect and ignores the scale and specific Chinese character of the corruption. A recent report in the China Digital Times provides a behind the scenes look into how espionage and surveillance are used in internecine infighting in local, regional and possibly even national government, politics, and economics. It is a definite recommended must read. Espionage has become a tool of choice in China when doing business and a common weapon to get ahead in your career.\nEssentially, there are many, many parties who will make use of these types of services, the majority of them without any Peoples Party or PLA authority, or even their knowledge. Businesses competing in this environment will also use any means possible to get or stay ahead.\nIn this environment, hackers can take on contracts from many of the parties participating in this activity, going either after specific targets or information, selling opportunistic pay data to multiple customers, or if the data is valuable enough, to the highest bidder.\nWhat this really means though, is that when the Chinese government states that it is not behind most of these attacks – it is possibly telling the truth. That the Chinese government has offensive cyber capabilities are not disputed – most governments now have these, or are planning on adding them. What is not a given is that all of this activity has been officially prompted or sanctioned.\nAs well as commercial freelancers plying their trade to anyone willing to pay, there are dedicated groups financed and set up by unsanctioned individuals and interest groups, working specifically to further private interests. The line between government and private interests, due to the innate nature of the power structures in China, are often blurry to the point of being unrecognizable.\nOne thing to note is that the hacking is also indiscriminate; they target each other as much as international targets.\nAdd to this the fact that other actors, and other nation states amongst them, use china as a jumping –off point, and the result is pandemonium and chaos. It’s the wild, wild east.\nComing back to the incident with “Ugly Gorilla” and his public query that some have interpreted as the possible first contact between the PLA and UG, it is just as likely that a private entity could have reached out and made contact. Amongst the many OSINT sources dug up so far in regards to the identified members of the Comment Crew, attempts at finding employment seem to figure prominently. That too indicates a burgeoning market for hackers for hire. If it was only the government employing hackers, publicly seeking work would seem moot.\nThe reason then, why the Comment Crew, and such groups in general, are so successful; have perfected and evolved their infrastructure, techniques and toolsets; have been able to obtain the resources and longevity and maintain their focus in such a way that many observers think they are nation-state sponsored is because they have an economic environment that makes this possible. They are able to convert much of the data they exploit into hard cash and other income, and in a location like the industrial hub Pudong they have quick and easy access to office space, infrastructure, human resources, and as an added bonus occasionally get to rub shoulders with the national intelligence community at lunch. The same environmental factors that make Pudong attractive to the actual PLO Group 61398 would more than likely make it suited for similar operations, be they military and private.\nRon Gula, the CEO of Tenable Network Security, remarked to me recently that it sounded reminiscent of the KGB Hackers, whose story is recounted in Clifford Stoll’s wonderful account of how he traced this group and singlehandedly invented the discipline of computer forensics, “The Cuckoo’s Egg”. The KGB Hackers were primarily a group of German hackers led by Karl Koch acting under the alias Hagbard. They spied for the KGB in the late 1980’s, targeting European and US defense installations and contractors. Supplied with Cash payments and drugs amongst other things by their Russian handlers, they were able to carry out hacks with all of their attention full time. Of course, the people supplying the money need not necessarily be from the government. Anyone with deep pockets and a need for the information available via these means will suffice.\nOne may argue that my narrative has little evidence – to which I would counter that I have just as much as Mandiant. For that though, mine at least is based on situational awareness and a more realistic set of assumptions. Other commentators have come to similar conclusions as well.\nFor the Chinese government the problem is that it cannot acknowledge this state of affairs publicly or officially – not just because they may lose face – but also because corruption is such a touchy subject and has become a major problem and social issue in the Peoples Republic. In addition, many of the interest groups that are benefitting from these activities have a stake in the government and judging by other behavior will work against any attempt to limit them.\nIt remains to be seen if this activity will – or even can – be reined in by the Chinese government. It is questionable how much influence the leadership has on this behavior, or if it can do anything that will be effective at all, when it is so widespread, against intent and without official sanction anyway.\nThe announced crackdown on corruption by the new leadership may be the best hope and may have more of an impact than targeting the hacking market by itself, should it prove to be a heartfelt attempt and be in any way effective. The danger in the meantime though, is that the incessant offensive activity originating out of Chinese cyberspace, whether state-sponsored or the result of criminals and corruption, will lead to an escalation and a cyber-arms race. Calling for international agreement on offensive operations in cyberspace will do little to curb the shadow activity emanating from China. The government will have to take serious and effective action or the economic repercussions will outweigh any benefits deriving from engaging in espionage, as well as the cost required to control it. It would also have the benefit of reducing the noise that currently allows other actors to use Chinese IP-Space as a decoy to hide their own tracks.\nSo does this alternative interpretation change anything? Probably not for past, present and future victims. The Modus Operandi remains the same, and the primary concern for them is still damage limitation and the loss of data and competitiveness. But, it is relevant to policy makers and businesses intending on operating in China. It impacts how we have to interact with the Chinese government on this, and should also redefine our expectations.\nRelated Reading: A Convenient Scapegoat - Why All Cyber Attacks Originate in China","url":"https:\/\/www.securityweek.com\/chinese-whispers-chinese-lies-analyzing-mandiants-apt1-report"},{"Unnamed: 0":6,"query":"APT1","text":"China's APT1 Still Operating With the Same Modus Operandi\r\n\nAccording to researchers at Cyber Squared, the group APT1, as named by Mandiant earlier this year, is up to their same old tricks. Despite being outed after attacks against the New York Times and the Wall Street Journal, they have not changed tactics.\nTwo months ago, the APT1 group (a.k.a. “Comment Crew”) was the center of attention after being named in a Mandiant report. The intelligence firm was called in to investigate the security incidents the New York Times and the Wall Street Journal, and in a report said that APT1 was the “...2nd Bureau of the People’s Liberation Army (PLA) General staff Department’s (GSD) 3rd Department, commonly known by its Military unit Cover Designator (MUCD) as Unit 61398.”\n\nAccording to their report, Mandiant said that they were able to confirm 937 C&C servers, running on more than 800 distinct IP addresses. Further, the firm said that APT1 has had more than 2,500 domains attributed to them in the last several years.\n“Our research and observations indicate that the Communist Party of\u2028 China is tasking the Chinese People’s Liberation Army (PLA) to commit systematic cyber espionage and data theft against organizations around the world,” Mandiant’s report alleged.\nIn the aftermath of that news cycle, it was expected that APT1 would disappear, or at the least they would shift gears and change their tactics, tools, and procedures (TPPs). As it turns out, that isn’t the case.\n“As of late April 2013, Chinese cyber espionage threat groups have clearly continued their activity. In the example given below, we will highlight that “Comment Crew” is still conducting exploitation operations. In fact, there has been little change,” a blog post by Cyber Squared explains.\nWhile it is possible that the group is also using newer capabilities, the post explains, that they haven’t stopped using the methods they’re known for is concerning. Cyber Squared postulated that the group may have achieved “a satisfactory balance of conducting successful exploitation operations” with their existing infrastructure and methods, while implementing additional evasion techniques.\n“The totality of evidence leads us to believe that that “Comment Crew” is still in the game and up to their old tricks, using familiar tactics to target their victims. The February disclosure appears to have done little to stem the onslaught of cyber espionage from this or other Chinese threat groups,” the post concluded.\nAdditional details and the full report can be seen here. \nRelated: Lessons from Mandiant’s APT1 Report","url":"https:\/\/www.securityweek.com\/chinas-apt1-still-operating-same-modus-operandi"},{"Unnamed: 0":7,"query":"APT1","text":"FireEye Denies Hacking Back Against Chinese Cyberspies\r\n\nIn his latest book, New York Times correspondent David Sanger describes how cybersecurity firm Mandiant hacked into the devices of Chinese cyberspies during its investigation into the threat group known as APT1.\nMandiant, now owned by FireEye, published its famous report on APT1 back in 2013 when it was led by CEO Kevin Mandia. The company at the time released information apparently showing that the Chinese military had been conducting sophisticated cyber-espionage operations.\nIn his book, “The Perfect Weapon: War, Sabotage, and Fear in the Cyber Age,” Sanger describes how he was allowed to watch Mandiant hack into the hackers’ systems. An excerpt of Sanger’s book shared on Twitter by Thomas Rid, a Professor of Strategic Studies at Johns Hopkins University, reads:\nIn a statement published on Monday, FireEye admitted that Sanger was given access to the methods used by Mandiant to gather evidence of APT1’s ties to the Chinese military, but claims the reporter’s description “resulted in a serious mischaracterization of our investigative efforts.”\n“We did not do this, nor have we ever done this,” FireEye said regarding claims that its employees activated the cameras on the hackers’ own laptops. “To state this unequivocally, Mandiant did not employ ‘hack back’ techniques as part of our investigation of APT1, does not ‘hack back’ in our incident response practice, and does not endorse the practice of ‘hacking back.’”\n“Hacking back,” the term used to describe a cyberattack victim – or someone hired by the victim – hacking into the systems of the attacker, is a controversial practice and only few cybersecurity firms have admitted doing it.\nFireEye claims that what Sanger described as hacking back were actually video recordings of the attackers interacting with their malware command and control (C&C) servers. The firm has published one of the videos it presumably showed the reporter.\n“To someone observing this video ‘over the shoulder’ of one of our investigators, it could appear as live system monitoring. Nevertheless, Mandiant did not create these videos through ‘hacking back’ or any hacking activity. All of these videos were made through information obtained via consensual security monitoring on behalf of victim companies that were compromised,” FireEye explained.\nWhile some industry professionals have accepted FireEye’s explanation for obtaining data on the hackers’ personal online activities, Sanger’s claims that he saw APT1 members wearing leather jackets raises a lot of questions. FireEye has not specifically addressed this issue in its statement, but SecurityWeek is trying to obtain some clarifications from the company. In the meantime, experts have provided some more or less plausible explanations on how the reporter may have seen what he believed were the hackers.\n\nRichard Bejtlich, who worked for Mandiant and then FireEye between 2011 and 2017, including as Chief Security Strategist, has corroborated FireEye’s statement.\n‘At no time when I worked for Mandiant or FireEye, or afterwards, was there ever a notion that we would hack into adversary systems,” Bejtlich wrote in a blog post. “During my six year tenure, we were publicly and privately a ‘no hack back’ company. I never heard anyone talk about hack back operations. No one ever intimated we had imagery of APT1 actors taken with their own laptop cameras. No one even said that would be a good idea.”\nRelated: Chinese Whispers, Chinese Lies - Analyzing Mandiant's APT1 Report\nRelated: Considering The Complexities of Hack Back Laws","url":"https:\/\/www.securityweek.com\/fireeye-denies-hacking-back-against-chinese-cyberspies"},{"Unnamed: 0":8,"query":"APT1","text":"Researchers Identify Targeted Attacks in Australia\r\n\nResearchers at FireEye have identified a new targeted attack, currently hitting organizations in Australia, in order to deliver payloads designed to open remote access and steal information.\nThe malware discovered by FireEye goes to several lengths to remain hidden, and uses a chained process to attack its victim. According to FireEye, the victims in this attack were hand picked, with the opening stage of the attack itself coming via email.\nThe companies being targeted were selected for unknown reasons, but the attackers are using malicious URLs embedded within the emails that link to a C&C (Command and Control) domain that uses the name of the victim or the name of a current project that is being worked on as an attempt at legitimacy.\nOnce the victim visits one of the C&C domains, the host revives instructions as “base64 encoded strings using a custom character set, which is further scrambled using a custom-scrambling algorithm,” FireEye reported. \nAfter that, a base64-encoded executable embedded in an HTML page is downloaded and ran on the host.\n“In our experiment, since the CnC was not responding, we supplied an encoded notepad.exe in the response. The malware successfully decoded notepad.exe and launched it as setup.exe on the compromised machine,” FireEye explained.\n“We have observed many variants of this malware; some even try sending hostname and IP address information back to its CnC as part of its User-Agent string in the GET request. One of the variants we observed had “IPhone 8.5” in the UA string, which we found interesting.”\nIt’s worth mentioning that FireEye’s findings included a list of malware that was previously disclosed by Mandiant in their APT1 report. An indexed list of the APT1 malware can be seen here. ","url":"https:\/\/www.securityweek.com\/researchers-identify-targeted-attacks-australia"},{"Unnamed: 0":9,"query":"APT1","text":"\"Dust Storm\" Attackers Target Japanese Critical Infrastructure\r\n\n\nCommercial and critical infrastructure organizations in Japan have been targeted in a multi-year campaign dubbed by researchers “Operation Dust Storm.”\nA report published on Tuesday by endpoint security firm Cylance details the activities of a threat group that has been active since at least 2010. The attackers have targeted various organizations in Japan, South Korea, the United States, Europe, and several Southeast Asian countries, and in 2015 they started focusing on Japanese organizations.\nThe actor, which experts believe is a well-funded and well-organized group likely associated with a nation-state, relied on watering holes, spear phishing, unique backdoors and zero-day exploits to conduct reconnaissance and espionage.\nAccording to Cylance, the threat actor has breached the systems of Japanese organizations in the electricity generation, finance, construction, oil and natural gas, and transportation sectors.\nExperts reported that early Operation Dust Storm attacks were relatively unsophisticated and they were easily detected by the security industry. The group’s activities attracted the attention of researchers in 2011, when they used Adobe Flash Player (CVE-2011-0611) and Internet Explorer (CVE-2011-1255) zero-day vulnerabilities to deliver a piece of malware dubbed “Misdat.”\nIn October 2011, the attackers leveraged news surrounding the Libyan crisis and the death of Muammar Gaddafi to target US defense organizations and Uyghurs. The following year, they leveraged another Internet Explorer zero-day (CVE-2012-1889) in their operations.\nIn March 2013, shortly after Mandiant published a report on the notorious Chinese state-sponsored threat group known as APT1, experts noticed a significant drop in Operation Dust Storm activity until August 2013. Another noteworthy event took place in February 2014, when the actor started using a new Internet Explorer zero-day exploit (CVE-2014-0322) distributed via a watering hole set up on a software reseller’s website.\nIn 2015, when it started focusing on Japan, Operation Dust Storm targeted various types of organizations, including an automaker, the Japanese subsidiary of a South Korean electric utility firm, and an oil and gas company.\nIn addition to its previous tools, in May 2015, the group added several Android backdoors to its arsenal. These threats, designed to forward SMS messages and call information to a command and control (C&C) server, were used against victims in South Korea and Japan.\nThe pieces of malware used in the first attacks were unsophisticated and easy to detect, but the more recent campaigns involved custom threats that largely evaded security products, Cylance said in its report.\n“At this time, [Cylance] does not believe the attacks were meant to be destructive or disruptive. However, our team believes that attacks of this nature on companies involved in Japanese critical infrastructure and resources are ongoing and are likely to continue to escalate in the future,” Cylance concluded.\nRelated: Blue Termite APT Targets Japanese Organizations","url":"https:\/\/www.securityweek.com\/dust-storm-attackers-target-japanese-critical-infrastructure"},{"Unnamed: 0":0,"query":"APT1","text":"Hidden Lynx and MSS protection EXECUTIVE SUMMARY: On Tuesday September 17, 2013, Symantec’s Security Response organization published a whitepaper report on Hidden Lynx, a Chinese APT group of professional hackers with advanced capabilities. Evidence suggests that Hidden Lynx is a Chinese state sponsored hacker group with affiliations to “Operation Aurora”. This group was responsible for the compromise of security firm Bit9’s digital code-signing certificate, used to sign 32 pieces of malware. They have been involved in a number of operations over the last four years. The group offers a “hackers for hire” operation that is tasked with retrieving information from a wide range of corporate and government targets. They are a highly efficient team who can undertake multiple campaigns at once, breach some of the world’s best-protected organizations, and can quickly change their tactics to achieve their goal. They usually attack using multiple customized Trojans designed for specific purposes. Backdoor.Moudoor is used for larger campaigns and has seen widespread distribution, while Trojan.Naid is reserved for special operations against high value targets. The group uses cutting-edge attack techniques which makes this team stand out from other major attack groups. Symantec has been actively tracking this group since as early as 2009. THREAT DETAILS: The Hidden Lynx group has been in operation since at least 2009 and appears to be a professional organization that offers a “hackers for hire” type service. They have the capability to attack many organizations with concurrently running campaigns. They operate efficiently and move quickly and methodically. Based on these factors, the Hidden Lynx group would need to be a sizeable organization made up of between 50 and 100 individuals. The members of this group are experts at breaching systems. Their method for exploitation and pay-to-order targeted attacks involve a two-pronged strategy using two Trojans designed for each purpose: Team Moudoor distributes Backdoor.Moudoor, a customized version of “Gh0st RAT”, for large-scale campaigns across several industries. The distribution of Moudoor requires a sizeable number of people to both breach targets and retrieve the information from the compromised networks. Team Naid distributes Trojan.Naid, the Trojan found during the Bit9 incident, which appears to be reserved for more limited attacks against high value targets. This Trojan was leveraged for a special operation during the VOHO campaign and is probably used by a specific team of highly skilled attackers within the group. This Trojan was also found as part of “Operation Aurora” in 2009. Much of the attack infrastructure and tools used during these campaigns originate from China. The group makes use of regular zero-day exploits. They are methodical in their approach and they display a skillset far in advance of some other attack groups also operating in that region, such as the Comment Crew (also known as APT1). The Hidden Lynx group is an advanced persistent threat that has been in operation for at least four years and is breaking into some of the best-protected organizations in the world. With a zero-day attack already under their belt in 2013, they continue to operate at the leading edge of targeted attacks. TARGETS Since November 2011, hundreds of organizations worldwide have been targeted by the Hidden Lynx group. MOTIVATION This broad range of targeted information would indicate that the attackers are part of a professional organization. They are likely tasked with obtaining very specific information that could be used to gain competitive advantages at both a corporate and nation state level. Corporate Espionage The financial services sector has been identified as the most heavily targeted industry overall. There is a tendency to target specific companies within this sector. Investment banks and asset management agencies account for the majority of organizations targeted within this industry. Attacks against Government Contractors In attacks that have targeted all levels of government from local to national level, this group has repeatedly attempted to infiltrate these networks. Attacks against government contractors and, more specifically, the defense industry indicate that the group is in pursuit of confidential information and suggests that the group had been working for nation states. WHAT ARE THEY CAPABLE OF? The Hidden Lynx group’s advanced capabilities are clearly demonstrated in three major campaigns. In the VOHO campaign, they showed how they could subvert Bit9’s established trust models. In the FINSHO campaign, they managed to get advanced knowledge of a zero-day exploit and in the SCADEF operation, they undertook supply chain attacks to succeed in their campaign. IMPACT: Despite the exposure of the Hidden Lynx Chinese APT Hacker group, Symantec believes they will continue their activities. Symantec will continue to monitor activities and provide protection against these attacks. We advise customers to use the latest Symantec technologies and incorporate layered defenses to best protect against attacks by groups like Hidden Lynx. SOC DETECTION CAPABILITIES: For customers with MSS IDS\/IPS Security Management services, vendor-based signatures will be automatically deployed, as per the vendor’s recommendation. If you would like further information regarding the signature states on your devices, or would like to request the activation of a specific signature, please contact your Services Manager, or the Analysis Team can be reached by requesting help via phone, e-mail, or visiting the MSS portal at https:\/\/mss.symantec.com. For customers with monitor-only IDS\/IPS devices, Symantec MSS stands ready to provide security monitoring for these vulnerabilities once your IDS\/IPS vendor releases signatures and those signatures are enabled on your monitored devices. COMPONENTS AND DETECTION Backdoor.Moudoor – MSS Detection [MSS URL Detection] Backdoor.Moudoor Command and Control Communications Backdoor.Moudoor – Vendor Detection Symantec SEP\/AV - Backdoor.Moudoor Trojan.Naid – MSS Detection [MSS URL Detection] Possible Trojan.Naid HTTP Request (Vector: CVE-2013-1493) [MSS URL Detection] Trojan.Naid Malware Callbacks Trojan.Naid – Vendor Detection Symantec SEP\/AV - Trojan.Naid Trojan.Hydraq – MSS Detection MSS Hot IP Detection - Possible Trojan.Hydraq Traffic MSS Hot IP Detection - Trojan.Hydraq C&C Server MSS Hot IP Detection - Trojan.Hydraq Data Exfiltration Site MSS Hot IP Detection - Trojan.Hydraq Traffic Trojan.Hydraq – Vendor Detection SSIM - Possible Hydraq Activity Symantec SEP\/AV - Trojan.Hydraq Snort\/SourceFire - Trojan.Hydraq - Beaconing activity Trojan.Hikit – MSS Detection [MSS URL Detection] Backdoor.Hikit Command and Control Communications Trojan.Hikit – Vendor Detection Symantec SEP\/AV - Trojan.Ascesso Backdoor.Vasport – MSS Detection [MSS URL Detection] Backdoor.Vasport Command and Control Communications Backdoor.Vasport – Vendor Detection Symantec SEP\/AV - Backdoor.Vasport Backdoor.Boda - MSS Detection [MSS URL Detection] Possible Backdoor.Boda (“LadyBoyle”) Request to Command and Control Backdoor.Boda – Vendor Detection Snort\/SourceFire - ET CURRENT_EVENTS Adobe Flash Zero Day LadyBoyle Infection Campaign Symantec Endpoint Protection (SEP) IPS Signatures: CVE-2011-3544: Web Attack: Oracle Java Rhino Script Engine CVE-2011-3544 3 detected Web Attack: Oracle Java Rhino Script Engine CVE-2011-3544 attack blocked CVE-2012-1875: Web Attack: MSIE Same ID Property CVE-2012-1875 attack blocked CVE-2012-1889: Web Attack: MSIE MSXML CVE-2012-1889 2 attack blocked Web Attack: MSIE MSXML CVE-2012-1889 3 detected Web Attack: MSIE MSXML CVE-2012-1889 detected CVE-2012-1723: Web Attack: Java CVE-2012-1723 RCE 2 detected Web Attack: Java CVE-2012-1723 RCE attack blocked Web Attack: Oracle Java SE CVE-2012-1723 Remote Code Execution Vulnerability 3 attack blocked Web Attack: Oracle Java Type Confusion Attack CVE-2012-1723 4 detected CVE-2013-1493: Web Attack: Java CVE-2013-1493 RCE 2 attack blocked Web Attack: Java CVE-2013-1493 RCE attack blocked McAfee AV: Viral Signatures: CVE-2012-1723: Java\/CVE-2012-1723 Java\/CVE-2012-1723!jar Java\/CVE-2012-1723.CSU MITIGATION STRATEGIES AND RECOMMENDATIONS: Symantec recommends customers use a layered approach to securing their environment, utilizing the latest Symantec technologies, including Enterprise-Wide security monitoring from Edge to Endpoint. For technologies not monitored\/managed by MSS, ensure all signatures are up to date, including endpoint technologies. Ensure all operating systems and public facing machines have the latest security patches, and antivirus software and definitions up to date. Ensure systems have a running firewall, unnecessary ports are closed\/blocked, and unused services are disabled. Ensure staff is educated on Social Engineering and Phishing techniques. WHAT TO EXPECT FROM MSS: Symantec MSS SOC security analysts will continue to diligently monitor, analyse, and validate any events indicative of Hidden Lynx activity: Possible or suspect activity may be notified at a lower severity MSS will continue to perform ongoing refinement of detection MSS will continue to reach out to clients that may have had historical indicators of compromise unveiled due to new data REFERENCES Backdoor.Moudoor http:\/\/www.symantec.com\/security_response\/writeup.jsp?docid=2012-100817-2451-99 Trojan.Naid http:\/\/www.symantec.com\/security_response\/writeup.jsp?docid=2012-061518-4639-99 Trojan.Hydraq http:\/\/www.symantec.com\/security_response\/writeup.jsp?docid=2010-011114-1830-99 Trojan.Hikit http:\/\/www.symantec.com\/security_response\/writeup.jsp?docid=2012-082113-5541-99 Backdoor.Vasport http:\/\/www.symantec.com\/security_response\/writeup.jsp?docid=2012-051606-5938-99 Hidden Lynx – Professional Hackers for Hire http:\/\/www.symantec.com\/connect\/blogs\/hidden-lynx-professional-hackers-hire CVE-2012-1875 Exploited in the Wild - Part 1 (Trojan.Naid) http:\/\/www.symantec.com\/connect\/blogs\/cve-2012-1875-exploited-wild-part-1-trojannaid Backdoor.Hikit: New Advanced Persistent Threat http:\/\/www.symantec.com\/connect\/blogs\/backdoorhikit-new-advanced-persistent-threat Latest Java Zero-Day Shares Connections with Bit9 Security Incident http:\/\/www.symantec.com\/connect\/blogs\/latest-java-zero-day-shares-connections-bit9-security-incident Adobe Zero-day Used in LadyBoyle Attack http:\/\/www.symantec.com\/connect\/blogs\/aobe-zero-day-used-ladyboyle-attack Hydraq - An Attack of Mythical Proportions http:\/\/www.symantec.com\/connect\/blogs\/hydraq-attack-mythical-proportions The Trojan.Hydraq Incident: Analysis of the Aurora 0-Day Exploit http:\/\/www.symantec.com\/connect\/blogs\/trojanhydraq-incident-analysis-aurora-0-day-exploit The Trojan.Hydraq Incident http:\/\/www.symantec.com\/connect\/blogs\/trojanhydraq-incident Trojan.Hydraq information http:\/\/www.symantec.com\/connect\/blogs\/trojanhydraq-information Bit9 and Our Customers' Security https:\/\/blog.bit9.com\/2013\/02\/08\/bit9-and-our-customers-security\/ Bit9 Security incident update https:\/\/blog.bit9.com\/2013\/02\/25\/bit9-security-incident-update\/ The Voho Campaign: An In Depth Analysis http:\/\/blogs.rsa.com\/wp-content\/uploads\/VOHO_WP_FINAL_READY-FOR-Publication-09242012_AC.pdf 'Aurora' Cyber Attackers Were Really Running Counter-Intelligence http:\/\/www.cio.com\/article\/732122\/_Aurora_Cyber_Attackers_Were_Really_Running_Counter_Intelligence We thank you again for choosing Symantec as your Managed Security Services Provider. Should you have any questions or feedback, please contact your Services Manager, or the Analysis Team can be reached by requesting help via phone, e-mail, or visiting the MSS portal at https:\/\/mss.symantec.com. Global Client Services Team Symantec Managed Security Services https:\/\/mss.symantec.com","url":"https:\/\/www.symantec.com\/connect\/blogs\/hidden-lynx-and-mss-protection"},{"Unnamed: 0":1,"query":"APT1","text":"Hidden Lynx – Professional Hackers for Hire For the past few years, reports have continued to emerge detailing the activities of actors behind various targeted attacks or Advanced Persistent Threats (APTs). Here at Symantec Security Response, we’ve been keeping our eyes on a group that we believe are among the best of breed. We’ve given them the name of Hidden Lynx—after a string that was found in the command and control server communications. This group has a hunger and drive that surpass other well-known groups such as APT1\/Comment Crew. Key characteristics of this group are: technical prowess agility organized sheer resourcefulness patience These attributes are shown by the relentless campaigns waged against multiple concurrent targets over a sustained period of time. They are the pioneers of the “watering hole” technique used to ambush targets, they have early access to zero-day vulnerabilities, and they have the tenacity and patience of an intelligent hunter to compromise the supply chain to get at the true target. These supply chain attacks are carried out by infecting computers at a supplier of an intended target and then waiting for the infected computers to be installed and call home, clearly these are cool calculated actions rather than impulsive forays of amateurs. This group doesn’t just limit itself to a handful of targets; instead it targets hundreds of different organizations in many different regions, even concurrently. Given the breadth and number of targets and regions involved, we infer that this group is most likely a professional hacker-for-hire operation that are contracted by clients to provide information. They steal on demand, whatever their clients are interested in, hence the wide variety and range of targets. We also believe that to carry out attacks of this scale, the group must have considerable hacking expertise at its disposal, perhaps 50 to 100 operatives are employed and organized into at least two distinct teams both tasked with carrying out different activities using different tools and techniques. These types of attacks require time and effort to carry out, some of the campaigns require research and intelligence gathering before any successful attacks can be mounted. At the front line of this group is a team that uses disposable tools along with basic but effective techniques to attack many different targets. They may also act as intelligence collectors too. This team we call Team Moudoor after the name of the Trojan that they use. Moudoor is a back door Trojan that the team uses liberally without worry about discovery by security firms. The other team acts like a special operations unit, elite personnel used to crack the most valuable or toughest targets. The elite team uses a Trojan named Naid and are therefore referred to as Team Naid. Unlike Moudoor, the Naid Trojan is used sparingly and with care to avoid detection and capture, like a secret weapon that is only used when failure is not an option. Since 2011, we have observed at least six significant campaigns by this group. The most notable of these campaigns is the VOHO attack campaign of June, 2012. What was particularly interesting about this attack was the use of the watering hole attack technique and the compromise of Bit9’s trusted file signing infrastructure. The VOHO campaign was ultimately targeting US defense contractors whose systems were protected by Bit9’s trust-based protection software but when the Hidden Lynx attackers’ progress was blocked by this obstacle, they reconsidered their options and found that the best way around the protection was to compromise the heart of the protection system itself and subvert it for their own purpose. This is exactly what they did when they diverted their attention to Bit9 and breached their systems. Once breached, the attackers quickly found their way into the file signing infrastructure that was the foundation of the Bit9 protection model, they then used this system to sign a number of malware files and then these files were used in turn to compromise the true intended targets. For those interested in more in-depth information, we have published a whitepaper that describes the group and the attack campaigns carried out by them. We have also put together an infographic that summarizes the key information about this prolific Hidden Lynx group.","url":"https:\/\/www.symantec.com\/connect\/blogs\/hidden-lynx-professional-hackers-hire"},{"Unnamed: 0":2,"query":"APT1","text":"Malicious Mandiant Report in Circulation The report, APT1: Exposing One of China's Cyber Espionage Units, published by Mandiant earlier this week has drawn worldwide attention by both the security world and the general public. This interest is due to the conclusion the report has drawn regarding the origin of targeted attacks, using advanced persistent threats (APT), performed by a certain group of attackers dubbed the Comment Crew. You can read Symantec’s response to the report here. Today, Symantec has discovered someone performing targeted attacks is using the report as bait in an attempt to infect those who might be interested in reading it. The email we have come across is in Japanese, but this does not mean there are no emails in other languages spreading in the wild. The email purports to be from someone in the media recommending the report. As you can see in Figure 1, the attachment is made to appear like the actual report with the use of a PDF file and the name of the company as the file name. However, like in many targeted attacks, the email is sent from a free email account and the content of the email uses subpar language. It is obvious to a typical Japanese person reading the email that it was not written by a native speaker. When the fake report, which Symantec detects as Trojan.Pidief, is opened, a blank PDF is shown but in the background exploit code for Adobe Acrobat and Reader Remote Code Execution Vulnerability (CVE-2013-0641) is executed. The PDF file may drop Trojan.Swaylib and Trojan.Dropper, which drops Downloader, if the vulnerbility is successfully exploited. Could the Comment Crew be playing a prank in response to the publication? The truth is we don’t know. Similar tactics have been used in the past, one of which actually involved Symantec. Back in 2011, when we released a whitepaper on another group performing targeted attacks, the attackers took the opportunity to use the publication to infect those interested in reading the paper. They did this by spamming targets with the actual whitepaper along with malware hidden in an archive attachment. If you want to read the actual Mandiant report, or any other for that matter, we advise you to download it directly from the company’s website. The Mandiant download page also provides the hash of the file so that viewers can confirm its authenticity. It is also a good idea to check the hash if you are unsure where you acquired the file from. Update - February, 2013 Initially, this blog stated that the PDF file didn't drop any additional malware. However, after further analysis, it has been found to drop malware in some environments. The blog has been updated to reflect this finding. We have also confirmed that there are multiple variants of the malicious fake report.","url":"https:\/\/www.symantec.com\/connect\/blogs\/malicious-mandiant-report-circulation"},{"Unnamed: 0":3,"query":"APT1","text":"APT1: Additional Comment Crew Indicators of Compromise Mandiant recently released a document containing indicators of compromise (IOCs) related to multiple espionage campaigns by a group known as the Comment Crew. Symantec has been actively tracking this group for six years while maintaining our own database of indicators. From our investigations we have collected thousands of indicators related to Comment Crew. To help increase public awareness, we have decided to release hundreds of additional Comment Crew indicators to those already released. These are indicators that have been seen within the past year. Symantec products already protect against the artifacts related to these indicators and many of these artifacts have already been shared with the security community. You can find these indicators in the following paper: Comment Crew Indicators of Compromise and on Pastebin. Update [February 25, 2013] – Paper now also includes list of associated MD5 hashes.","url":"https:\/\/www.symantec.com\/connect\/blogs\/apt1-additional-comment-crew-indicators-compromise"},{"Unnamed: 0":4,"query":"APT1","text":"APT1: Q&A on Attacks by the Comment Crew Today Mandiant released a detailed report dubbed \"APT1\" which focuses on a prolific cyber espionage campaign by the Comment Crew going back to at least 2006 and targeting a broad range of industries. The report cites the earliest known public reference about APT1 infrastructure as originating from Symantec. We have detected this threat as Backdoor.Wualess since 2006 and have been actively tracking the group behind these attacks. The following Q&A briefly outlines some of the relevant Symantec information around this group: Q: Do Symantec and Norton products protect against threats used by this group? Yes. Symantec confirms protection for attacks associated with the Comment Crew through our antivirus and IPS signatures, as well as STAR malware protection technologies such as our reputation and behavior-based technologies. Symantec.cloud and Symantec Mail Security for Microsoft Exchange also detect the targeted emails used by this group. Q: Has Symantec been aware of the activities of the Comment Crew? Yes. Symantec has been actively tracking the work of the Comment Crew for a period of time to ensure that the best possible protection is in place for the different threats used by this group. Q: Why are they called the Comment Crew? They were dubbed the Comment Crew due to their use of HTML comments to hide communication to the command-and-control servers. Q: How does a victim get infected? The initial compromise occurs through a spear phishing email sent to the target. The email contains an attachment using a theme relevant to the target. Some recent examples used by this group and blocked by Symantec technologies are listed here: U.S. Stocks Reverse Loss as Consumer Staples, Energy Gain.zip Instruction_of_KC-135_share_space.doc New contact sheet of the AN-UYQ-100 contractors.pdf U.S. Department of Commerce Preliminarily Determines Chinese and Vietnamese Illegally Dumped Wind Towers in the United States.doc ArmyPlansConferenceOnNewGCVSolicitation.pdf Chinese Oil Executive Learning From Experience.doc My Eight-year In Bank Of America.pdf Similar to what Symantec indicated in a recent blog, if the malicious attachment is opened, it attempts to use an exploit against the target victim's system. It drops the malicious payload as well as a clean document to keep the ruse going. Q: Does Symantec know who this group is targeting? Yes. Symantec telemetry has identified many different industries being targeted by this group including Finance, Information Technology, Aerospace, Energy, Telecommunications, Manufacturing, Transportation, Media, and Public Services. The following Figure shows a worldwide heatmap for detections related to this group since the beginning of 2012. Q: Currently, what are the most prevalent threats being used by this group? Symantec, in the last year, has identified the most prevalent threats being used by this group as Trojan.Ecltys, Backdoor.Barkiofork, and Trojan.Downbot. Q: Has Symantec released any publications around these attacks? Yes. We have recently released publications to address techniques and targets of Trojan.Ecltys and Backdoor.Barkiofork, both of which are threats used by this group: Targeted Attacks Make WinHelp Files Not So Helpful Backdoor.Barkiofork Targets Aerospace and Defense Industry We have also investigated associated attacks of this group: The Truth Behind the Shady RAT Q: What are the Symantec detection family names for threats used by this group? Trojan.Ecltys Backdoor.Barkiofork Backdoor.Wakeminap Trojan.Downbot Backdoor.Dalbot Backdoor.Revird Trojan.Badname Backdoor.Wualess Symantec also detects numerous other files used by this group under various detection names: Trojan Horse Downloader Trojan.ADH Trojan.ADH.2 Trojan.Gen Trojan.Gen.2 Hacktool.Mimikatz Spyware.ADH Q: Does Symantec have IPS protection for these threat families? Yes. There are several IPS signatures to catch threat families associated with this group: System Infected: Trojan.Ecltys Activity 2 System Infected: Barkiofork Malware Activity System Infected: Shady Trojan Activity System Infected: Dalbot Backdoor Activity Q: How will this report affect the Comment Crew operations? Despite the exposure of the Comment Crew, Symantec believes they will continue their activities. We will continue to monitor activities and provide protection against these attacks. We advise customers to use the latest Symantec technologies and incorporate layered defenses to best protect against attacks by groups like the Comment Crew.","url":"https:\/\/www.symantec.com\/connect\/blogs\/apt1-qa-attacks-comment-crew"}]