[{"Unnamed: 0":0,"query":"APT10","text":"Introduction\nIn April 2017, a previously unknown group calling itself IntrusionTruth began releasing blog posts detailing individuals believed to be associated with major Chinese intrusion campaigns. Although the group’s exact motives remain unclear, its initial tranche of information exposed individuals connected to long-running GOTHIC PANDA (APT3) operations, culminating in a connection to the Chinese firm Boyusec (博御信息) and, ultimately, Chinese Ministry of State Security (MSS) entities in Guangzhou.\nRecently, in July and August 2018, IntrusionTruth has returned with new reporting regarding actors with ties to historic STONE PANDA (APT10) activity and has ultimately associated them with the MSS Tianjin Bureau (天津市国家安全局). Though CrowdStrike® Falcon Intelligence™ is currently unable to confirm all of the details provided in these most recent posts with a high degree of confidence, several key pieces of information can be verified.\n\nSeveral of the named individuals have been active registering domains as recently as June 2018, and they responded to the IntrusionTruth blog posts by scrubbing their social media or by following IntrusionTruth’s Twitter account.\nNamed individuals ZHANG Shilong and GAO Qiang have significant connections to known Chinese hacking forums, and they have sourced tools currently in use by China-based cyber adversaries. \nZHANG has registered several sites with overlapping registrant details that show both his affiliation with several physical technology firm addresses as well as his residence in Tianjin. \nNamed firm Huaying Haitai has been connected to a Chinese Ministry of Industry and Information Technology (MIIT) sponsored attack and defense competition; this is similar to GOTHIC PANDA’s ties to an active defense lab sponsored by China Information Technology Evaluation Center (CNITSEC).\nHuaying Haitai has previously hired Chinese students with Japanese language skills; this is significant, as STONE PANDA has engaged in several campaigns targeting Japanese firms. \nThe MSS Tianjin Bureau is confirmed to be located at the described address, not far from many of the registrant addresses listed by ZHANG as well the firms GAO was likely recruiting for. \n\nMore details that may further illuminate these findings and provide a higher confidence in connecting STONE PANDA to the MSS Tianjin Bureau are likely to emerge.\nBackground\nThroughout May 2017, using a variety of historical information and open-source intelligence (OSINT), IntrusionTruth released several blog posts identifying several individuals connected to Boyusec. Though CrowdStrike Intelligence had suspected GOTHIC PANDA was an MSS contractor for several years, the IntrusionTruth posts and subsequent research by RecordedFuture into MSS ties to the China Information Technology Evaluation Center (CNITSEC\/中国信息安全测评中心) corroborated additional details from various sources and provided a higher degree of confidence. Confidence in these findings was further boosted when the U.S. Department of Justice named Boyusec and several of the described individuals in an indictment, and detailed GOTHIC PANDA tactics, techniques, and procedures (TTPs) in detail.\nCrowdStrike Falcon Intelligence was able to independently verify the majority of this information and concluded that not only is CNITSEC associated with the MSS, but its former director WU Shizhong (吴世忠) was simultaneously dual-hatted as the director of the MSS Technology\/13th Bureau (国家安全部科技局局长)1 2 3,  implying that the MSS plays a crucial role in China’s code review of foreign products and is now able to cherry pick high-value vulnerabilities from its own capable domestic bug hunting teams. CNITSEC’s role in code review for foreign entities has led to its access to Microsoft’s source code dating back to 2003 and the use by KRYPTONITE PANDA of a high-value vulnerability (CVE-2018-0802), discovered by Chinese firm Qihoo 360, a month before it was publicly revealed.\nWU Shizhong Presenting on the “Digital Silk Road” at the Second Wuzhen World Internet Conference in 2015\nAs research into the IntrusionTruth leads on STONE PANDA continues, Falcon Intelligence has already observed some consistencies with known MSS operations.\nSinking Like a STONE   \nGAO Qiang (高\/郜 强)\nMany of the personal details for GAO were scrubbed shortly after IntrusionTruth’s post introducing him went live, including his Tencent QQ account. The blog connects him to the moniker fisherxp via an initial spear-phishing campaign from 2010 previously attributed to STONE PANDA. Multiple sites with profile pictures appear to show the owner of the fisherxp accounts, though this has yet to be independently confirmed as GAO. Fisherxp’s QQ shows his alternate username as 肥猪 or “big porker”. IntrusionTruth later links GAO to several documented Uber rides to the MSS Tianjin Bureau’s office address where both his first name, Qiang\/强, and 猪 are used by the app to identify him and tie him to the QQ number 420192. CrowdStrike cannot confirm the validity of these Uber receipts at this time.\nHowever, fisherxp’s account on popular Chinese technology forum 51CTO is still active and shows that he has downloaded not only the open-source DarkComet RAT and numerous password cracking tools, but more importantly, several favorite tools used by a plethora of known Chinese cyber adversaries including Gh0st RAT 3.6, zxarps (an ARP-spoofing tool by legacy hacker LZX), and lcx.exe (a port-forwarding tool by legacy hacker LCX)4.\nZHANG Shilong (张世龙)\nZHANG was originally introduced by IntrusionTruth as a reciprocal follower of fisherxp’s Twitter account via his own @baobeilong account. Baobeilong (宝贝龙\/”Baby Dragon”) also maintained a GitHub account that had forked both the Quasar and Trochilus RATs, two open-source tools historically used by STONE PANDA, but the account has since been scrubbed. This information was verified by CrowdStrike before being removed completely. Falcon Intelligence recently independently conducted detailed analysis of the RedLeaves malware used to target numerous Japanese defense groups and found it was directly sourced from Trochilus code, but it has undergone several evolutions and contains prefixes suggesting it could also be used to target Russia and the DPRK. There is no conclusive evidence at this time that RedLeaves is solely attributed to STONE PANDA. \nBaobeilong did maintain a Flickr account with numerous pictures that proved key in identifying his location later, similar to how cpyy’s photos helped identify his affiliation to the People’s Liberation Army (PLA) in CrowdStrike’s PUTTER PANDA report.\nIntrusionTruth then drew connections from baobeilong’s other online accounts to registrant details for xiaohong[.]org, which dated back to 2007 and revealed ZHANG’s full name—ZHANG Shilong. From there, a trail of overlapping registrant details reveals ZHANG’s hanzi characters for his name (张世龙), likely one of his personal home addresses, potential work addresses and several email addresses:\n\nlong@xiaohong[.]org\nbaobei@xiaohong[.]org\natreexp@yahoo[.]com.cn \nrobin4700@foxmail[.]com\neshilong@vip.qq[.]com   \n\nSpecifically tracing registrant details from atreexp → robin4700 → eshilong shows that ZHANG was active registering sites as recently as June 5, 2018, including a personal blog where his picture and name features prominently along with several technology-related blog posts.  \nA picture from baobeilong’s Flickr account shows a fire at the Tianjin Medical Center 120\nLaoying Baichen Instruments\nThe original blog post on GAO lists his contact information in recruitment postings for two separate companies, one of which is Laoying Baichen Instruments (characters unknown at the time of this writing). No records could be found for such a firm, however, IntrusionTruth lists the address associated with it as Room 1102, Guanfu Mansion, 46 Xinkai Road, Hedong District, Tianjin (天津市河东区新开路46号冠福大厦1102). \nDuring the course of investigating Laoying and the Guanfu mansion, Falcon Intelligence noticed that the Guanfu Mansion is also the registered address of a firm called Tianjin Henglide Technology Co., Ltd. (恒利德天津科技有限公司), which is listed as one of only a few “review centers” certified by CNITSEC in Tianjin5. Laoying and Henglide are listed as being on different floors, however having a CNITSEC review center in the same building is noteworthy given CNITSEC’s connection to MSS and previous linkage to Boyusec\/GOTHIC PANDA.\nZhang is believed to have taken the photo of the fire from the Wanchan Meizhuan Mansion. This is relatively close to both the Yuyang Complex (one of Zhang’s listed registrant addresses) and the Guanfu Mansion, Laoying Baichen’s listed address.\nTianjin Huaying Haitai Science and Technology Development Company \nThe other firm GAO appears to have been recruiting for is Huaying Haitai (天津华盈海泰科技发展有限公司). As the IntrusionTruth blog post mentions, it is a registered firm with two listed representatives, Fang Ting (方亭) and Sun Lei (孙杰), and a listed address of 1906 Fuyu Mansion (天津市河西区解放南路中段西侧富裕大厦1-1906). \nSearches for more information on Huaying Haitai turned up two interesting government documents. One is a recruitment Excel sheet detailing recent graduates, their majors and their new employers and addresses. Huaying Haitai is listed as having hired a recently graduated female student from Nankai University in 2013 who majored in Japanese. This is interesting considering STONE PANDA’s extensive targeting of Japanese defense firms after this time period, but it is by no means conclusive evidence that the firm is connected to STONE PANDA.\n\nThe second government document lists Huaying Haitai as the co-organizer of a Network Security Attack and Defense competition with the Ministry of Industry and Information Technology’s (MIIT) national training entity, NSACE6. It was open for all students of Henan Province. \nNSACE appears to be a national education body that teaches network information security, including offensive activity7. This information is particularly interesting given Boyusec’s previous work at CNITSEC’s Guangdong subsidiary setting up a joint active defense lab8.  It suggests that these technology firms act as both shell companies and recruitment grounds for potential MSS use in cyber operations.\n\nMSS Tianjin Bureau\nThe most recent IntrusionTruth post assesses that GAO’s Uber rides frequently took him from Huaying’s address at the Fuyu Mansion to 85 Zhujiang Road (珠江道85号). \n\nWhen observed closely, the compound is a striking one complete with towers, a fenced perimeter with surveillance cameras, guarded entrances, and a building with a significant number of satellite dishes.\n\nThere are no markers on the building and no government listed address; however, it is apparently difficult for locals to determine where the Tianjin Bureau’s location is as well. There are several Baidu questions asking what transportation routes are best to get to that specific address. Three separate ones specifically mention the 85 Zhujiang Road address as the headquarters for the MSS’s Tianjin Bureau and the difficulty in finding its location9 10 11.\n\nAs with most cyber-enabled operations, satellite arrays are often indicative of installations with significant signals intelligence (SIGINT) capabilities. The Tianjin Bureau appears to have the potential for such capabilities, housing several large arrays that appear to have existed since at least January 2004.\nBarely visible satellite dishes from the street view of 85 Zhujiang Road outside the compound\nConclusion\nThere are still significant intelligence gaps that prevent Falcon Intelligence from making an assessment about STONE PANDA’s potential connections to the MSS Tianjin Bureau with a high degree of confidence. However, additional information is likely to materialize either directly from IntrusionTruth or from other firms in the infosec community who are undoubtedly looking at this material as well and may have unique insight of their own. Ultimately, IntrusionTruth’s prior releases on GOTHIC PANDA proved accurate and led to a U.S. Department of Justice indictment resulting in the dismantling of Boyusec. From their latest post, which contains GAO’s Uber receipts, it is clear the group’s information likely goes beyond merely available OSINT data. \nIt cannot be ignored that there are striking similarities between the entities associated with GOTHIC PANDA and the actors and firms mentioned in the blogs about STONE PANDA. In addition, FalconIntelligence notes that following the late 2015 Sino-U.S. brief cyber detente, much of the responsibility for western cyber intrusion operations was handed to the MSS as the PLA underwent an extensive reform that is still currently underway, and which is consolidating its military cyber forces under the Strategic Support Force. \nThough the detente saw an initial drop in Chinese intrusion activity, it has steadily been increasing over the past several years, with a majority of the intrusions into western firms being conducted by suspected contractors. These adversaries are tracked by CrowdStrike as GOTHIC PANDA, STONE PANDA, WICKED PANDA, JUDGMENT PANDA, and KRYPTONITE PANDA. Many of these adversaries have begun targeting supply chain and upstream providers to establish a potential platform for future operations and enable the collection of larger sets of data.\nWhile the APT1, PUTTER PANDA, and Operation CameraShy reports all exposed PLA units at a time when Chinese military hacking against western firms was rampant, the attention has now swung toward identifying MSS contractors. The exposure of STONE PANDA as an MSS contractor would be another blow to China’s current cyber operations given STONE PANDA’s prolific targeting of a variety of sectors, and may prompt an additional U.S. investigation at a tenuous time for Sino-U.S. relations during an ongoing trade war. However, it is important to note that such public revelations often force these actors to cease operations, improve their operational security (OPSEC), and then return stronger than before. As such, CrowdStrike Falcon Intelligence assesses that although Boyusec may have shuttered, elements of GOTHIC PANDA are likely to still be active. The same is likely to be true for STONE PANDA following a period of silence.   \nThe activities of STONE PANDA impact entities in the Aerospace & Defense, Government,  Healthcare, Technology,  Telecommunications Services of several nations. \nFor more information on how to incorporate intelligence on threat actors like STONE PANDA into your security strategy, please visit the Falcon Intelligence product page.\nFootnotes\n\nhttp:\/\/kjbz.mca.gov[.]cn\/article\/mzbzhzcwj\/201106\/20110600157934.shtml\nhttp:\/\/bjgwql[.]com\/a\/hezuojiaoliu\/2011\/0422\/288.htm\nhttp:\/\/alumni.ecnu.edu[.]cn\/s\/328\/t\/528\/3b\/02\/info80642.htm\nhttp:\/\/down.51cto[.]com\/424761\/down\/1\/\nhttp:\/\/www.djbh[.]net\/webdev\/web\/LevelTestOrgAction.do?p=nlbdLv3&id=402885cb35d11a540135d168e41e000c\nhttp:\/\/rjzyjsxy.zzia.edu[.]cn\/picture\/article\/25\/27\/01\/6c8b24a143f9959a85301d4527f0\/801f81cf-8f30-4aa4-8428-7f9d4e778e76.doc\nhttp:\/\/www.yingjiesheng[.]com\/job-001-607-536.html\nhttps:\/\/www.recordedfuture.com\/chinese-mss-behind-apt3\/\nhttps:\/\/zhidao.baidu[.]com\/question\/1046720364336588899.html?fr=iks&word=%CC%EC%BD%F2%CA%D0%D6%E9%BD%AD%B5%C085%BA%C5%CA%C7%CA%B2%C3%B4%B5%A5%CE%BB%C2%EF&ie=gbk\nhttps:\/\/zhidao.baidu[.]com\/question\/146035392.html?fr=iks&word=%CC%EC%BD%F2%CA%D0%D6%E9%BD%AD%B5%C085%BA%C5%CA%C7%CA%B2%C3%B4%B5%A5%CE%BB%C2%EF&ie=gbk\nhttps:\/\/zhidao.baidu[.]com\/question\/223614321.html?fr=iks&word=%CC%EC%BD%F2%CA%D0%D6%E9%BD%AD%B5%C085%BA%C5%CA%C7%CA%B2%C3%B4%B5%A5%CE%BB%C2%EF&ie=gbk","url":"https:\/\/www.crowdstrike.com\/blog\/two-birds-one-stone-panda\/"},{"Unnamed: 0":0,"query":"APT10","text":"APT10 Background  APT10 (MenuPass Group) is a Chinese cyber espionage group that FireEye has tracked since 2009. They have historically targeted construction and engineering, aerospace, and telecom firms, and governments in the United States, Europe, and Japan. We believe that the targeting of these industries has been in support of Chinese national security goals, including acquiring valuable military and intelligence information as well as the theft of confidential business data to support Chinese corporations. PwC and BAE recently issued a joint blog detailing extensive APT10 activity.  APT10’s Resurgence  In June 2016, FireEye iSIGHT intelligence first reported that APT10 expanded their operations. The group was initially detected targeting a Japanese university, and more widespread targeting in Japan was subsequently uncovered. Further collaboration between FireEye as a Service (FaaS), Mandiant and FireEye iSIGHT intelligence uncovered additional victims worldwide, a new suite of tools and novel techniques.  Global Targeting Using New Tools  Leveraging its global footprint, FireEye has detected APT10 activity across six continents in 2016 and 2017. APT10 has targeted or compromised manufacturing companies in India, Japan and Northern Europe; a mining company in South America; and multiple IT service providers worldwide. We believe these companies are a mix of final targets and organizations that could provide a foothold in a final target.  APT10 unveiled new tools in its 2016\/2017 activity. In addition to the continued use of SOGU, the current wave of intrusions has involved new tools we believe are unique to APT10. HAYMAKER and SNUGRIDE have been used as first stage backdoors, while BUGJUICE and a customized version of the open source QUASARRAT have been used as second stage backdoors. These new pieces of malware show that APT10 is devoting resources to capability development and innovation.   HAYMAKER is a backdoor that can download and execute additional payloads in the form of modules. It also conducts basic victim profiling activity, collecting the computer name, running process IDs, %TEMP% directory path and version of Internet Explorer. It communicates encoded system information to a single hard coded command and control (C2) server, using the system’s default User-Agent string.  BUGJUICE is a backdoor that is executed by launching a benign file and then hijacking the search order to load a malicious dll into it. That malicious dll then loads encrypted shellcode from the binary, which is decrypted and runs the final BUGJUICE payload. BUGJUICE defaults to TCP using a custom binary protocol to communicate with the C2, but can also use HTTP and HTTPs if directed by the C2. It has the capability to find files, enumerate drives, exfiltrate data, take screenshots and provide a reverse shell.  SNUGRIDE is a backdoor that communicates with its C2 server through HTTP requests. Messages are encrypted using AES with a static key. The malware’s capabilities include taking a system survey, access to the filesystem, executing commands and a reverse shell. Persistence is maintained through a Run registry key.  QUASARRAT is an open-source RAT available here . The versions used by APT10 (1.3.4.0, 2.0.0.0, and 2.0.0.1) are not available via the public GitHub page, indicating that APT10 has further customized the open source version. The 2.0 versions require a dropper to decipher and launch the AES encrypted QUASARRAT payload. QUASARRAT is a fully functional .NET backdoor that has been used by multiple cyber espionage groups in the past.   Traditional and Novel Methods  This recent APT10 activity has included both traditional spear phishing and access to victim’s networks through service providers. (For more information on infection via service providers see M-Trends 2016 ). APT10 spear phishes have been relatively unsophisticated, leveraging .lnk files within archives, files with double extensions (e.g. “[Redacted]_Group_Meeting_Document_20170222_doc_.exe) and in some cases simply identically named decoy documents and malicious launchers within the same archive.  In addition to the spear phishes, FireEye ISIGHT Intelligence has observed APT10 accessing victims through global service providers. Service providers have significant access to customer networks, enabling an attacker who had compromised a service provider to move laterally into the network of the service provider’s customer. In addition, web traffic between a service provider’s customer and a service provider is likely to be viewed as benign by network defenders at the customer, allowing the attacker to exfiltrate data stealthily. A notable instance of this observed by FireEye involved a SOGU backdoor that was set to communicate with its C2 through a server belonging to the victim’s service provider.  APT10 actors issued the following commands to a SOGU implant at a victim:   sc create CorWrTool binPath= \"\\\"C:\\Windows\\vss\\vixDiskMountServer.exe\\\"\" start= auto displayname= \"Corel Writing Tools Utility\" type= own  sc description CorWrTool \"Corel Graphics Corporation Applications.\"  ping -a [Redacted]  psexec.exe <orghost> d.exe  net view \/domain:[Redacted]  proxyconnect - \"port\": 3389, \"server\": \"[IP Address Redacted]\"   These commands included setting persistence on the victim’s system. The actor then tested connectivity to an IP managed by the victim’s service provider. Once connectivity to the service provider IP was verified, the actor established the service provider IP as a proxy for the victim’s SOGU backdoor. This effectively routes SOGU malware traffic through the victim’s service provider, which likely indicates a foothold on the service provider’s network. The tactic also serves to mask malicious C2 and exfiltration traffic and make it appear innocuous.  Implications  APT10 is a threat to organizations worldwide. Their abuse of access to service provider networks demonstrates that peripheral organizations continue to be of interest to a malicious actor – especially those seeking alternative angles of attack. We believe the pace of APT10 operations may slow following the public disclosure by the PwC\/BAE blog ; however, we believe they will return to their large-scale operations, potentially employing new tactics, techniques and procedures.","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2017\/04\/apt10_menupass_grou.html"},{"Unnamed: 0":1,"query":"APT10","text":"Introduction  In July 2018, FireEye devices detected and blocked what appears to be APT10 (Menupass) activity targeting the Japanese media sector. APT10 is a Chinese cyber espionage group that FireEye has tracked since 2009, and they have a history of targeting Japanese entities .  In this campaign, the group sent spear phishing emails containing malicious documents that led to the installation of the UPPERCUT backdoor. This backdoor is well-known in the security community as ANEL , and it used to come in beta or RC (release candidate) until recently. Part of this blog post will discuss the updates and differences we have observed across multiple versions of this backdoor.  Attack Overview  The attack starts with Microsoft Word documents containing a malicious VBA macro being attached to spear phishing emails. Although the contents of the malicious documents are unreadable (see Figure 3), the Japanese titles are related to maritime, diplomatic, and North Korean issues. Table 1 shows the UPPERCUT indicators of compromise (IoCs).   File Name   MD5   Size   C2   自民党海洋総合戦略小委員会が政府に提言申し入れ.doc  Government Recommendations from the Liberal Democratic Party’s Comprehensive Strategic Maritime Subcommittee   4f83c01e8f7507d23c67ab085bf79e97   843022   eservake.jetos[.]com  82.221.100.52  151.106.53.147   グテマラ大使講演会案内状.doc  Invitation to Lecture by Guatemalan Ambassador   f188936d2c8423cf064d6b8160769f21   720384     eservake.jetos[.]com  151.106.53.147  153.92.210.208   米国接近に揺れる北朝鮮内部.doc  North Korean interior swayed by the approach of the United States   cca227f70a64e1e7fcf5bccdc6cc25dd   733184   eservake.jetos[.]com  153.92.210.208  167.99.121.203    Table 1: UPPERCUT IoCs  For the North Korean lure, a news article with an identical title was readily available online . It’s also worth noting that in the Guatemalan lure, the attacker used an unusual spelling of Guatemala in Japanese. The top result of a Google search using the same spelling led us to the event website for the lecture of the Guatemalan Ambassador, held in August 2018. Figure 1 shows the screenshot of the event page.   Figure 1: Event Website for the Lecture of Guatemala Ambassador  Figure 2 shows the macro function that displays the lure document. At the bottom of this function, we can see the readable text that matches the contact information found in Figure 1. Thus, people who would have an interest in Latin American issues may have been the targets of this campaign.   Figure 2: Macro to display lure document  The initial Word documents were password protected, likely in an effort to bypass detection. Once the password (delivered in the body of the email) is entered, the users are presented with a document that will request users to enable the malicious macro, as shown in Figure 3.   Figure 3: Lure document  Figure 4 shows what happens when the malicious macro is executed.   Figure 4: Macro to install UPPERCUT  The execution workflow is as follows:  1.     The macro drops three PEM files, padre1.txt, padre2.txt, and padre3.txt, to the victim’s %TEMP% folder and then copies them from %TEMP% to the %AllUserProfile% folder.  2.     The macro decodes the dropped files using Windows certutil.exe with the following commands (certutil.exe is a legitimate built-in command-line program to manage certificates in Windows):   C:\\Windows\\System32\\cmd.exe\" \/c certutil -decode C:\\ProgramData\\padre1.txt C:\\ProgramData\\\\GUP.txt   C:\\Windows\\System32\\cmd.exe\" \/c certutil -decode C:\\ProgramData\\padre2.txt C:\\ProgramData\\\\libcurl.txt   C:\\Windows\\System32\\cmd.exe\" \/c certutil -decode C:\\ProgramData\\padre3.txt C:\\ProgramData\\\\3F2E3AB9    3.     The macro creates a copy of the files with their proper extensions using Extensible Storage Engine Utilities (esentutil.exe) with the following commands (esentutil.exe is also a legitimate program that is pre-installed in Windows):   C:\\Windows\\System32\\esentutl.exe\" \/y C:\\ProgramData\\\\GUP.txt \/d C:\\ProgramData\\GUP.exe \/o   C:\\Windows\\System32\\esentutl.exe\" \/y C:\\ProgramData\\\\libcurl.txt \/d C:\\ProgramData\\libcurl.dll \/o    The dropped files include the following:   GUP.exe : GUP, a free (LGPL) Generic Updater. GUP is an open source binary used by Notepad++ for software updates. The version used here is version 4.1 digitally signed by Notepad++, as shown in Figure 5.  libcurl.dll: Malicious Loader DLL  3F2E3AB9: Encrypted shellcode    Figure 5: Notepad++ signed updater  4.     The macro launches the legitimate executable GUP.exe.   The executable sideloads the malicious DLL (libcurl.dll), which decrypts and runs shellcode (3F2E3AB9) located in the same folder.  The shellcode decodes and decompresses another DLL, which is an updated variant of UPPERCUT. Before decoding the DLL, the shellcode uses an anti-debug technique based on ntdll_NtSetInformationThread which causes the thread to be detached from the debugger, as shown in Figure 6 . The DLL is then loaded into memory and the randomly named exported function is called.    Figure 6: Anti-debug technique used by shellcode  5.     The macro deletes the initially dropped .txt files using Windows esentutl.exe and changes the document text to an embedded message.  The complete attack overview is shown in Figure 7.   Figure 7: Attack overview  Several threat actors leverage the technique of using Windows certutil.exe for payload decoding , and APT10 continues to employ this technique.  Evolution of UPPERCUT  Figure 8 shows the timeline of updates for UPPERCUT. The PE compile time of loaders and the create time of droppers (Word documents) are plotted in the graph. The compile time of loaders in the newer version(s) are not shown here since the timestamps are overwritten and filled with zeroes. We don’t have visibility into UPPERCUT 5.2.x series, but it’s possible that minor revisions were released every few months between December 2017 and May 2018.   Figure 8: Timeline of UPPERCUT updates  Unlike previous versions, the exported function names are randomized in the latest version (Table 2).   Encoded Payload   Decoded Payload   MD5   Size   Import Hash   Exported Function   Version   aa3f303c3319b14b4829fe2faa5999c1   322164   182ee99b4f0803628c30411b1faa9992   l7MF25T96n45qOGWX   5.3.2   126067d634d94c45084cbe1d9873d895   330804   5f45532f947501cf024d84c36e3a19a1   hJvTJcdAU3mNkuvGGq7L   5.4.1   fce54b4886cac5c61eda1e7605483ca3   345812   c1942a0ca397b627019dace26eca78d8   WcuH   5.4.1    Table 2: Static characteristics of UPPERCUT  Another new feature in the latest UPPERCUT sample is that the malware sends an error code in the Cookie header if it fails to receive the HTTP response from the command and control (C2) server. The error code is the value returned by the GetLastError function and sent in the next beacon. This was likely included to help the attackers understand the problem if the backdoor is unable to receive a response (Figure 9). This Cookie header is a unique indicator that can be used for network-based detection.   Figure 9: Example of callback  Earlier versions of UPPERCUT used the hard-coded string “this is the encrypt key” for Blowfish encryption when communicating with a C2. However, in the latest version, the keys are hard-coded uniquely for each C2 address and use the C2’s calculated MD5 hash to determine which key to use, as shown in Figure 10.   Figure 10: Blowfish key generation  For instance, Table 3 lists the hard-coded C2 addresses, their MD5 hash, and the corresponding Blowfish key in the decoded payload of 126067d634d94c45084cbe1d9873d895.   C2   MD5   Blowfish Key   hxxp[:]\/\/151.106.53[.]147\/VxQG   f613846eb5bed227ec1a5f8df7e678d0   bdc4b9f5af9868e028dd0adc10099a4e6656e9f0ad12b2e75a30f5ca0e34489d   hxxp[:]\/\/153.92.210[.]208\/wBNh1   50c60f37922ff2ff8733aaeaa9802da5   fb9f7fb3c709373523ff27824ed6a31d800e275ec5217d8a11024a3dffb577dd   hxxp[:]\/\/eservake.jetos[.]com\/qIDj   c500dae1ca41236830b59f1467ee96c1   d3450966ceb2eba93282aace7d7684380d87c6621bbd3c4f621caa079356004a   Default   Default   f12df6984bb65d18e2561bd017df29ee1cf946efa5e510802005aeee9035dd53    Table 3: Example of Blowfish keys  In this example, the MD5 hash of hxxp[:]\/\/151.106.53[.]147\/VxQG will be f613846eb5bed227ec1a5f8df7e678d0. When the malware interacts with this URL, bdc4b9f5af9868e028dd0adc10099a4e6656e9f0ad12b2e75a30f5ca0e34489d will be selected as a Blowfish key. If the MD5 hash of the URL does not match any of the listed hashes, then the default key f12df6984bb65d18e2561bd017df29ee1cf946efa5e510802005aeee9035dd53 will be used.  Another difference in the network traffic generated from the malware is that the encoded proxy information has been added in the URL query values during the C2 communication. Table 4 shows the parameters sent to C2 server from the backdoor in the newer versions. These are sent via POST request, as shown in Figure 9.   Table 4: URL parameters  Additionally, the command string is hashed using the same RGPH hashing algorithm as before. Two more commands, 0xD290626C85FB1CE3 and 0x409C7A89CFF0A727, are supported in the newer versions (Table 5).   Commands   Description   0x97A168D9697D40DD   Download and validate file (XXHash comparison) from C2 server   0x7CF812296CCC68D5   Upload file to C2 server   0x652CB1CEFF1C0A00   Load PE file   0x27595F1F74B55278   Download, validate (XXHash comparison), execute file, and send output to C2 server   0xD290626C85FB1CE3   Format the current timestamp   0x409C7A89CFF0A727   Capture the desktop screenshot in PNG format and send it to C2   None of the above   The received buffer is executed via cmd.exe and the output is then sent to the C2 server    Table 5: Supported commands  Conclusion  While APT10 consistently targets the same geolocation and industry, the malware they use is actively evolving. In the newer versions of UPPERCUT, there is a significant change in the way backdoor initializes the Blowfish encryption key, which makes it harder for analysts to detect and decrypt the backdoor’s network communications. This shows that APT10 is very capable of maintaining and updating their malware.  To mitigate the threat, users are advised to disable Office macros in their settings and not to open documents from unknown sources. FireEye Multi-Vector Execution (MVX) engine is able to recognize and block this threat with the following detection names:   APT.Backdoor.Win.UPPERCUT  FE_APT_Backdoor_Win32_UPPERCUT","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2018\/09\/apt10-targeting-japanese-corporations-using-updated-ttps.html"},{"Unnamed: 0":0,"query":"APT10","text":"China-linked APT10 Hackers Update Attack Techniques\r\n\nRecently attacks launched by the China-linked threat actor APT10 against the Japanese media sector revealed the use of updated tactics, techniques and procedures (TTPs), FireEye says. \nAlso known as menuPass and Stone Panda, which FireEye has been tracking since 2009, the group has a history of targeting Japanese entities. Last year, the group targeted entities in at least fourteen countries, including the website of a prominent U.S. trade association.\nAs part of the new attacks, spear-phishing emails carrying malicious Word documents that attempt to deliver the UPPERCUT backdoor. Known in the security community as ANEL, the malware was apparently in pre-release form (beta or release candidate) until recently, FireEye’s security researchers say. \nThe documents carry a malicious VBA macro and use Japanese titles related to maritime, diplomatic, and North Korean issues (but have unreadable contents). The documents were password protected, with the password provided in the email body. \nRecent UPPERCUT samples have the timestamps overwritten and filled with zeroes and the security researchers do not have visibility into the UPPERCUT 5.2.x series, but say that minor versions might have been released every few months between December 2017 and May 2018.\nThe latest version also features randomized exported function names and was observed sending an error code in the Cookie header when failing to receive the HTTP response from the command and control (C&C) server. For each C&C address, the malware now has uniquely hard-coded keys it uses for encryption. \nFurthermore, in the generated network traffic, the encoded proxy information has been added in the URL query values during the C&C communication, FireEye said. \nThe commands supported in the new version include: download and validate file; upload file to the C&C; load PE file; download, validate, execute file, and send output to C&C server; format the current timestamp; capture the desktop screenshot in PNG format and send it to C&C; execute received buffer via cmd.exe and send the output to the server. \n“While APT10 consistently targets the same geolocation and industry, the malware they use is actively evolving. In the newer versions of UPPERCUT, there is a significant change in the way backdoor initializes the Blowfish encryption key, which makes it harder for analysts to detect and decrypt the backdoor’s network communications. This shows that APT10 is very capable of maintaining and updating their malware,” FireEye concludes. \nRelated: China-Linked Hackers Target U.S. Trade Group\nRelated: China-based Hackers Target Managed Service Providers","url":"https:\/\/www.securityweek.com\/china-linked-apt10-hackers-update-attack-techniques"},{"Unnamed: 0":1,"query":"APT10","text":"China-Linked Group Uses New Malware in Japan Attacks\r\n\nA China-linked threat actor has been using a new Trojan in attacks aimed at individuals and organizations located in or with ties to Japan, Palo Alto Networks reported on Thursday.\nThe group is known as menuPass, Stone Panda and APT10, and it has been active since at least 2009. The actor initially targeted defense contractors in the United States and elsewhere, and since 2014 it has also attacked organizations in Japan.\nmenuPass is known for using PlugX and PoisonIvy, which have been observed in campaigns launched by several actors. However, a recent menuPass operation, which took place between September and November 2016, involved a new Trojan, dubbed ChChes, that is unique to this group.\nThe recent operation targeted Japanese academics working in various scientific fields, a Japanese pharmaceutical company, and a US-based subsidiary of a Japanese manufacturing firm. The attacks started with spear-phishing emails that came from spoofed addresses, including of the Sasakawa Peace Foundation and the White House.\nOne clue that linked ChChes to other tools used by menuPass was a shared import hash. However, experts also discovered connections in the infrastructure used in the recent and older attacks.\nChChes was disguised as a Word document and it was signed using a certificate from Italian spyware maker Hacking Team. The certificate was leaked when the company was hacked in July 2015, but it had been revoked long before the latest menuPass attacks. Researchers believe attackers may have used it in an effort to make attribution more difficult.\nIn addition to collecting information about the infected system, ChChes has modules that help it encrypt communications, execute shell commands, upload and download files, and load and execute DLLs, according to an analysis conducted by Japan’s Computer Emergency Response Team Coordination Center (JPCERT\/CC).\nPalo Alto Networks believes ChChes is only used to download other malware onto infected computers, especially since it does not have a persistence mechanism.\n“In a successful intrusion, it may be only a first stage tool used by the attackers to orient where they landed in a network, and other malware will be deployed as a second stage layering for persistence and additional access as the attackers move laterally through a network,” researchers said in a blog post.\nRelated: Japan Targeted in \"Blackgear\" Espionage Campaign\nRelated: 18 Million Stolen Credentials Found in Japan\nRelated: \"Dust Storm\" Attackers Target Japanese Critical Infrastructure\nRelated: Blue Termite APT Targets Japanese Organizations","url":"https:\/\/www.securityweek.com\/china-linked-group-uses-new-malware-japan-attacks"},{"Unnamed: 0":2,"query":"APT10","text":"Operation Cloud Hopper: China-based Hackers Target Managed Service Providers\r\n\nOperation Cloud Hopper Targets Managed IT Service Providers and Their Clients\nA widespread campaign known to be targeting managed service providers (MSPs) in at least fourteen countries has been tied to the group known as APT10 and is thought to be operating out of China. These are the conclusions of a new report published this week by PwC UK and BAE Systems. \nAs always with such reports, attribution is down to the weight of circumstantial evidence. The authors detail historical evidence that leads towards APT10, and domain registration timing evidence that suggests operation from within China's timezone. The authors do not suggest that APT10 is state-controlled, but they paint a picture that invites a conclusion that it is at least state-sponsored.\nPart of the historical evidence includes an overlap in malware used in attacks previously attributed to APT10. The group is believed to have primarily used Poison Ivy before switching to PlugX; and used both for a period of about nine months. From around mid-2016 it started to 're-tool' and is now using PlugX, ChChes, Quasar and RedLeaves.\nThere are two big takeaways from this report (PDF): the reality that organizations are still not adequately securing their supply chain; and the potential that the US\/China and UK\/China agreements to curb economic espionage are now defunct.\nThe authors describe a campaign that uses well-researched spear-phishing to first compromise MSPs. From here they obtain legitimate credentials to access the MSPs' client networks that align to APT10's targeting profile -- which the authors claim aligns with China's current five-year plan (FYP) for economic growth.\nOnce on the target network, the attacker moves laterally to locate specific data of interest. This is collected and compressed before being moved back to the MSP and finally sent to a server under the attackers' control. This is a classic supply-chain attack, similar in concept to the iconic Target breach. Organizations are generally getting better at their own security but remain slack over the security of their suppliers -- in this case, their MSPs.\n\"It is fundamental for organizations to come to terms with the fact that raising their own security posture is essential but not sufficient,\" warns Donato Capitella, senior security consultant at MWR InfoSecurity; \"especially if they are then willing to interweave their IT systems with third parties whose security posture is insufficient. Organizations have to mandate higher security standards if they do not want to see all of their security investment undermined by trivial security mistakes on behalf of their partners. At the same time, third parties that can demonstrably step up their security game will become preferred over time and will undoubtedly have a higher chance to win important contacts in the future.?\"\nThe question over whether the US and UK accords with China over economic espionage is now defunct is posed, but not answered by the study. The US and UK are only two of fourteen countries affected, so they are not specifically targeted. It is MSPs in all of those countries that are the targets; and we are not told of any specific client organizations breached. \nThe two accords specify 'economic espionage'; political espionage is still acceptable in both directions. It is perfectly possible, if not likely, that MSPs compromised in America and Britain have not been used for economic gain. Without further information from the authors, we simply do not know.\nIt is likely that the attackers are the group known as APT10, and it is likely that they are based in China -- but unambiguous attribution and motivation is not possible based on this report. \"Overall,\" comments Israel Barak, CISO of Cybereason, \"the notion that China has decreased its efforts since 2015 to conduct economic espionage is preposterous. China is known for using cutouts and sympathetic agents to collect information on their behalf. China, Russia and other nation states frequently outsource wholesale hacking operations to individual groups and companies. In addition to their government services, these companies contract with, and provide services to, other clients. To do otherwise would greatly devalue the plausible deniability that is one of the major benefits of outsourcing. There are many reasons there is an uptick in outsourcing of operations because countries can rapidly expand capabilities in a short period of time, increase plausible deniability of actions, mitigate risk of detection, gain technical expertise that they cannot recruit directly into the government and decrease overall operational costs.\"\nBut whether this indicates the end of the two China accords is a different matter. \"The most significant challenge for investigators in the UK or US is tying digital activity to a person and organization in this massive breach or any breach for that matter. In reality, we live in a world where as more and more state-sponsored activity is being conducted by corporations, attribution gets even more difficult. To reiterate, it is too early in this particular instance to determine whether the Cameron-Xi accord was broken or is it simply a case of competitive intelligence and cybercrime that must be dealt with bilaterally between Great Britain and China.\"","url":"https:\/\/www.securityweek.com\/operation-cloud-hopper-china-based-hackers-target-managed-service-providers"},{"Unnamed: 0":3,"query":"APT10","text":"Poison Ivy RAT Campaign Leverages New Delivery Techniques\r\n\nA recently observed campaign using the Poison Ivy remote access tool (RAT) against individuals within the Mongolian government uses publicly available techniques that haven’t been observed in previous campaigns, FireEye reports.\nThe Poison Ivy backdoor has been around for several years, targeting organizations all around the world, and was associated with a China-linked threat actor known as menuPass, Stone Panda and APT10. The malware packs capabilities such as key logging, screen and video capture, file transfers, password theft, system administration, traffic relaying, and more.\nFireEye didn’t attribute the new campaign to a specific actor, and told SecurityWeek in an email that it can’t make direct connections to a particular group at this time. The security firm said it lacks visibility into what the actors did and admitted it doesn’t know if they were successful. Still, the company did say that “espionage is a reasonable assumption for their motives.”\nWhat the newly observed campaign did show, however, was that the actor behind it is up-to-date with recent social engineering and evasion techniques and isn’t shy when it comes to using them. The attacks leveraged an AppLocker bypass that was publicly revealed last year, as well as fileless execution and persistence, and benign documents to minimize user suspicion of malicious activity.\nThe malware was distributed via Word documents with malicious macros, and the threat actor was using social engineering to trick users into enabling these macros. The malicious documents were delivered via email, claiming to contain instructions for logging into webmail or information regarding a state law proposal, FireEye explains.\nThe malicious macros in the documents were designed to invoke Regsvr32, a command-line utility designed for registering DLLs in the registry, to download a Windows Script Component file (SCT file) by passing the URL of the SCT file as an argument. This technique was demonstrated last year to effectively bypass AppLocker, the Microsoft application whitelisting solution that prevents unknown executables from running on a system.\nIn this campaign, the malicious SCT file was designed to invoke WScript to launch PowerShell in hidden mode with an encoded command, FireEye reports. After the PowerShell command is decoded, another layer of PowerShell instructions emerges, serving two purposes: to download a decoy document from the Internet and open it in a second winword.exe process using the Start-Process cmdlet; and to download and run another PowerShell script named f0921.ps1.\nThe third stage PowerShell script configures an encoded command persistently as base64 string in the HKCU: \\Console\\FontSecurity registry key, along with an HKCU\\CurrentVersion\\Run\\SecurityUpdate value to launch the encoded PowerShell payload stored in the previously configured key. Thus, the PowerShell payload is executed every time the user logs in to the system.\nA fourth stage PowerShell script in the HKCU\\Console\\FontSecurity registry borrows from the publicly available Inject-LocalShellCode script from PowerSploit to inject shellcode, researchers explain. The shellcode has a custom XOR-based decryption loop that uses a single byte key (0xD4), and was designed to inject the Poison Ivy backdoor into userinit.exe. The decrypted shellcode also revealed content and configuration related to Poison Ivy.\n“Although Poison Ivy has been a proven threat for some time, the delivery mechanism for this backdoor uses recent publicly available techniques that differ from previously observed campaigns. Through the use of PowerShell and publicly available security control bypasses and scripts, most steps in the attack are performed exclusively in memory and leave few forensic artifacts on a compromised host,” FireEye says.\nRelated: August Stealer Uses PowerShell for Fileless Infection\nRelated: Windows AppLocker Bypassed to Execute Remote Scripts","url":"https:\/\/www.securityweek.com\/poison-ivy-rat-campaign-leverages-new-delivery-techniques"},{"Unnamed: 0":4,"query":"APT10","text":"China-Linked Hackers Target U.S. Trade Group\r\n\nA threat actor linked to China hijacked the website of a prominent U.S. trade association in an effort to deliver reconnaissance malware to individuals who accessed certain web pages.\nFidelis Cybersecurity published a report detailing the campaign on Thursday, just hours before a meeting between U.S. President Donald Trump and his Chinese counterpart, Xi Jinping.\nThe company noticed in late February that the website of the National Foreign Trade Council (NFTC) had been hacked and set up to serve malware in what is known as a watering hole attack, or a strategic web compromise. Experts believe the attack ended by March 2, when links injected into the NFTC website had been removed.\nEvidence uncovered by investigators led them to believe that the attack was conducted by a China-linked cyber espionage group known as APT10, MenuPass and Stone Panda. Fidelis has dubbed the campaign Operation TradeSecret.\nAccording to researchers, the hackers set up certain web pages of the NFTC website to serve a reconnaissance framework known as Scanbox. The tool has been used for several years, including in attacks aimed at U.S. organizations and the Uyghur population in China.\nScanbox has various plugins that allow attackers to collect information about the infected system and the software installed on it, and log keystrokes from the web browser. The harvested data can then be used to launch further attacks against the targeted individuals.\nIn the case of the NFTC, whose board of directors includes some of the largest private sector companies in the United States, APT10 targeted only specific web pages. One of them was a registration page for a board of directors meeting, which suggests that people or organizations expected to attend the meeting had been targeted.\n“All organizations that have representatives on the board of directors of the NFTC -- or those who would have a reason to visit the site -- should investigate potentially impacted hosts using indicators provided in this report,” warned Fidelis. “Since the reconnaissance tool is typically used to enable future targeting campaigns, it should be assumed that targeted individuals will be subject to further attacks -- such as spearphishing campaigns.”\nThe security firm said it notified the lobbying group of the breach. SecurityWeek has reached out to NFTC for comment and will update this article if the organization responds.\nFidelis also reported seeing a similar campaign involving a fake website of Japan’s Ministry of Foreign Affairs. The APT10 attacks targeting Japan were also detailed in a report published this week by PwC UK and BAE Systems.\nThe research conducted by the two companies focused on attacks launched by APT10 against managed service providers (MSPs) in at least fourteen countries.\nRelated: China-Linked Group Uses New Malware in Japan Attacks\nRelated: Chinese Spying Drops in Volume, Becomes More Focused\nRelated: U.S. Firms Targeted by China Even After Cyber Deal","url":"https:\/\/www.securityweek.com\/china-linked-hackers-target-us-trade-group"},{"Unnamed: 0":5,"query":"APT10","text":"DHS Warns of Attacks on Managed Service Providers\r\n\nThe United States Department of Homeland Security (DHS) this week issued an alert on ongoing activity from an advanced persistent threat (APT) actor targeting global managed service providers (MSPs).\nThe activity, DHS says, involves attempts to infiltrate the networks of global MSPs, which provide remote management of customer IT and end-user systems. \nThe use of MSP increases an organization’s virtual enterprise infrastructure footprint, but also creates a large attack surface for cyber criminals and nation-state actors, DHS’ United States Computer Emergency Readiness Team (US-CERT) points out.\nThe newly released alert, TA18-276B, is related to activity that DHS' National Cybersecurity and Communications Integration Center (NCCIC) warned about in April 2017. \nThe same activity was associated by security firms with a Chinese actor referred to as APT10, but which is also known as menuPass and Stone Panda. The group is believed to be state-sponsored.\nTracked since 2009, the group has historically targeted mainly Japanese entities. Last year, the group was observed targeting entities in at least fourteen countries, including the website of a prominent U.S. trade association.\nThe threat actor is known for the use of a broad range of malware families, including the PlugX RAT, ChChes, Quasar, RedLeaves, the UPPERCUT backdoor, NetTraveler (aka TravNet), and ZeroT.\n“Since May 2016, APT actors have used various tactics, techniques, and procedures (TTPs) for the purposes of cyber espionage and intellectual property theft. APT actors have targeted victims in several U.S. critical infrastructure sectors, including Information Technology (IT), Energy, Healthcare and Public Health, Communications, and Critical Manufacturing,” DHS’ new alert reads. \nDHS’ new technical alert also includes information on the protective measures organizations should take to mitigate the risks associated with their MSP, which could expose them to APT activity. \nThese include restricting access to networks and systems, using a dedicated Virtual Private Network (VPN) for MSP connection, using firewalls, implement best practices for password and permission management, and incorporate operational controls.\nRelated: China-linked APT10 Hackers Update Attack Techniques\nRelated: Operation Cloud Hopper: China-based Hackers Target Managed Service Providers","url":"https:\/\/www.securityweek.com\/dhs-warns-attacks-managed-service-providers"},{"Unnamed: 0":6,"query":"APT10","text":"Don't Fall Victim to IP Theft and Corporate Espionage\r\n\nIf the infamous bank robber, Willie Sutton, were alive today and honed his cyber skills, he might turn his attention to corporate espionage. Why? Because, as he once said about banks, “that’s where the money is.”\nUnlike “traditional cyberespionage” which typically takes place between nation-state actors and is used for political gain or to compromise national security, corporate espionage targets proprietary information from private entities for commercial advantage, although in some cases nation-states will target private entities in industries such as energy given their national importance. Over the past two years, several threat actors have launched corporate espionage campaigns against companies in pharmaceuticals, chemicals and related industries with the aim of profiting from proprietary information such as intellectual property, R&D material on new products and technologies as well as financial information. The actors behind these campaigns are each known by different names, but include “APT10”, “Crouching Yeti”, “FIN4”, “Operation Ghoul”, “Patchwork”, “Poseidon”, “Tick” and “Turla.”\nHow do these threat groups go about these campaigns? Much like Willie Sutton, a master of disguise who would infiltrate banks and stores impersonating a messenger, postal worker, maintenance man or even a police officer, espionage threat actors use spearphishing, watering holes, and malicious software downloads to disguise the initial infection. Once inside the network, they typically use custom backdoor malware to achieve lateral movement, data exfiltration and persistence. To better understand what’s required to mitigate risk, let’s take a closer look at just a handful of these threat groups and the primary tactics, techniques and procedures (TTPs) they feature in their campaigns.\nThe most technically sophisticated use detailed social engineering techniques, zero-day exploits and weaknesses in the supply chain. For example, Tick uses a variety of methods to gain access to victim networks, such as spearphishing, watering hole attacks and software exploitations including a zero-day vulnerability to access company networks. The group has used custom malware, as well as legitimate penetration testing tools to move laterally within a network, escalate privileges, harvest credentials and exfiltrate data. Recently, Tick has adopted a steganography technique, embedding malicious code in an image file downloaded from a compromised website, thus bypassing firewalls and avoiding detection by anti-virus solutions.\nAnother technically sophisticated group that continues to evolve is APT10. The group first accesses target networks by compromising a service provider within the supply chain through spearphishing techniques, and then moves laterally to gain access to their primary target. More recent campaigns involve custom tools the group has developed that contain “decoy documents” to deliver a variety of payloads that can execute a range of activities including enabling communication with command and control (C2) servers, finding files, exfiltrating data and taking screen shots.\nGroups with lesser technical capability tend to rely on commercial malware variants, but should not be discounted. Operation Ghoul is one such example – targeting more than 130 organizations in 18 months, the group is intent on its mission. Operation Ghoul uses spearphishing emails, mostly sent to executives and other senior employees at target organizations. The messages have contained compressed executables with data-harvesting malware, reportedly based on commercial spyware. The malware logs keystrokes and collects passwords, screenshots, account data from browsers and clipboard data and communicates using a single C2 server.\nMicrosoft Office vulnerabilities (known or unidentified) are often exploited by espionage threat actors as part of their campaigns. Patchwork and Turla are prime examples. Patchwork commonly uses phishing emails and malicious sites to deliver Microsoft Office or PowerPoint files that exploit several known vulnerabilities, including:\n● CVE-2012-1856● CVE-2014-4114● CVE-2017-0199● CVE-2017-8570● CVE-2015-1641● CVE-2012-0158\nThese vulnerabilities allow an attacker to remotely exploit arbitrary code on several Microsoft Windows operating systems, as well as some Microsoft applications, which are used by organizations across industries. Turla also uses vulnerabilities that were not publicly reported at their time of use (zero-day exploits) including CVE-2017-0261, CVE-2017-0262 and CVE-2017-0263. These vulnerabilities in several Microsoft Office versions allow for remote code execution.\nGiven the TTPs just discussed, the following tips can help organizations mitigate risk of IP theft and corporate espionage and strengthen their security posture:\nSpearphishing and watering hole attacks: Provide phishing and general online security training to every employee. Best practices include limiting online activity to reputable sites, avoiding opening unsolicited attachments and performing extra checks before interacting with suspicious email messages.\nMalicious software downloads: Individuals should only download applications from legitimate sites. Be sure to review security and access permissions granted to these programs.\nCredential harvesting and account takeover: Mandate strong password security across the organization, ensuring passwords are of appropriate length and not reused across accounts. Monitor for exposed credentials on sites like haveibeenpwned.com and use multi-factor authentication for accounts where possible.\nSupply chain attacks: Suppliers are often given undue and wholesale access and capabilities to company networks. Organizations should apply technological controls and access restrictions to suppliers, such as separation of duties and least privilege, as well as network isolation and segmentation of the supply chain.\nExploitation of vulnerabilities: Regularly apply patches as they are released and monitor for known security vulnerabilities being exploited in the wild.\nDefense in depth: Consider a broad security strategy guided by four main principles: use of host-based firewalls and IP-whitelisting measures, segmenting networks and restricting workstation-to-workstation communication, applying patches and disabling unneeded legacy features, and restricting access to important data to only those who are required to have it.\nFor Willie Sutton, banks were high-value targets and tellers had no choice but to hand over the money. Today, high-value targets for corporate espionage include any organization with proprietary information that can be sold for financial gain. Fortunately, by following these steps organizations don’t have to “hand over the money,” but can proactively mitigate risk of IP theft and corporate espionage.","url":"https:\/\/www.securityweek.com\/dont-fall-victim-ip-theft-and-corporate-espionage"},{"Unnamed: 0":7,"query":"APT10","text":"Researchers Warn Against Knee-Jerk Attribution of 'Olympic Destroyer' Attack\r\n\n\nAttribution has become a buzzword in malware analysis. It is very difficult to achieve -- but is necessary in a world that is effectively engaged in the early stages of a geopolitical cyberwar. Malware researchers tend to stop short of saying, 'this country or that actor is behind this attack'. Nevertheless, they are not shy in dropping hints, leaving the reader to make subjective conclusions.\nThey have done just that with the recent cyber-attacks against the PyeongChang Winter Olympic Games.\nThe New York Times comments, \"Security companies would not say definitively who was behind the attack, but some digital crumbs led to a familiar culprit: Fancy Bear, the Russian hacking group with ties to Russian intelligence services.\"\nMicrosoft tweeted, \"Fresh analysis of the #cyberattack against systems used in the Pyeongchang #WinterOlympics reveals #EternalRomance SMB exploit.\"\nEternalRomance -- one of the leaked NSA exploits -- along with SMB was employed in the Bad Rabbit ransomware which has been likened to NotPetya which the UK government today ascribed to the Russian intelligence services.\nIntezer is a firm that specializes in recognizing code reuse. It has analyzed the Olympic attacks, and comments, \"We have found numerous small code fragments scattered throughout different samples of malware in these attacks that are uniquely linked to APT3, APT10, and APT12 which are known to be affiliated with Chinese threat actors.\"\nRecorded Future comments (PDF), \"Our own research turned up trivial but consistent code similarities between Olympic Destroyer modules and several malware families used by the Lazarus Group. These include standard but different functions within BlueNoroff Banswift malware, the LimaCharlie family of Lazarus malware from the Novetta Blockbuster report, and a module from the Lazarus SpaSpe malware meant to target domain controllers.\" Lazarus is, of course, considered to be synonymous with North Korea.\nBut while saying that there are code similarity hints at connections with North Korea, Recorded Future warns against jumping to any specific conclusion. \"The trouble with this technique is that while code similarity can be stated with certainty, down to a percentage of bytes shared, the results are not straightforward and require expert interpretation. The Olympic Destroyer malware is a perfect example of how we can be led astray by this clustering technique when our standard for similarity is too low.\"\nCode analysis suggests that Russia, China or North Korea, or any combination thereof, or all, or none of these state actors were behind the Winter Olympics attack.\nJuan Andres Guerrero-Saade, principal security researcher at the Insikt Group at Recorded Future says: “Complex malware operations make us take pause to reevaluate research methods and make sure the research community is not being misled by its own eagerness to attribute attacks.\"\nPriscilla Moriuchi, director of strategic threat development at Recorded Future says: “Attribution continues to be important in cyber-attacks because it shapes the victim, public, and government responses. However, accurate attribution is both more crucial and more difficult to determine than ever because adversaries are constantly evolving new techniques and the expertise required to identify a sophisticated actor keeps increasing.”\nThis doesn't mean that Recorded Future drops no hints of its own. It notes that this was a sophisticated two-pronged attack probably involving an earlier malware attack designed to steal credentials to be used during the opening ceremony against both the organizers and the infrastructure providers. In other words, it could only be achieved by a highly resourced attacker. \nThe attack's purpose was disruption rather than absolute destruction. While systems were wiped, they were left able to reboot -- allowing the possibility of eventual data recovery and reinstatement. There is no immediately apparent attempt at extortion -- removing financial motivation and leaving the probability of political motivation.\nThe 'hints' contained in the code similarity point variously at Russia, China and North Korea. Recorded Future adds another possibility: \"The co-occurrence of code overlap in the malware may be indicative of a false flag operation, attempting to dilute evidence and confuse researchers.\" In other words, without access to 5Eyes-quality wiretaps and intercepted voice conversations (which intelligence agencies would be unwilling to reveal) it is all but impossible to attribute this, or any other cyber-attack, with 100% confidence.\nAs Recorded Future concludes, \"For the time being, attribution remains inconclusive.\"\nRelated: The Increasing Effect of Geopolitics on Cybersecurity \nRelated: Gold Dragon Implant Linked to Pyeongchang Olympics Attacks \nRelated: Geopolitical Context a Prerequisite for Finished Intelligence","url":"https:\/\/www.securityweek.com\/researchers-warn-against-knee-jerk-attribution-olympic-destroyer-attack"},{"Unnamed: 0":8,"query":"APT10","text":"Report Highlights Business Risks Drawn From Geopolitical Flashpoints\r\n\n\nFlashpoint's mid-year Business Risk Intelligence Report analyzes data from geopolitics and the deep and dark web to show how threat actors and their motivations have evolved over the first six months of 2017, and to provide insight into what new threats might appear in the coming months. It comprises sections covering both the primary nation-states and the main threat sub-sections.\nRussia\nThe report notes the continuing Russian effort to interfere with western elections; especially during the approach to the German national elections in September 2017. \nThe Shadow Brokers (TSB) have re-emerged from dormancy, and are generally considered to be tied to the Russian state. Internally, Russia is tightening control over dissidents and internet usage. Ruslan Stoyanov was arrested over un-specified charges relating to 'treason'. From prison, he warned the regime against \"the consequences of partnering with domestic 'patriot-thieves' (cybercriminals).\n\"Moscow is moving quickly towards establishing an unprecedented level of information control within the country's borders\" warns Flashpoint, \"...cementing the state's authority over online activities.\"\nChina\nChinese state-sponsored activity has remained low following the Xi-Obama agreement made in September 2015. Nevertheless, there has been some activity. In early March, a DHS report described activity under the 'Pleasantly Surprised' campaign spear-phishing commercial entities in the financial, retail and technology sectors. APT10 was also linked to a campaign targeting the National Foreign Trade Council around the time of the US\/China summit in early April. Other probable Chinese activities included attacks against MSSPs and attempts to compromise South Korea's Terminal High Altitude Area Defense (THAAD) anti-ballistic missile system.\nFlashpoint notes that China remains a potent cyber force, but seems to have turned the focus of its attention to Asian and geographically nearby targets. Internally it continues to increase control over cyber activities with new regulations on data flows and VPNs.\nFive Eyes\nThe Five Eyes group of nations is described as the \"pinnacle of cyber capabilities of all actors in cyberspace\" -- but one that is not considered a 'threat actor' to other western nations. However, the NSA continues to be embarrassed by the TSB leaks, while the CIA has been embarrassed by WikiLeaks' Vault7 leaks. However, \"Despite the synchronicity between the ShadowBrokers releases and the Wikileaks dump, there is no known connection between the two,\" says Flashpoint.\nIran\nIran is described as a 'moderately-capable threat actor in cyberspace', and one that has concentrated on exploiting vulnerabilities in critical infrastructure systems. While it has been relatively quiet in recent months, Flashpoint warns that any attempt by the US Administration to dismantle the Iranian nuclear accord is likely \"to be accompanied by renewed Iranian eff\u001dorts in the cyber domain.\" However, for the moment, it believes that the \"re-election of Iranian President Hassan Rouhani is likely to have a stabilizing effect on Iranian cyber activities.\"\nNorth Korea\nNorth Korea is considered to be a potent threat, but one that has been relatively quiet this year following China's apparent withdrawal of political support. Nevertheless, there have been at least two spear-phishing campaigns: one against South Korean research organizations, and the other against North Korean defectors.\nThe report notes the suggested links of the WannaCry ransomware to the North Korean Lazarus Group. Its own findings suggest a Chinese-speaking author; but adds these two findings are not mutually exclusive.\nGeopolitically, the Trump administration has said, the \"era of strategic patience is over.\" Flashpoint concludes, \"The North's current apparent quiescence in cyberspace may come to a swift end in the event that the United States reacts strongly to the country's sixth nuclear test, for which many analysts believe that Pyongyang is preparing.\"\nJust this week, US-CERT released a technical alert on behalf of the DHS and the FBI to warn organizations of North Korea’s “Hidden Cobra” activities, particularly distributed denial-of-service (DDoS) attacks.\nDisruptive and Attention-Seeking Actors\nSuch actors have been quieter than usual during the first half of 2017. Flashpoint believes it may be because they are starved of publicity due to the media's current focus on the new administration and the FBI\/Russia probe. Other reasons may be industry's improving security stance and, for example, the increased awareness among police departments of SWATTING techniques.\nCybercriminals\nCybercriminals are continuing to innovate and evolve. The switch from targeting individuals to targeting organizations continues, and the focus on targeting healthcare remains. \"Flashpoint has observed a variety of actors such as \"svako,\" \"hackworld,\" \"covrig3500,\" and more targeting healthcare clinics across the United States in efforts to monetize the stolen data.\"\nBusiness Email Compromise (BEC) is growing. In April, Google and Facebook became victims in a scam that netted $100 million for the scammers.\nHacktivists\nFlashpoint notes a decline in western hacktivism. \"Thus far in 2017,\" it says, \"the hacktivist landscape has been dominated by a small subset of largely-ineffectual hacktivist operations linked to the Anonymous collective, as well as activity emanating out of Turkey and China in particular.\" \nJihadi Actors\nJihadi actors have shown little growth in technical skill over the first half of 2017. \"Due to the lack of technical acumen within most jihadi hacker groups, their victims tend to be poorly-defended or smaller, low-hanging-fruit websites.\" The most active hacker group is the United Cyber Caliphate (UCC) which has called for all pro-ISIS hackers to unite under one banner, including the newly-created \"Caliphate Cyber Terrorism Army (CCTA).\" There is, however, no evidence that the group is directed or supported by ISIS itself. It has also suffered from the loss of at least three of its leaders to US airstrikes -- the most recent being Osed Agha in March 2017, and the most notable being Junaid Hussain, or \"TriCk\" of TeaMp0isoN.\nThe physical threat to western nations has, however, increased. As the strength of the Isis Caliphate has dwindled, it has turned to recruiting and encouraging the \"lone mujahid in the West.\" Although not mentioned by Flashpoint as part of this report, this has led to increasing demands from western governments to curb end-to-end encryption, and for the social media giants to co-operate more closely with government.\nFlashpoint believes that a deeper understanding of geopolitics and the interaction with cyber threats can help business better prepare for both current and future threats.","url":"https:\/\/www.securityweek.com\/report-highlights-business-risks-drawn-geopolitical-flashpoints"}]