[{"Unnamed: 0":0,"query":"APT29","text":" \nThe sophisticated threat actor COZY BEAR was initially identified in 2014. This actor has many other names in the information security community, including APT-29, Office Monkeys, CozyCar, and CozyDuke. Unlike many of the other nation-state actors that CrowdStrike monitors, COZY BEAR tends to cast a wide net, sending out thousands of phishing emails to a broad set of targets. This is notable, as most nation-state attackers tracked by CrowdStrike Falcon Intelligence prefer to conduct more focused operations against smaller sets of targets.\nCOZY BEAR is nothing if not flexible, changing tool sets frequently. The actor’s implants have included those designated as SeaDaddy, MiniDionis, and AdobeARM RAT. In terms of post-exploitation operations, COZY BEAR is aggressive, using the latest components of the target operating system to hide from antivirus and host-based security tools.\nFor more information on COZY BEAR, see CrowdStrike blog post Bears in the Midst. To learn more about using threat intelligence to defend your enterprise, protect your endpoints and proactively hunt sophisticated threat actors, visit the CrowdStrike Falcon Intelligence page.\nTo get full access to CrowdStrike’s next-gen antivirus solution for 15 days visit the Falcon Prevent free trial page.","url":"https:\/\/www.crowdstrike.com\/blog\/who-is-cozy-bear\/"},{"Unnamed: 0":0,"query":"APT29","text":"Mandiant has observed Russian nation-state attackers APT29 employing domain fronting techniques for stealthy backdoor access to victim environments for at least two years. There has been considerable discussion about domain fronting following the release of a paper detailing these techniques . Domain fronting provides outbound network connections that are indistinguishable from legitimate requests for popular websites.  APT29 has used The Onion Router (TOR) and the TOR domain fronting plugin meek to create a hidden, encrypted network tunnel that appeared to connect to Google services over TLS. This tunnel provided the attacker remote access to the host system using the Terminal Services (TS), NetBIOS, and Server Message Block (SMB) services, while appearing to be traffic to legitimate websites. The attackers also leveraged a common Windows exploit to access a privileged command shell without authenticating.  We first discussed APT29’s use of these techniques as part of our “No Easy Breach” talk at DerbyCon 6.0. For additional details on how we first identified this backdoor, and the epic investigation it was part of, see the slides and presentation .  Domain Fronting Overview  The Onion Router (TOR) is a network of proxy nodes that attempts to provide anonymity to users accessing the Internet. TOR transfers internet traffic through a series of proxy points on the Internet, with each node knowing only the previous and next node in the path. This proxy network, combined with pervasive encryption, makes tracking the source of TOR Internet activity extremely difficult. A TOR client can also use the TOR network to host services that are not accessible from the open Internet. These services are commonly used to host “dark web” sites such as the defunct Silk Road.  Typically network analysts can identify normal TOR traffic through signature analysis or the identification of communication with TOR infrastructure. Meek is a publicly available obfuscation plugin for TOR and an implementation of the domain fronting technique. To hide TOR traffic, meek takes advantage of the way that Google and other Internet content delivery networks (CDNs) route traffic. CDNs often route traffic from IP addresses associated with one service to servers associated with another service hosted on the same network. By hosting a meek reflection server in one of these CDNs, meek can hide TOR traffic in legitimate HTTPS connections to well-known services.  Meek obfuscates traffic in several stages. First, it encodes TOR traffic into HTTP specifying the host name of the reflection server (for example, the default server meek-reflect.appspot.com). It then wraps that HTTP traffic in a legitimate TLS connection to a server hosted in the same CDN cloud as the reflection server (in this example, Google). When the CDN server receives the connection, it decrypts the TLS traffic, identifies the hostname specified in the HTTP header and redirects the traffic to the reflection server. The reflection server then reconstructs the original TOR traffic from the HTTP stream and sends the traffic to the TOR network, which routes it to its destination. This process creates an outbound network connection that appears to contain normal HTTPS POST requests for google.com on a Google-owned IP address, while discretely passing the traffic through the reflection server to the TOR network. Meek can also use the TLS service and cipher suites used by Firefox to further obfuscate traffic. Differentiating this traffic from legitimate connections is extremely difficult, and encryption of both on the initial TLS connection and the TOR traffic makes meaningful analysis of the traffic impossible. Note: Google suspended the reflection server meek-reflect.appspot.com, but other servers, in the Google cloud or other supported CDNs, can fulfill the same function.  Figure 1 displays the traffic flow when using meek.   Figure 1: Meek traffic flow  Backdoor Overview  Mandiant discovered that APT29 enabled a TOR hidden service that forwarded traffic from the TOR client to local ports 139, 445 and 3389 (NetBIOS, SMB and TS, respectively). This provided the attackers full remote access to the system from outside of the local network using the hidden TOR (.onion) address of the system.  The attackers created the following files and directories during the installation and execution of the backdoor:   C:\\Program Files(x86)\\Google\\googleService.exe  C:\\Program Files(x86)\\Google\\GoogleUpdate.exe  C:\\Program Files(x86)\\Google\\core  C:\\Program Files(x86)\\Google\\data  C:\\Program Files(x86)\\Google\\data\\00  C:\\Program Files(x86)\\Google\\data\\00\\hostname  C:\\Program Files(x86)\\Google\\data\\00\\private_key  C:\\Program Files(x86)\\Google\\debug.log  C:\\Program Files(x86)\\Google\\lock  C:\\Program Files(x86)\\Google\\cached-certs  C:\\Program Files(x86)\\Google\\cached-microdescs  C:\\Program Files(x86)\\Google\\cached-microdescs.new  C:\\Program Files(x86)\\Google\\cached-microdescs-consensus  C:\\Program Files(x86)\\Google\\state  C:\\Program Files(x86)\\Google\\start.ps1  C:\\Program Files(x86)\\Google\\install.bat   The file googleService.exe is the primary TOR executable, responsible for establishing and maintaining encrypted proxy connections. GoogleUpdate.exe is the meek-client plugin, which obfuscates the TOR connection. These files are publicly available and have the following hashes:  Filename                     SHA256  googleService.exe     fe744a5b2d07de396a8b3fe97155fc64e350b76d88db36c619cd941279987dc5 GoogleUpdate.exe      2f39dee2ee608e39917cc022d9aae399959e967a2dd70d83b81785a98bd9ed36  The file C:\\Program Files (x86)\\Google\\core contains configuration information for the TOR service googleService.exe . The service was configured to:   Communicate on ports 1, 80 and 443  Bridge traffic using the meek plugin to https:\/\/meek-reflect.appspot.com and obfuscate HTTPS and DNS requests to appear destined for www.google.com  Forward traffic from ports 62304, 62305 and 62306 to ports 3389, 139 and 445, respectively   Figure 2 displays the contents of the TOR configuration file core.   Figure 2: Contents of TOR configuration file “C:\\Program Files(x86)\\Google\\core”  The C:\\Program Files (x86)\\Google\\data\\00\\hostname ” file contained a single line with the TOR hostname for the system. This hostname was a pseudorandomly-generated 16 character alpha-numeric name, with the top-level domain (TLD) .onion .  The C:\\Program Files(x86)\\Google\\data\\00\\private_key file contained the TOR client RSA private key. Figure 3 displays the redacted contents of a sample private_key file.   Figure 3: Redacted contents of sample private_key  The attackers used the scripts start.ps1 and install.bat to install the TOR service. After installation, the attackers deleted these scripts from the system. Additional files in the directory C:\\Program Files(x86)\\Google contained cached data and logs from the operation of TOR.  Additional information on increasing visibility into PowerShell activity through enhanced logging is available here .  Installation and Persistence  The attacker executed the PowerShell script C:\\Program Files(x86)\\Google\\start.ps1 to install the TOR services and implement the “Sticky Keys” exploit. This script was deleted after execution, and was not recovered.  By replacing the “Sticky Keys” binary, C:\\Windows\\System32\\sethc.exe , with the Windows Command Processor cmd.exe , the attackers then accessed a privileged Windows console session without authenticating to the system. “Sticky Keys” is an accessibility feature that allows users to activate Windows modifier keys without pressing more than one key at a time. Pressing the shift key five times activates “Sticky Keys” and executes sethc.exe , which, when replaced with cmd.exe , opens a System-level command shell. From this shell, the attackers can execute arbitrary Windows commands, including adding or modifying accounts on the system, even from the logon screen (pre-authentication). By tunneling RDP traffic to the system, the attackers could gain both persistent access and privilege escalation using this simple and well-known exploit.  The installation script start.ps1 created a Windows service named Google Update to maintain persistence after a system reboot. Table 1 contains registry details for the “Google Update” service.   Table 1: Registry details for the TOR Google Update Windows service  The script also modified the Terminal Server registry values fSingleSessionPerUser to allow multiple simultaneous Windows sessions using the same account, and fDenyTSConnections to allow Terminal Services connections. Table 2 shows the modified values for these registry keys.   Table 2: Registry modifications performed by start.ps1  Conclusion  APT29 adopted domain fronting long before these techniques were widely known. By employing a publicly available implementation, they were able to hide their network traffic, with minimal research or development, and with tools that are difficult to attribute. Detecting this activity on the network requires visibility into TLS connections and effective network signatures. However, when dealing with advanced threat groups who rapidly develop capabilities and invest in hiding network traffic, effective endpoint visibility is vital. Monitoring for potentially interesting events and attacker methodologies, like lateral movement and new persistence creation, can allow defenders to identify these stealthy methodologies.","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2017\/03\/apt29_domain_frontin.html"},{"Unnamed: 0":1,"query":"APT29","text":"Uncovering a Malware\n  Backdoor that Uses Twitter     It hides in network communications, in all\n  the noise—designed so that defenders can neither detect nor\n  characterize its activity. But its purpose is transparent: to use\n  Twitter, GitHub, and cloud storage services to relay commands and\n  extract data from compromised networks.  Download the report and read about the\n  recently discovered HAMMERTOSS, a malware backdoor created by the\n  Russian advanced persistent threat (APT) group APT29.  Learn:   How HAMMERTOSS works—the five\n    stages, from looking for a Twitter handle to executing commands,\n    including uploading victim’s data to cloud storage services  Who APT29 is—their history, targets and methodology  Why\n    it’s difficult to detect HAMMERTOSS   Download the report now.","url":"https:\/\/www.fireeye.com\/\/current-threats\/apt-groups\/rpt-apt29.html"},{"Unnamed: 0":2,"query":"APT29","text":"Mandiant has observed APT29 using a stealthy backdoor that we call POSHSPY. POSHSPY leverages two of the tools the group frequently uses: PowerShell and Windows Management Instrumentation (WMI). In the investigations Mandiant has conducted, it appeared that APT29 deployed POSHSPY as a secondary backdoor for use if they lost access to their primary backdoors.  POSHSPY makes the most of using built-in Windows features – so-called “living off the land” – to make an especially stealthy backdoor. POSHSPY's use of WMI to both store and persist the backdoor code makes it nearly invisible to anyone not familiar with the intricacies of WMI. Its use of a PowerShell payload means that only legitimate system processes are utilized and that the malicious code execution can only be identified through enhanced logging or in memory. The backdoor's infrequent beaconing, traffic obfuscation, extensive encryption and use of geographically local, legitimate websites for command and control (C2) make identification of its network traffic difficult. Every aspect of POSHSPY is efficient and covert.  Mandiant initially identified an early variant of the POSHSPY backdoor deployed as PowerShell scripts during an incident response engagement in 2015. Later in that same engagement, the attacker updated the deployment of the backdoor to use WMI for storage and persistence. Mandiant has since identified POSHSPY in several other environments compromised by APT29 over the past two years.  We first discussed APT29’s use of this backdoor as part of our “No Easy Breach” talk. For additional details on how we first identified this backdoor, and the epic investigation it was part of, see the slides and presentation .  Windows Management Instrumentation  WMI is an administrative framework that is built into every version of Windows since 2000. WMI provides many administrative capabilities on local and remote systems, including querying system information, starting and stopping processes, and setting conditional triggers. WMI can be accessed using a variety of tools, including the Windows WMI Command-line (wmic.exe), or through APIs accessible to programming and scripting languages such as PowerShell. Windows system WMI data is stored in the WMI common information model (CIM) repository, which consists of several files in the System32\\wbem\\Repository directory.  WMI classes are the primary structure within WMI. WMI classes can contain methods (code) and properties (data). Users with sufficient system-level privileges can define custom classes or extend the functionality of the many default classes.  WMI permanent event subscriptions can be used to trigger actions when specified conditions are met. Attackers often use this functionality to persist the execution of backdoors at system start up. Subscriptions consist of three core WMI classes: a Filter, a Consumer, and a FilterToConsumerBinding. WMI Consumers specify an action to be performed, including executing a command, running a script, adding an entry to a log, or sending an email. WMI Filters define conditions that will trigger a Consumer, including system startup, the execution of a program, the passing of a specified time and many others. A FilterToConsumerBinding associates Consumers to Filters. Creating a WMI permanent event subscription requires administrative privileges on a system.  We have observed APT29 use WMI to persist a backdoor and also store the PowerShell backdoor code. To store the code, APT29 created a new WMI class and added a text property to it in order to store a string value. APT29 wrote the encrypted and base64-encoded PowerShell backdoor code into that property.  APT29 then created a WMI event subscription in order to execute the backdoor. The subscription was configured to run a PowerShell command that read, decrypted, and executed the backdoor code directly from the new WMI property. This allowed them to install a persistent backdoor without leaving any artifacts on the system’s hard drive, outside of the WMI repository. This “fileless” backdoor methodology made the identification of the backdoor much more difficult using standard host analysis techniques.  POSHSPY WMI Component  The WMI component of the POSHSPY backdoor leverages a Filter to execute the PowerShell component of the backdoor on a regular basis. In one instance, APT29 created a Filter named BfeOnServiceStartTypeChange (Figure 1), which they configured to execute every Monday, Tuesday, Thursday, Friday, and Saturday at 11:33 am local time.   Figure 1: “BfeOnServiceStartTypeChange” WMI Query Language (WQL) filter condition  The BfeOnServiceStartTypeChange Filter was bound to the CommandLineEventConsumer WindowsParentalControlsMigration . The WindowsParentalControlsMigration consumer was configured to silently execute a base64-encoded PowerShell command. Upon execution, this command extracted, decrypted, and executed the PowerShell backdoor payload stored in the HiveUploadTask text property of the RacTask class. The PowerShell command contained the payload storage location and encryption keys. Figure 2 displays the command, called the “CommandLineTemplate”, executed by the WindowsParentalControlsMigration consumer.   Figure 2: WindowsParentalControlsMigration CommandLineTemplate  Figure 3 contains the decoded PowerShell command from the “CommandLineTemplate.”    Figure 3: Decoded CommandLineTemplate PowerShell code  POSHSPY PowerShell Component  The full code for a POSHSPY sample is available here .  The POSHSPY backdoor is designed to download and execute additional PowerShell code and Windows binaries. The backdoor contains several notable capabilities, including:  1. Downloading and executing PowerShell code as an EncodedCommand   2. Writing executables to a randomly-selected directory under Program Files , and naming the EXE to match the chosen directory name, or, if that fails, writing the executable to a system-generated temporary file name, using the EXE extension   3. Modifying the Standard Information timestamps (created, modified, accessed) of every downloaded executable to match a randomly selected file from the System32 directory that was created prior to 2013   4. Encrypting communications using AES and RSA public key cryptography   5. Deriving C2 URLs from a Domain Generation Algorithm (DGA) using lists of domain names, subdomains, top-level domains (TLDs), Uniform Resource Identifiers (URIs), file names, and file extensions   6. Using a custom User Agent string or the system's User Agent string derived from urlmon.dll   7. Using either custom cookie names and values or randomly-generated cookie names and values for each network connection   8. Uploading data in 2048-byte chunks   9. Appending a file signature header to all encrypted data, prior to upload or download, by randomly selecting from the file types:   ICO  GIF  JPG  PNG  MP3  BMP    The sample in this example used 11 legitimate domains owned by an organization located near the victim. When combined with the other options in the DGA, 550 unique C2 URLs could be generated. Infrequent beaconing, use of DGA and compromised infrastructure for C2, and appended file headers used to bypass content inspection made this backdoor difficult to identify using typical network monitoring techniques.  Conclusion  POSHSPY is an excellent example of the skill and craftiness of APT29. By “living off the land” they were able to make an extremely discrete backdoor that they can deploy alongside their more conventional and noisier backdoor families, in order to help ensure persistence even after remediation. As stealthy as POSHSPY can be, it comes to light quickly if you know where to look. Enabling and monitoring enhanced PowerShell logging can capture malicious code as it executes and legitimate WMI persistence is so rare that malicious persistence quickly stands out when enumerating it across an environment. This is one of several sneaky backdoor families that we have identified, including an off-the-shelf domain fronting backdoor and HAMMERTOSS . When responding to an APT29 breach, it is vital to increase visibility, fully scope the incident before responding and thoroughly analyze accessed systems that don't contain known malware.  Additional Reading  This PowerShell logging blog post contains more information on improving PowerShell visibility in your environment.  This excellent whitepaper by William Ballenthin, Matt Graeber and Claudiu Teodorescu contains additional information on WMI offense, defense and forensics.  This presentation by Christopher Glyer and Devon Kerr contains additional information on attacker use of WMI in past Mandiant investigations.  The FireEye FLARE team released a WMI repository-parsing tool that allows investigators to extract embedded data from the WMI repository and identify WMI persistence.","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2017\/03\/dissecting_one_ofap.html"},{"Unnamed: 0":0,"query":"APT29","text":"Sofacy, also known as APT28, Fancy Bear, and Tsar Team, is a highly active and prolific APT . From their high volume 0day deployment to their innovative and broad malware set, Sofacy is one of the top groups that we monitor, report, and protect against. 2017 was not any different in this regard. Our private reports subscription customers receive a steady stream of YARA , IOC, and reports on Sofacy, our most reported APT for the year.  This high level of cyber-espionage activity goes back years. In 2011-2012, the group used a relatively tiny implant (known as “Sofacy” or SOURFACE) as their first stage malware, which at the time had similarities with the old Miniduke implants. This made us believe the two groups were connected, although it looks they split ways at a certain point, with the original Miniduke group switching to the CosmicDuke implant in 2014. The division in malware was consistent and definitive at that point.  In 2013, the Sofacy group expanded their arsenal and added more backdoors and tools, including CORESHELL, SPLM (aka Xagent, aka CHOPSTICK), JHUHUGIT (which is built with code from the Carberp sources), AZZY (aka ADVSTORESHELL, NETUI, EVILTOSS, and spans across 4-5 generations) and a few others. We’ve seen quite a few versions of these implants, which were relatively widespread at some point or still are. In 2015 we noticed another wave of attacks which took advantage of a new release of the AZZY implant, largely undetected by antivirus products. The new wave of attacks included a new generation of USB stealers deployed by Sofacy, with initial versions dating to February 2015. It appeared to be geared exclusively towards high profile targets.  Sofacy’s reported presence in the DNC network alongside APT29 brought possibly the highest level of public attention to the group’s activities in 2016, especially when data from the compromise was leaked and “weaponized”. And later 2016, their focus turned towards the Olympics’ and the World Anti-Doping Agency (WADA) and Court of Arbitration for Sports (CAS), when individuals and servers in these organizations were phished and compromised. In a similar vein with past CyberBerkut activity, attackers hid behind anonymous activist groups like “anonpoland”, and data from victimized organizations were similarly leaked and “weaponized”.  This write-up will survey notables in the past year of 2017 Sofacy activity, including their targeting, technology, and notes on their infrastructure. No one research group has 100% global visibility, and our collected data is presented accordingly. Here, external APT28 reports on 2017 Darkhotel -style activity in Europe and Dealer’s Choice spearphishing are of interest. From where we sit, 2017 Sofacy activity starts with a heavy focus on NATO and Ukrainian partners, coinciding with lighter interest in Central Asian targets, and finishing the second half of the year with a heavy focus on Central Asian targets and some shift further East.   Dealer’s Choice  The beginning of 2017 began with a slow cleanup following the Dealer’s Choice campaign, with technical characteristics documented by our colleagues at Palo Alto in several stages at the end of 2016. The group spearphished targets in several waves with Flash exploits leading to their carberp based JHUHUGIT downloaders and further stages of malware. It seems that many folks did not log in and pull down their emails until Jan 2017 to retrieve the Dealer’s Choice spearphish. Throughout these waves, we observed that the targets provided connection, even tangential, to Ukraine and NATO military and diplomatic interests.  In multiple cases, Sofacy spoofs the identity of a target, and emails a spearphish to other targets of interest. Often these are military or military-technology and manufacturing related, and here, the DealersChoice spearphish is again NATO related:   The global reach that coincided with this focus on NATO and the Ukraine couldn’t be overstated. Our KSN data showed spearphishing targets geolocated across the globe into 2017. AM, AZ, FR, DE, IQ, IT, KG, MA, CH, UA, US, VN  DealersChoice emails, like the one above, that we were able to recover from third party sources provided additional targeting insight, and confirmed some of the targeting within our KSN data: TR, PL, BA, AZ, KR, LV, GE, LV, AU, SE, BE  0day Deployment(s)  Sofacy kicked off the year deploying two 0day in a spearphish document, both a Microsoft Office encapsulated postscript type confusion exploit (abusing CVE-2017-0262 ) and an escalation of privilege use-after-free exploit (abusing CVE-2017-0263 ). The group attempted to deploy this spearphish attachment to push a small 30kb backdoor known as GAMEFISH to targets in Europe at the beginning of 2017. They took advantage of the Syrian military conflict for thematic content and file naming “Trump’s_Attack_on_Syria_English.docx”. Again, this deployment was likely a part of their focus on NATO targets.  Light SPLM deployment in Central Asia and Consistent Infrastructure  Meanwhile in early-to-mid 2017, SPLM\/CHOPSTICK\/XAgent detections in Central Asia provided a glimpse into ongoing focus on ex-Soviet republics in Central Asia. These particular detections are interesting because they indicate an attempted selective 2nd stage deployment of a backdoor maintaining filestealer, keylogger, and remoteshell functionality to a system of interest. As the latest revision of the backdoor, portions of SPLM didn’t match previous reports on SPLM\/XAgent while other similarities were maintained. SPLM 64-bit modules already appeared to be at version 4 of the software by May of the year. Targeting profiles included defense related commercial and military organizations, and telecommunications.  Targeting included TR, KZ, AM, KG, JO, UK, UZ   Heavy Zebrocy deployments  Since mid-November 2015, the threat actor referred to as “Sofacy” or “APT28” has been utilizing a unique payload and delivery mechanism written in Delphi and AutoIT. We collectively refer to this package and related activity as “Zebrocy” and had written a few reports on its usage and development by June 2017 – Sofacy developers modified and redeployed incremented versions of the malware. The Zebrocy chain follows a pattern: spearphish attachment -> compiled Autoit script (downloader) -> Zebrocy payload. In some deployments, we observed Sofacy actively developing and deploying a new package to a much smaller, specific subset of targets within the broader set.  Targeting profiles, spearphish filenames, and lures carry thematic content related to visa applications and scanned images, border control administration, and various administrative notes. Targeting appears to be widely spread across the Middle East, Europe, and Asia:   Business accounting practices and standards  Science and engineering centers  Industrial and hydrochemical engineering and standards\/certification  Ministry of foreign affairs  Embassies and consulates  National security and intelligence agencies  Press services  Translation services  NGO – family and social service  Ministry of energy and industry   We identified new MSIL components deployed by Zebrocy. While recent Zebrocy versioning was 7.1, some of the related Zebrocy modules that drop file-stealing MSIL modules we call Covfacy were v7.0. The components were an unexpected inclusion in this particular toolset. For example, one sent out to a handful of countries identifies network drives when they are added to target systems, and then RC4-like-encrypts and writes certain file metadata and contents to a local path for later exfiltration. The stealer searches for files 60mb and less with these extensions:   .doc  .docx  .xls  .xlsx  .ppt  .pptx  .exe  .zip  .rar   At execution, it installs an application-defined Windows hook. The hook gets windows messages indicating when a network drive has been attached. Upon adding a network drive, the hook calls its “RecordToFile” file stealer method.   Zebrocy spearphishing targets: AF, AM, AU, AZ, BD, BE, CN, DE, ES, FI, GE, IL, IN, JO, KW, KG, KZ, LB, LT, MN, MY, NL, OM, PK, PO, SA, ZA, SK, SE, CH, TJ, TM, TR, UA, UAE, UK, US, UZ  SPLM deployment in Central Asia  SPLM\/CHOPSTICK components deployed throughout 2017 were native 64-bit modular C++ Windows COM backdoors supporting http over fully encrypted TLSv1 and TLSv1.2 communications, mostly deployed in the second half of 2017 by Sofacy. Earlier SPLM activity deployed 32-bit modules over unencrypted http (and sometimes smtp) sessions. In 2016 we saw fully functional, very large SPLM\/X-Agent modules supporting OS X.  The executable module continues to be part of a framework supporting various internal and external components communicating over internal and external channels, maintaining slightly morphed encryption and functionality per deployment. Sofacy selectively used SPLM\/CHOPSTICK modules as second stage implants to high interest targets for years now. In a change from previous compilations, the module was structured and used to inject remote shell, keylogger, and filesystem add-ons into processes running on victim systems and maintaining functionality that was originally present within the main module.  The newer SPLM modules are deployed mostly to Central Asian based targets that may have a tie to NATO in some form. These targets include foreign affairs government organizations both localized and abroad, and defense organizations’ presence localized, located in Europe and also located in Afghanistan. One outlier SPLM target profile within our visibility includes an audit and consulting firm in Bosnia and Herzegovina.  Minor changes and updates to the code were released with these deployments, including a new mutex format and the exclusive use of encrypted HTTP communications over TLS. The compiled code itself already is altered per deployment in multiple subtle ways, in order to stymie identification and automated analysis and accommodate targeted environments. Strings (c2 domains and functionality, error messages, etc) are custom encrypted per deployment.  Targets: TR, KZ, BA, TM, AF, DE, LT, NL  SPLM\/CHOPSTICK\/XAgent Modularity and Infrastructure  This subset of SPLM\/CHOPSTICK activity leads into several small surprises that take us into 2018, to be discussed in further detail at SAS 2018. The group demonstrates malleability and innovation in maintaining and producing familiar SPLM functionality, but the pragmatic and systematic approach towards producing undetected or difficult-to-detect malware continues. Changes in the second stage SPLM backdoor are refined, making the code reliably modular.  Infrastructure Notes  Sofacy set up and maintained multiple servers and c2 for varying durations, registering fairly recognizable domains with privacy services, registrars that accept bitcoin, fake phone numbers, phony individual names, and 1 to 1 email address to domain registration relationships. Some of this activity and patterns were publicly disclosed, so we expect to see more change in their process in 2018. Also, throughout the year and in previous years, researchers began to comment publicly on Sofacy’s fairly consistent infrastructure setup.  As always, attackers make mistakes and give away hints about what providers and registrars they prefer. It’s interesting to note that this version of SPLM implements communications that are fully encrypted over HTTPS. As an example, we might see extraneous data in their SSL\/TLS certificates that give away information about their provider or resources. Leading up to summer 2017, infrastructure mostly was created with PDR and Internet Domain Service BS Corp, and their resellers. Hosting mostly was provided at Fast Serv Inc and resellers, in all likelihood related to bitcoin payment processing.  Accordingly, the server side certificates appear to be generated locally on VPS hosts that exclusively are paid for at providers with bitcoin merchant processing. One certificate was generated locally on what appeared to be a HP-UX box, and another was generated on “8569985.securefastserver[.]com” with an email address “root@8569985.securefastserver[.]com”, as seen here for their nethostnet[.]com domain. This certificate configuration is ignored by the malware.   In addition to other ip data, this data point suggested that Qhoster at https:\/\/www.qhoster[.]com was a VPS hosting reseller of choice at the time. It should be noted that the reseller accepted Alfa Click, PayPal, Payza, Neteller, Skrill, WebMoney, Perfect Money, Bitcoin, Litecoin, SolidTrust Pay, CashU, Ukash, OKPAY, EgoPay, paysafecard, Alipay, MG, Western Union, SOFORT Banking, QIWI, Bank transfer for payment.  Conclusion  Sofacy, one of the most active APT we monitor, continues to spearphish their way into targets, reportedly widely phishes for credentials, and infrequently participates in server side activity (including host compromise with BeEF deployment , for example). KSN visibility and detections suggests a shift from their early 2017 high volume NATO spearphish targeting towards the middle east and Central Asia, and finally moving their focus further east into late 2017. Their operational security is good. Their campaigns appear to have broken out into subsets of activity and malware involving GAMEFISH, Zebrocy, and SPLM, to name a few. Their evolving and modified SPLM\/CHOPSTICK\/XAgent code is a long-standing part of Sofacy activity, however much of it is changing. We’ll cover more recent 2018 change in their targeting and the malware itself at SAS 2018 .  With a group like Sofacy, once their attention is detected on a network, it is important to review logins and unusual administrator access on systems, thoroughly scan and sandbox incoming attachments, and maintain two factor authentication for services like email and vpn access. In order to identify their presence, not only can you gain valuable insight into their targeting from intelligence reports and gain powerful means of detections with hunting tools like YARA, but out-of-band processing with a solution like KATA is important.  Technical Appendix  Related md5  8f9f697aa6697acee70336f66f295837 1a4b9a6b321da199aa6d10180e889313 842454b48f5f800029946b1555fba7fc d4a5d44184333442f5015699c2b8af28 1421419d1be31f1f9ea60e8ed87277db b1d1a2c64474d2f6e7a5db71ccbafa31 953c7321c4959655fdd53302550ce02d 57601d717fcf358220340675f8d63c8a 02b79c468c38c4312429a499fa4f6c81 85cd38f9e2c9397a18013a8921841a04 f8e92d8b5488ea76c40601c8f1a08790 66b4fb539806ce27be184b6735584339 e8e1fcf757fe06be13bead43eaa1338c 953c7321c4959655fdd53302550ce02d aa2aac4606405d61c7e53140d35d7671 85cd38f9e2c9397a18013a8921841a04 57601d717fcf358220340675f8d63c8a 16e1ca26bc66e30bfa52f8a08846613d f8e92d8b5488ea76c40601c8f1a08790 b137c809e3bf11f2f5d867a6f4215f95 237e6dcbc6af50ef5f5211818522c463 88009adca35560810ec220544e4fb6aa 2163a33330ae5786d3e984db09b2d9d2 02b79c468c38c4312429a499fa4f6c81 842454b48f5f800029946b1555fba7fc d4a5d44184333442f5015699c2b8af28 b88633376fbb144971dcb503f72fd192 8f9f697aa6697acee70336f66f295837 b6f77273cbde76896a36e32b0c0540e1 1a4b9a6b321da199aa6d10180e889313 1421419d1be31f1f9ea60e8ed87277db 1a4b9a6b321da199aa6d10180e889313 9b10685b774a783eabfecdb6119a8aa3 aa34fb2e5849bff4144a1c98a8158970 aced5525ba0d4f44ffd01c4db2730a34 b1d1a2c64474d2f6e7a5db71ccbafa31 b924ff83d9120d934bb49a7a2e3c4292 cdb58c2999eeda58a9d0c70f910d1195 d4a5d44184333442f5015699c2b8af28 d6f2bf2066e053e58fe8bcd39cb2e9ad 34dc9a69f33ba93e631cd5048d9f2624 1c6f8eba504f2f429abf362626545c79 139c9ac0776804714ebe8b8d35a04641 e228cd74103dc069663bb87d4f22d7d5 bed5bc0a8aae2662ea5d2484f80c1760 8c3f5f1fff999bc783062dd50357be79 5882a8dd4446abd137c05d2451b85fea 296c956fe429cedd1b64b78e66797122 82f06d7157dd28a75f1fbb47728aea25 9a975e0ddd32c0deef1318c485358b20 529424eae07677834a770aaa431e6c54 4cafde8fa7d9e67194d4edd4f2adb92b f6b2ef4daf1b78802548d3e6d4de7ba7 ede5d82bb6775a9b1659dccb699fadcb 116d2fc1665ce7524826a624be0ded1c 20ff290b8393f006eaf4358f09f13e99 4b02dfdfd44df3c88b0ca8c2327843a4 c789ec7537e300411d523aef74407a5e 0b32e65caf653d77cab2a866ee2d9dbc 27faa10d1bec1a25f66e88645c695016 647edddf61954822ddb7ab3341f9a6c5 2f04b8eb993ca4a3d98607824a10acfb 9fe3a0fb3304d749aeed2c3e2e5787eb 62deab0e5d61d6bf9e0ba83d9e1d7e2b 86b607fe63c76b3d808f84969cb1a781 f62182cf0ab94b3c97b0261547dfc6cf 504182aaa5575bb38bf584839beb6d51 d79a21970cad03e22440ea66bd85931f  Related domains  nethostnet[.]com hostsvcnet[.]com etcrem[.]net movieultimate[.]com newfilmts[.]com fastdataexchange[.]org liveweatherview[.]com analyticsbar[.]org analyticstest[.]net lifeofmentalservice[.]com meteost[.]com righttopregnantpower[.]com kiteim[.]org adobe-flash-updates[.]org generalsecurityscan[.]com globalresearching[.]org lvueton[.]com audiwheel[.]com online-reggi[.]com fsportal[.]net netcorpscanprotect[.]com mvband[.]net mvtband[.]net viters[.]org treepastwillingmoment[.]com sendmevideo[.]org satellitedeluxpanorama[.]com ppcodecs[.]com encoder-info[.]tk wmdmediacodecs[.]com postlkwarn[.]com shcserv[.]com versiontask[.]com webcdelivery[.]com miropc[.]org securityprotectingcorp[.]com uniquecorpind[.]com appexsrv[.]net adobeupgradeflash[.]com","url":"https:\/\/securelist.com\/a-slice-of-2017-sofacy-activity\/83930\/"},{"Unnamed: 0":0,"query":"APT29","text":"APT29 Uses Stealthy Backdoor to Maintain Access to Targets\r\n\nResearchers at FireEye-owned Mandiant have conducted a detailed analysis of a stealthy backdoor used by the Russia-linked cyberespionage group APT29 to maintain access to targeted systems.\nDubbed “POSHSPY,” the malware is believed to be a secondary backdoor used by the cyberspies in case they lose access to their primary backdoors. Mandiant first spotted POSHSPY in 2015 during an incident response engagement, and identified it on the networks of several organizations over the past two years.\nSimilar to other pieces of malware used by APT29, POSHSPY leverages PowerShell and the Windows Management Instrumentation (WMI) administrative framework.\nWMI can be used to obtain system information, start and stop processes, and configure conditional triggers. In the case of POSHSPY, WMI is used to run a PowerShell command that decrypts and executes the backdoor code directly from a WMI property, thus ensuring that no artifacts are left on the hard drive.\nThe WMI component of POSHSPY executes the PowerShell component on every Monday, Tuesday, Thursday, Friday and Saturday at 11:33 AM local time.\nExperts pointed out that the use of legitimate Windows tools and the other techniques employed in these attacks increase the backdoor’s chances of evading detection.\n“POSHSPY's use of WMI to both store and persist the backdoor code makes it nearly invisible to anyone not familiar with the intricacies of WMI. Its use of a PowerShell payload means that only legitimate system processes are utilized and that the malicious code execution can only be identified through enhanced logging or in memory,” explained Matthew Dunwoody, incident response consultant at Mandiant.\n“The backdoor's infrequent beaconing, traffic obfuscation, extensive encryption and use of geographically local, legitimate websites for command and control (C2) make identification of its network traffic difficult. Every aspect of POSHSPY is efficient and covert,” Dunwoody added.\nThe malware allows attackers to download and execute additional PowerShell code and executable files. The threat communicates with command and control (C&C) servers located at URLs generated using a domain generation algorithm (DGA) that relies on lists of domain names, TLDs, subdomains, URIs, file names and file extensions. C&C communications are encrypted using AES and RSA public key cryptography.\nFireEye has not shared any information on which countries or what types of organizations have been targeted in attacks involving the POSHSPY backdoor.\nThe APT29 group has put some effort into making its operations more difficult to detect. Earlier this month, FireEye detailed the threat actor’s use of a technique called “domain fronting” to disguise the malicious traffic generated by its tools.\nAPT29 is also known as The Dukes, Cozy Bear and Cozy Duke. The group is believed to be behind the recent election-related attacks in the U.S. and a campaign targeting high-profile organizations in Norway.\nRelated: Cyberspies Launch U.S. Attacks Hours After Trump Elected\nRelated: U.S. Gov's \"GRIZZLY STEPPE\" Report Fails to Achieve Purpose","url":"https:\/\/www.securityweek.com\/apt29-uses-stealthy-backdoor-maintain-access-targets"},{"Unnamed: 0":1,"query":"APT29","text":"APT29 Cyberspies Use Domain Fronting to Evade Detection\r\n\nThe Russia-linked cyber espionage group known as APT29 has been using a technique called “domain fronting” in an effort to make it more difficult for targeted organizations to identify malicious traffic, FireEye reported on Monday.\nDomain fronting is a censorship bypassing technique that involves disguising traffic to make it look as if it’s going to a host allowed by the censor, such as Google, Amazon or CloudFlare. Open Whisper Systems recently implemented the technique to help Signal users in Egypt and the United Arab Emirates bypass government censorship.\nAccording to FireEye, the technique has been used for at least two years by the threat actor APT29, which is also known as The Dukes, Cozy Bear and Cozy Duke. The group is believed to be behind the recent election-related attacks in the U.S. and a campaign targeting high-profile organizations in Norway.\nAPT29 has used the Tor anonymity network to communicate with infected machines, which could be considered suspicious by some defenders. In order to disguise Tor traffic as apparently legitimate traffic, the cyberspies used Meek, a Tor plugin that implements domain fronting and allows users to send traffic to Tor inside a harmless-looking HTTPS POST request to google.com.\nIn its attacks, APT29 used a PowerShell script and a .bat file to install the Tor client and the Meek plugin on the targeted system. They leveraged an exploit involving the Sticky Keys accessibility feature, where they replaced the legitimate executable with the Windows Command Prompt (cmd.exe) file. This provides the attacker a shell that they can use to execute commands with SYSTEM-level privileges, including to add or modify accounts.\nThe script that executes the Sticky Keys exploit also creates a Windows service named “Google Update” to ensure that the backdoor remains even after the system has been rebooted.\n“APT29 adopted domain fronting long before these techniques were widely known,” said FireEye’s Matthew Dunwoody. “By employing a publicly available implementation, they were able to hide their network traffic, with minimal research or development, and with tools that are difficult to attribute. Detecting this activity on the network requires visibility into TLS connections and effective network signatures.”\nRelated: Cyberspies Launch U.S. Attacks Hours After Trump Elected\nRelated: U.S. Gov's \"GRIZZLY STEPPE\" Report Fails to Achieve Purpose","url":"https:\/\/www.securityweek.com\/apt29-cyberspies-use-domain-fronting-evade-detection"},{"Unnamed: 0":2,"query":"APT29","text":"Russian Hacker Tool Uses Legitimate Web Services to Hide Attacks: FireEye\r\n\nHAMMERTOSS Malware From Russian Hackers Uses Popular Web Services to Conceal Attacks\nA group of sophisticated hackers from Russia are using a malware tool that helps them hide Malicious activity within legitimate network traffic by leveraging common web services such as Twitter, GitHub and cloud storage providers, FireEye said Wednesday.\nThe malicious backdoor, which FireEye has dubbed “HAMMERTOSS”, was first discovered by the security firm in early 2015 and is being used by a Russian APT group to relay commands and extract data from compromised targets.\nThe threat actor group behind HAMMERTOSS is tracked by FireEye as APT29, a group that the company describes as “one of the most capable” threat groups they track.\nFireEye researchers explained that the malware communication process used by HAMMERTOSS could be broken down into several stages to explain how the tool operates, receives instructions, and extracts information from a victim’s network.\n“HAMMERTOSS combines all of the best practices of malware development,” Jordan Berry, a Threat Intelligence Analyst at FireEye, told SecurityWeek.\n\nThe first stage leverages Twitter, and utilizes specific accounts that are created by a predictable algorithm and changed daily.\n“In the second stage, the malware looks for a tweet containing a URL and a hashtag,” Berry said. “The URL will direct the malware implant to download an image.”\nStage-three downloads the image as directed by the tweet, which contains appended and encrypted data at the end of the file and has instructions for the malware.\n“While the image appears normal, it actually contains steganographic data. Steganography is the practice of concealing a message, image, or file within another message, image, or file,” FireEye’s report explained.\nFinally, the malware uses PowerShell to execute command on the compromised host and send that information to a cloud storage provider.  \n“These techniques have been used by other threat groups in the past in the singular, but the whole operation in total is what is what’s really unique about HAMMERTOSS,” Jen Weedon, Threat Intelligence Manager at FireEye, told SecurityWeek. The APT29 attackers are suspected by FireEye to be a Russian APT group, and also believed to be connected to MiniDuke and OnionDuke attack campaigns.  \nHAMMERTOSS isn’t being deployed by the attackers in a wide manner, Weedon said, adding that the malware is likely being used as a backup tool in the event its primary tools were discovered.\n“HAMMERTOSS seems to be only deployed against critical targets, so we think [the attackers] are only using it when other tools aren’t working, or if their operation has been disrupted in some way,” she said.\n“We speculate that APT29 may make modifications to HAMMERTOSS or abandon it altogether and develop a new tool if they discover incident responders or antivirus software is detecting it,” FireEye’s report concluded. \"The group has demonstrated an understanding of network defenders’ countermeasures. During our investigations, APT29 continually deployed new versions of backdoors to fix bugs and add functions, as well as kept tabs on network defenders’ activities to counter attempts to clean the client’s system to maintain access to the victim environment.\"\nFireEye told SecurityWeek that it has been in touch with both Twitter and the cloud storage provider(s) used in relation to the few attacks campaigns they have witnessed. FireEye researchers would not disclose the cloud storage provider by name, only saying that it was a top three provider of cloud storage services.\nAs of the time of publishing, an MD5 for HAMMERTOSS provided by FireEye was detected by just 4 of 56 anti-malware engines on VirusTotal.\nThe full report (PDF) from FireEye is available online, and FireEye produced a short video (below) which explained the overall threat.\n\n","url":"https:\/\/www.securityweek.com\/russian-hacker-tool-uses-legitimate-web-services-hide-attacks-fireeye"},{"Unnamed: 0":3,"query":"APT29","text":"Norway Accuses Russia of Cyberattack\r\n\nOslo - Norway's foreign ministry, army and other institutions were targeted in a recent cyberattack by a group suspected of ties to Russian authorities, Norwegian intelligence -- which was among the targets -- said Friday.\nKnown as APT 29, the group singled out by Oslo has already been accused of hacking interference in the US election last year.\n\"Nine different email accounts were targeted in an attempt at what is called spear phishing, in other words malicious emails,\" Arne Christian Haugstoyl, an official with Norway's intelligence service PST, told television channel TV2.\n\"It's difficult to know what the goal\" of the operation was, he said, adding that Norway was alerted to the attack by an allied country.\nHe described APT 29 as a group \"with links to the Russian authorities\".\nPST spokesman Martin Bernsen, quoted by daily Verdens Gang (VG), said there was \"no reason to believe that classified information had been obtained in connection with the attack.\"\nIn addition to the foreign ministry, the army and PST itself, the attack -- the date of which was not disclosed -- also targeted the Norwegian radiation protection agency, a school and the parliamentary group of the Labour party, the traditionally dominant political party in Norway but which is currently in opposition.\nLegislative elections are scheduled for September 11, though no link has been made to the vote.\nNorway, a NATO member, and its neighbor Russia normally enjoy good relations but ties have grown more tense in the wake of the Ukraine crisis.\nThe Scandinavian country on Wednesday summoned the Russian ambassador to lodge a protest after Moscow refused visas to two senior lawmakers in a move Oslo denounced as \"unjustifiable\".\nRussia said the visa refusal was a reaction to Norway's participation in EU economic sanctions against it over the Ukraine crisis.\nMoscow was also angered by the recent deployment of some 300 US soldiers on Norwegian soil.","url":"https:\/\/www.securityweek.com\/norway-accuses-russia-cyberattack"},{"Unnamed: 0":4,"query":"APT29","text":"Google Warns Users of Recent State-sponsored Attacks\r\n\nGoogle Warns Journalists and Activists About Recent State-Sponsored Attacks\nOver the last few days, Google has delivered a batch of warnings about potential government-backed attacks against numerous journalists, academics and activists. Many of the recipients have announced their personal warnings on Twitter. There are some differences in the wording of some of the warnings, but Google has confirmed that the Twitter postings appear to be authentic.\nGoogle has been issuing such warnings since 2012. At first they were simple text alerts across the top of the recipients' Gmail page. In March of this year it started to use the larger more noticeable banners that are now appearing. The warnings do not indicate that an account has actually been compromised; only that Google researchers have seen indications of an attempt against the account.\nThe warnings are also not timely. The attack indicators were likely noticed up to a month earlier. Google does not issue immediate warnings for fear that this will allow attackers to determine the method of discovery. This time lapse has led to certain assumptions that the attackers are likely to be the Russian actors, possibly APT28 or APT29, that were linked to attacks against the Democrats, supposedly to influence the election. (Last month, Russian hackers were also linked with targeting journalists investigating the MH17 crash.)\n\nThis, however, has to be conjecture. Google does not publicly provide any evidence on the identity of the attackers -- and at least one target is a Hong-Kong-based Chinese activist (Joshua Wong Chi-fung).\n\"Google has been secretive about the algorithms and criteria it uses to determine that a potential attack is state-sponsored,\" explains ESET senior research fellow David Harley; adding that such secrecy about proprietary algorithms is not unusual in the security industry. \"The relationship with the APT29 targeted malware is speculative, but I can't say there isn't a connection. If an attack is based on code that is associated with known state-sponsored attacks, that could be another indicator, if you have that sort of information. Google isn't exactly known for a spirit of friendly cooperation with the security industry at large, but it certainly has security resources.\"\nThere is, however, an element of hysteria about this current batch of warnings; as if users need to take different precautions against nation attacks than they do against everyday criminal attacks. Activists are more likely to be attacked for political reasons, and in some cases the consequences could be more dire -- but the defenses remain the same as those everybody should be using as a matter of course.\n\"Journalists and professors already know what they should do - and if they don't, they can easily look it up. If they don't already follow best practices it's because they suffer from the fallacy that they aren't important enough to target,\" comments F-Secure's Sean Sullivan. It is certainly true that users receiving Google warnings should take immediate steps to confirm the integrity of their account: Google doesn't say the attack was successful, but nor does it say it failed.\nCaleb Chen, who works with Private Internet Access, points out that state-sponsored attacks may be more prevalent than is commonly thought. Google says only that it is likely to happen to less than 0.1% of its users. If there are a billion Gmail users, he suggests, those figures mean that up to a million may have seen state-sponsored probing. \"As cyber-attacks continue to proliferate, often times across borders, expect reports of this type of probing to rise in the future.\" \nThere is also an irony about warnings being attributed to foreign governments coming at the same time as the US and particularly the UK governments are increasing their own surveillance capabilities. Luis Corrons, technical director at PandaLabs insists there is a difference. \"One thing is knowing that governments are harvesting loads of information from everyone, and another thing is an attack targeted at you, so they can compromise your computer and access (steal) all your information, sources, etc.\"\nNevertheless, Chen reports a 30% spike in VPN sales from the UK in the week in which the IP Bill completed its course through parliament. While standard computer defenses are required to protect accounts, VPNs are now also required to protect communications -- especially those of activists of any persuasion.\nAccount defenses obviously include strong passwords, 2FA where possible, reputable anti-virus, and an awareness of spear-phishing techniques; but Corrons offers one other piece of advice for journalists and activists: \"Ideally have all your sensitive information in a different computer to the one you use for your emails, Internet, etc. Even better if this one is not connected to the Internet.\"","url":"https:\/\/www.securityweek.com\/google-warns-users-recent-state-sponsored-attacks"},{"Unnamed: 0":5,"query":"APT29","text":"Democracy at Risk from Poor Cybersecurity, Foreign Interference: Survey\r\n\nSurvey Shows Distinct Voter Concern for Elections and Cybersecurity\nFor more than a year, a single thread has dominated American news: foreign interference in US elections. It started in June 2016 in the run-up to the 2016 presidential election, when the Democratic National Committee (DNC) announced it had been hacked, and CrowdStrike accused Russia-based Cozy Bear (APT 29).\nSince then, the ramifications have rarely been out of the news. In October 2016 the U.S. government formally accused Russia of being behind the cyberattacks, and by December it became known that the CIA believed that \"Russia intervened in the 2016 election to help Donald Trump win the presidency, rather than just to undermine confidence in the U.S. electoral system,\" The Washington Post reported.\nSince then, emphasis has switched to questioning the extent to which the Trump electoral team may or may not have known about or colluded with Russia in order to win the election; and whether it has or has not attempted to hinder or subvert subsequent law enforcement investigations. This has continued throughout 2017 until Wednesday this week when Rep. Brad Sherman (D-Calif.) formally introduced an article of impeachment against President Trump.\nThe article of impeachment revolves around Trump's dismissal of FBI director James Comey allegedly to hinder the FBI's investigation into former National Security Advisor, General Michael Flynn. \"In all of this, Donald John Trump has acted in a manner contrary to his trust as President and subversive of constitutional government, to the great prejudice of the cause of law and justice and to the manifest injury of the people of the United States.\"\nThe huge and apparently unending ramifications of what started as just another cyber hack has caused cybersecurity firm Carbon Black to wonder what effect the cyber element has had on the American electorate. In June 2017, it conducted a nationwide survey (PDF) of 5,000 eligible U.S. voters, with particular reference to the upcoming midterm 2018 elections.\nIn an associated blog post Carbon Black CEO Patrick Morley commented, \"In perhaps the most startling revelation from the survey, 1 in 4 voters said they will consider not voting in upcoming elections over cybersecurity fears.\"\nIn reality, this figure is easily covered by existing non-voters. Approximately only 57.9% of voters voted in the 2016 election, down less than 1% from the 58.6% that voted in 2012. So, while 25% of voters now say they may not vote in the midterms, this may have no effect on the actual voter turnout.\nA second area where the obvious conclusion may not be the accurate conclusion can be seen in 'voter perception on election influence'. According to the survey, \"47% of voters said they believe the 2016 U.S. election was influenced by foreign entities.\" However, there could be a strong element of 'sore loser' in these figures. There is an aspect of tribalism in political affiliation -- some people will always vote for one particular party simply because of tribal affiliations. \nIt is estimated that 48% of the electorate voted for Clinton (slightly more than the estimated 46% who voted Trump). There will be a strong incentive for the losing 48% to blame external causes on their loss -- and that could account for a large proportion of the 47% of responding voters who told Carbon Black that the result was influenced by foreign entities.\nDespite not being able to definitively relate current sentiment to a past or future threat against electoral democracy, the Carbon Black survey nevertheless shows distinct voter concern for elections and cybersecurity. Several of the survey queries are unambiguous, and the results can be taken at face value. Forty-five percent of voters believe that Russia poses the biggest cybersecurity risk to U.S. elections. Of the remaining 55%, \"20% said the United States itself; 17% said North Korea; 11% said China; and 4% said Iran. (3% answered 'other.')\" notes the report.\nFifty-four percent of respondents \"said the NSA leaks negatively impacted their trust in the U.S. election system to keep data safe;\" and 44% \"said they believe Russia will 'Be back' to influence future elections.\"\nCarbon Black concludes, \"Cyberattacks against our elections seed doubt in democracy. The idea that even a single voter is willing to forfeit their vote in fear of a cyberattack is startling. The fact that 1 in 4 voters said they would be willing to do so speaks volumes about how deeply this doubt has penetrated. The alleged cyberattacks surrounding the 2016 elections were a clarion call that foreign entities are motivated to disrupt U.S. elections.\" More starkly, it adds, \"Our democracy is at risk.\"\nReality is probably not as extreme as this suggests. Political sentiment polling is very difficult, and Carbon Black has failed to eliminate 'other causes' in some of its questions. It might, for example, have been better to question 5,000 eligible voters that had actually voted in 2016 to get a more accurate picture of future voting intentions.\nNevertheless, it is clear that there is strong voter concern over the future of elections and cybersecurity. The report makes five proposals designed \"to help restore voter confidence.\" The first is to implement stronger cybersecurity protection for online registration systems and voter databases. The second is to limit (or discontinue) the use of electronic voting machines. The third is to create an auditable paper trail of votes in every state and precinct. The fourth is to prohibit online voting.\nThe fifth is arguably the most important. In January 2017, then U.S. Homeland Security Secretary Jeh Johnson said, \"I have determined that election infrastructure in this country should be designated as a subsector of the existing Government Facilities critical infrastructure sector. Given the vital role elections play in this country, it is clear that certain systems and assets of election infrastructure meet the definition of critical infrastructure, in fact and in law.\"\nIn its fifth recommendation, Carbon Black now calls for the government to \"commit the same urgency and resources to protecting its elections as it does for 'traditional' critical infrastructure.\"","url":"https:\/\/www.securityweek.com\/democracy-risk-poor-cybersecurity-foreign-interference-survey"},{"Unnamed: 0":6,"query":"APT29","text":"Cyberspies Launch U.S. Attacks Hours After Trump Elected\r\n\nJust hours after Donald Trump was elected president of the United States, researchers spotted a series of election-themed spear-phishing attacks aimed at think tanks and non-governmental organizations (NGOs) in the U.S.\nAccording to security firm Volexity, the attacks were launched by a Russia-linked threat group known as The Dukes, APT29, Cozy Bear and Cozy Duke. This and another actor believed to be sponsored by the Russian government, known as Pawn Storm and Fancy Bear, are suspected of launching attacks against the U.S. Democratic Party before the presidential election.\nVolexity said the Dukes sent out spear-phishing emails from Gmail accounts and compromised email accounts at Harvard’s Faculty of Arts and Sciences (FAS). The targeted users specialize in national security, international affairs, defense, public policy, and European and Asian studies.\nThe Dukes has been targeting think tanks and NGOs in the United States since July 2015. However, in August 2016, the attackers started using a new piece of malware, which Volexity has dubbed “PowerDuke.”\nUnlike in previous attacks, which involved ZIP files containing malicious executables, the threat group delivered PowerDuke via emails carrying macro-enabled Word and Excel documents. The malicious documents were set up to install a downloader designed to fetch the PowerDuke backdoor.\nPowerDuke was also used in attacks launched in October and the ones observed on November 9, after the presidential election in the U.S.\nThe first attack wave spotted after the elections involved fake eFax emails titled “The Shocking Truth About Election Rigging in the United States.” This wave was similar to earlier attacks where the APT actor used links pointing to ZIP files to deliver its backdoors.\nThe second attack used the same eFax theme, but the emails were titled “Elections Outcome Could Be Revised [Facts of Elections Fraud]” and they delivered PowerDuke via macro-enabled documents.\nThe third wave involved emails coming from a fas.harvard.edu address and messages apparently sent via the “Harvard PDF Mobile Service.” Titled “Why American Elections Are Flawed,” these emails also carried PowerDuke malware.\nThe next two waves also leveraged Harvard FAS email addresses and they appeared to be forwarded from someone at the Clinton Foundation. The hacker calling himself Guccifer 2.0, which experts believe could be a persona used by Russian cyberspies, claimed in October that he had hacked the Clinton Foundation, but the organization refuted the claims.\nPowerDuke, which is deployed on a system only after anti-analysis checks are conducted, is capable of collecting information about the infected device, creating and terminating processes, downloading and uploading files, and obtaining text from the current window. The backdoor is hidden in innocent-looking PNG image files and some of its components are loaded only in memory.\nThe U.S. has officially accused Russia of launching cyberattacks in an effort to interfere with the presidential election. Washington has vowed to respond and some officials even claim the U.S. has already hacked Russia’s critical infrastructure. Moscow has demanded an explanation for these reports.\nRelated: Clinton - 'Grave' Concern Russia Interfering in U.S. Elections\nRelated: Russia Hacks U.S. Networks 'All the Time', Says Spy Chief\nRelated: State Election System Hacking Linked to Previous Attacks","url":"https:\/\/www.securityweek.com\/cyberspies-launch-us-attacks-hours-after-trump-elected"},{"Unnamed: 0":7,"query":"APT29","text":"Early Toolsets Used by \"Dukes\" Attackers Suggest Russian Roots\r\n\nA new report published last week by F-Secure details the activities of the threat group behind the notorious Duke malware family, and points to the numerous clues suggesting that the actor is sponsored by the Russian government.\nEspionage operations involving threats such as CosmicDuke, MiniDuke, OnionDuke, CozyDuke (CozyBear\/CozyCar), SeaDuke and CloudDuke have been analyzed by several security firms over the past years.\nResearchers believe the advanced persistent threat (APT) actor behind these threats, dubbed “the Dukes” and APT29, has been active since at least 2008. The group has mainly focused on Western government institutions, political think tanks, government contractors, and other organizations that possess information related to foreign and security policy decisions.\nKaspersky Lab was the first security firm to report finding a malware of the Duke family when they revealed the existence of MiniDuke back in 2013. However, according to F-Secure, the first malware toolset used by the Dukes appears to be PinchDuke, which had been leveraged in various campaigns between November 2008 and the spring of 2010.\nPinchDuke, which consisted of loaders and a Trojan designed for data theft, was first used to target organizations in Georgia, Turkey, Uganda, and the United States. One of the clues suggesting that the threat was developed by Russian speakers is an error message written in Russian found in many of the PinchDuke samples.\nAnother early version of Duke malware was GeminiDuke, for which experts discovered a sample compiled in January 2009. The GeminiDuke toolset was mainly designed for collecting information on the infected computer’s configuration.\nThe timezone of the timestamps in the GeminiDuke samples analyzed by F-Secure was UTC+3 for samples compiled during winter and UTC+4 for samples compiled during summer. These time zones correspond to Moscow Standard Time (MST) before Russia decided to stop following Daylight Savings Time in 2011. The samples compiled after 2011 still follow the same pattern, but experts believe the malware developers simply failed to update the computer they were using to compile GeminiDuke.\nThe most recent versions of Duke malware toolsets are SeaDuke, first used in October 2014, HammerDuke (HAMMERTOSS), first spotted in January 2015, and CloudDuke (MiniDionis\/CloudLock), observed since June 2015.\nEver since the first Duke malware samples were discovered, security firms attributed the threats to Russian-speaking actors. In January 2015, F-Secure stated that a Russian government agency was likely behind the attacks. FireEye reached the same conclusion in July when it published a detailed report on the HAMMERTOSS backdoor.\nF-Secure believes that the Duke attacks are Russian state-sponsored operations based on the attackers’ apparent motivations and objectives. First of all, experts say all targets possessed foreign and security policy information that could be highly valuable to Russia.\nFurthermore, at one point, CosmicDuke had been used to target individuals involved in trafficking illegal substances. Since such victims were spotted only in Russia, researchers believe the country’s law enforcement agencies might have used CosmicDuke as legal spyware.\nThe times of day in which the malware was compiled and the presence of Russian artefacts in discovered samples simply point to actors located in Russia. However, the considerable financial support and the fact that they are very well organized suggests that the threat group is backed by a government, F-Secure said.\n“Based on the length of the Dukes’ activity, our estimate of the amount of resources invested in the operation and the fact that their activity only appears to be increasing, we believe the group to have significant and most critically, stable financial backing. The Dukes have consistently operated large-scale campaigns against high-profile targets while concurrently engaging in smaller, more targeted campaigns with apparent coordination and no evidence of unintentional overlap or operational clashes,” F-Secure explained in its report on the Dukes. “We therefore believe the Dukes to be a single, large, well-coordinated organization with clear separation of responsibilities and targets.”\nDespite the fact that their operations and tools have been exposed and analyzed by the IT security community, the Dukes don’t seem to be discouraged.\n“This apparent disregard for publicity suggests, in our opinion, that the benefactors of the Dukes is so powerful and so tightly connected to the group that the Dukes are able to operate with no apparent fear of repercussions on getting caught,” F-Secure said. “We believe the only benefactor with the power to offer such comprehensive protection would be the government of the nation from which the group operates. We therefore believe the Dukes to work either within or directly for a government, thus ruling out the possibility of a criminal gang or another third party.”","url":"https:\/\/www.securityweek.com\/early-toolsets-used-dukes-attackers-suggest-russian-roots"},{"Unnamed: 0":8,"query":"APT29","text":"U.S. Officially Accuses Russia of Election Hacks\r\n\nThe U.S. government has officially accused Russia of being behind cyberattacks against American political organizations with the intent of interfering with the upcoming Presidential election in November.\n“The U.S. Intelligence Community (USIC) is confident that the Russian Government directed the recent compromises of e-mails from US persons and institutions, including from US political organizations,” a joint statement from the Department of Homeland Security (DHS) and Office of the Director of National Intelligence said.\n“The recent disclosures of alleged hacked e-mails on sites like DCLeaks.com and WikiLeaks and by the Guccifer 2.0 online persona are consistent with the methods and motivations of Russian-directed efforts. These thefts and disclosures are intended to interfere with the US election process. Such activity is not new to Moscow—the Russians have used similar tactics and techniques across Europe and Eurasia, for example, to influence public opinion there,” the statement reads.\n\"We believe, based on the scope and sensitivity of these efforts, that only Russia's senior-most officials could have authorized these activities,\" the statement adds.\n“Some states have also recently seen scanning and probing of their election-related systems, which in most cases originated from servers operated by a Russian company. However, we are not now in a position to attribute this activity to the Russian Government,” U.S. officials said.\nThe USIC and DHS say it would be “extremely difficult for someone, including a nation-state actor, to alter actual ballot counts or election results” by cyberattack or breach. \nFollowing the accusations, U.S. officals warned that it would act when it wants to protect national interests.\n\"We will take action to protect our interests, including in cyberspace, and we will do so at a time and place of our choosing,\" a senior administration official told AFP.\nIn response, Moscow called the allegations \"rubbish.\"\nThe decentralized nature of the U.S election system and the number of protections state and local election officials have in place will help make a successful attack challenging, the U.S. says.\nEarly last month, Director of National Intelligence James Clapper said that Russia hacks U.S. computer networks \"all the time”.\n\"The Russians hack our systems all the time, not just government but also corporate\" and personal systems, Director of National Intelligence James Clapper said, though he did not directly say whether Moscow was behind the DNC hack at the time.\nIn August, researchers from two security firms uncovered evidence that they say linked a Russian threat actor to the cyberattack targeting the U.S. Democratic Congressional Campaign Committee (DCCC).\nThe DCCC was the second Democratic Party committee targeted by hackers over the summer. The first was the Democratic National Committee (DNC) which, according to several security companies, was targeted by two different Russia-linked advanced persistent threat (APT) actors: Cozy Bear, also known as Cozy Duke and APT29; and Fancy Bear, also known as APT28, Pawn Storm, Sofacy, Tsar Team, Strontium and Sednit.\nIn July, SecureWorks reported that Fancy Bear had targeted thousands of Google accounts, including ones belonging to people working for or associated with the DNC and Hillary Clinton’s presidential campaign.\nRelated: U.S. Vows Response to Russian Hack at 'Time and Place of our Choosing'\nRelated: Hacking of DNC Raises Fears of Cyber Attack on U.S. Election\nRelated: US Election - Official Probe Slams Clinton's Private Email Use \nRelated: 55 Million Exposed After Hack of Philippine Election Site","url":"https:\/\/www.securityweek.com\/us-officially-accuses-russia-election-hacks"},{"Unnamed: 0":9,"query":"APT29","text":"North Korea's DDoS Attacks Analyzed Based on IPs\r\n\nArbor Networks has used the IP addresses shared recently by United States authorities to analyze distributed denial-of-service (DDoS) attacks attributed to the North Korean government. The security firm believes the data may not be as useful for organizations as the U.S. hopes.\nEarlier this month, the United States Computer Emergency Readiness Team (US-CERT) released a technical alert on behalf of the DHS and the FBI to warn organizations of North Korea’s Hidden Cobra activities, particularly its DDoS botnet infrastructure.\nHidden Cobra, a threat actor tracked by others as Lazarus Group, is believed to be behind several high-profile attacks, including the ones targeting Sony Pictures, Bangladesh’s central bank, and banks in Poland. Links have also been found between the group and the recent WannaCry ransomware attacks.\nThe US-CERT report focused on a DDoS tool dubbed DeltaCharlie. The organization has shared information on exploits, malware, IP addresses, file hashes, network signatures, and YARA rules associated with Hidden Cobra in an effort to help defenders detect the group’s attacks.\nData from Arbor Networks’ ATLAS infrastructure showed that 24 of the 632 IP addresses provided by US authorities were involved in at least one DDoS attack over a 105-day period between March 1 and June 13, 2017.\nThe company pointed out that its ATLAS infrastructure, which relies on data shared anonymously by nearly 400 globally distributed service providers, covers roughly one-third of Internet traffic, which means the actual number of IPs involved in attacks during this period is likely higher.\nAccording to Arbor, 16 IPs participated in more than one of the 164 attacks observed by the company. The largest attack peaked at 4.3 Gbps, which is more than enough to disrupt unprotected systems, and the longest attack lasted for 44 hours.\nWhile the largest concentration of IP addresses in the US-CERT report were in Russia, Arbor traced the highest percentage of IPs to Saudi Arabia (6 of 24) and the United Arab Emirates (5 of 24).\nThe IPs monitored by Arbor were involved in DDoS attacks on most days, but there were some periods with no activity. The longest period with no activity started on April 5, shortly after North Korea launched a missile into the Sea of Japan. While it’s unclear if the two events are in any way related, experts noted that DDoS attacks are often timed with significant geopolitical events.\nOf the 164 DDoS attacks observed by researchers, nearly half were aimed at the United States, followed by the U.K., Australia, France, Saudi Arabia and Singapore.\nSecurityWeek has reached out to several other DDoS protection companies, but none of them could immediately provide any information on the Hidden Cobra attacks.\nArbor said it conducted an analysis due to the fact that the US-CERT report, which the company has described as vague, was not clear on whether the IPs were bots or part of command and control (C&C) infrastructure, and it also failed to clarify if the IPs were “innocent” reflectors.\nArbor’s analysis – based on the types of attacks observed – suggests that the report lists open reflectors abused by DeltaCharlie and not the actual bots.\n“This lack of context makes it difficult for responders to act. Security analysts would treat a list of command-and-control servers differently from a list of bots, and differently from a list of reflectors,” experts said. “Blindly loading such indicators into security systems could potentially cause more harm than good.”\nThis is not the first time the cybersecurity community has criticized a joint report from the FBI and the DHS. The report released late last year on GRIZZLY STEPPE activity, better known as Cozy Bear (APT29) and Fancy Bear (APT28 and Pawn Storm), failed to demonstrate that Russia was behind the U.S. election hacks.\nRelated: IoT Botnets Fuel DDoS Attacks Growth","url":"https:\/\/www.securityweek.com\/north-koreas-ddos-attacks-analyzed-based-ips"},{"Unnamed: 0":10,"query":"APT29","text":"\"Man-in-the-Cloud\" Attacks Leverage Storage Services to Steal Data\r\n\nPopular cloud storage services such as Google Drive and Dropbox can be abused by malicious actors in what experts call “Man-in-the-Cloud” (MITC) attacks.\nImperva’s latest Hacker Intelligence Initiative report explains in detail how attackers can easily abuse common file synchronization services for command and control (C&C) communications, endpoint hacking, remote access, and data exfiltration simply by reconfiguring them.\nOne worrying aspect highlighted by Imperva in its report is that the attackers don’t even need to compromise targeted users’ credentials to gain access to their file synchronization accounts.\nResearchers have conducted tests on Microsoft OneDrive, Dropbox, Google Drive, and Box, cloud applications that are utilized by many organizations and their employees to make data available to multiple users and devices.\nThese solutions work by connecting individual devices to a central hub in the cloud through the same user account. When a file is added to a device’s local repository, it is automatically synchronized with the hub and delivered to other devices.\nIn an effort to make it easier to manage files, many popular applications don’t require users to enter their account credentials each time synchronization is performed. Instead, authentication to the cloud relies on a synchronization token that is usually stored in a file, a registry, or the Windows Credential Manager on the user’s machine.\nThe problem, according to experts, is that even though this synchronization token is encrypted on the local device, it can be easily accessed and decrypted by an attacker. Malicious actors can synchronize their own devices with the victim’s account simply by copying this token to the right place on their own system.\nImperva researcher have developed a tool that can manipulate synchronization tokens to allow an attacker to gain access to the victim’s account and implicitly their data. The tool can be delivered to the victim via phishing or drive-by download attacks, experts said.\nOnce they have access to the victim’s account, attackers can steal the files placed in the sync folder. In addition to stealing information, attackers can also manipulate the files located in this folder (e.g. hold them for ransom by encrypting them, plant malicious code in existing files).\nMalicious actors that want to maintain access to the victim’s machine can also set up a backdoor. This can be useful for using the victim’s cloud storage as part of an operation’s C&C infrastructure.\nMITC attacks have several advantages. First of all, the synchronization tokens are easy to obtain and, in some cases, the attacker can maintain access to the account even after users change their password. For example, in the case of Dropbox, the tokens are not refreshed or revoked even if the password is changed. Google Drive has a more secure design since changing the password revokes all tokens and requires users to re-authenticate each device using account credentials.\nAnother advantage of MITC attacks is the fact that malicious code is typically not left running on the targeted machine, and data flows out through a standard, encrypted channel, which makes it less likely to raise any suspicion, experts said. Furthermore, even if the attack is detected, the victim might have to cancel the breached account to keep hackers out.\nAccording to Imperva, attacks based on the architecture described in the company’s report have been spotted in the wild. One example is the Inception Framework analyzed last year by researchers at Blue Coat.\nThere seems to be an increasing trend in the use of legitimate services by threat actors. Last month, FireEye published a report on HAMMERTOSS, a malicious backdoor leveraged by the Russian group known as APT29. HAMMERTOSS attacks involve the use of Twitter and GitHub for C&C communications, and cloud storage services for data exfiltration.\nImperva advises organizations to mitigate such attacks by using cloud access security broker solutions to identify the compromise of cloud storage accounts, and by deploying database activity monitoring (DAM) and file activity monitoring (FAM) services to identify the abuse of internal data resources.\nImperva's Hacker Intelligence Initiative report on Man-in-the-Cloud (MITC) attacks is available online in PDF format.","url":"https:\/\/www.securityweek.com\/man-cloud-attacks-leverage-storage-services-steal-data"}]