[{"Unnamed: 0":0,"query":"APT3","text":"For the roughly three decades that the commercial cybersecurity industry has existed, it has struggled with a fundamental problem –  a lack of realistic attack testing to determine whether the products that companies and consumers buy actually work in stopping real “in-the-wild” threats. The problem is a challenging one: If you want to test a security technology against a specific threat, by definition, that threat must already be known to someone and, thus, cannot qualify as a “zero-day” attack. It is the cybersecurity equivalent of Heisenberg’s uncertainty principle: The more precisely you can determine the efficacy of a security product against tested malware and exploits, the less realistic that result is, since to be tested, those threats have to be already known and widely available. \nThis was the reason I was so excited last summer when CrowdStrike® was approached by MITRE (a federally funded research and development center) with a request to evaluate our Falcon endpoint protection solution in the first realistic public adversary emulation. Unlike other public tests, this evaluation was not going to rely on known malware and exploits, but instead mimic the tradecraft of a real and sophisticated nation-state adversary on a cyber range setup at MITRE. CrowdStrike did not pay MITRE to conduct this evaluation. MITRE’s independence and nonprofit status is yet another important differentiation and enhances the credibility of their testing process.\nThe goal of the simulation was to not just detect an adversary, but to comprehensively determine what level of visibility the product provides against all of the tradecraft utilized, and to map those results to MITRE’s ATT&CK™ framework. The adversary picked in our evaluation was GOTHIC PANDA (also known as APT3), a sophisticated hacking team linked to the Chinese government’s Ministry of State Security (MSS) and whose contractors were recently indicted by U.S. Justice Department. The group is known for leveraging zero-day exploits, use of common websites such as GitHub for command and control channels to evade blacklisting, and for targeting numerous industries, including Aerospace and defense, chemicals, energy, finance, healthcare, industrial goods, NGO\/international organizations, technology and transportation.\nToday I’m thrilled to announce that CrowdStrike Falcon, backed by our elite Falcon OverWatch™ team, aced the simulation – detecting and providing visibility into nearly every technique tested by the MITRE team. This should be no surprise to our customers, who observe our unmatched ability to stop breaches in their environments daily. Our OverWatch team detects, stops and notifies our customers of about 400 serious breach attempts every single week – two per hour, on average.\nThe ATT&CK framework matrix results for CrowdStrike are below. The green and yellow cells indicate all of the techniques that Falcon had detection or visibility for. The white and grey cells are those techniques that were not part of the testing, as they were either not part of GOTHIC PANDA’s suite of tactics or were out-of-scope for this simulation. The one red cell below – “Exfiltration Over Command and Control Channel” (in this case, DNS) – was the only one missed by Falcon. This one small visibility gap has since been corrected and added to our platform.\nCrowdStrike Falcon’s ATT&CK evaluation of GOTHIC PANDA tactics and techniques\n\nWe are very pleased that in the months following our testing, we have worked closely with MITRE to receive approval to publish our results for public viewing. The report is available for download here: Download the Report.\nWe believe that this emulation test is an important step forward for our industry, providing the first comprehensive and easily discernible evaluation of the real-world efficacy of security products. We encourage all vendors to participate in this type of testing going forward, and applaud MITRE’s Leveraging External Transformational Solutions (LETS) program for this important and groundbreaking achievement. We are also very grateful to the MITRE team for the valuable feedback they have provided to us in the course of this simulation, and for the opportunity to improve our technology to benefit all of our customers.  We believe in open and transparent testing by credible and independent organizations like MITRE.  We also encourage all customers and analysts to demand this type of independent testing to enable our industry to improve and develop more effective solutions.\nThe results of this emulation come on the heels of CrowdStrike being positioned highest for “ability to execute” and furthest for “completeness of vision” in the Visionary Quadrant of the 2018 Gartner Magic Quadrant for endpoint protection platforms, further validating our leadership position in the endpoint protection space. I would encourage you to think beyond vendors that wave their hands and try to misdirect customers that independent testing and independent analyst reports are not relevant when they don’t suit their narrative. They are critical to separating the marketing talk from the solutions that can protect customers from real-world threats.","url":"https:\/\/www.crowdstrike.com\/blog\/crowdstrike-falcon-defeats-gothic-panda-in-mitre-nation-state-emulation-test\/"},{"Unnamed: 0":1,"query":"APT3","text":"Introduction\nIn April 2017, a previously unknown group calling itself IntrusionTruth began releasing blog posts detailing individuals believed to be associated with major Chinese intrusion campaigns. Although the group’s exact motives remain unclear, its initial tranche of information exposed individuals connected to long-running GOTHIC PANDA (APT3) operations, culminating in a connection to the Chinese firm Boyusec (博御信息) and, ultimately, Chinese Ministry of State Security (MSS) entities in Guangzhou.\nRecently, in July and August 2018, IntrusionTruth has returned with new reporting regarding actors with ties to historic STONE PANDA (APT10) activity and has ultimately associated them with the MSS Tianjin Bureau (天津市国家安全局). Though CrowdStrike® Falcon Intelligence™ is currently unable to confirm all of the details provided in these most recent posts with a high degree of confidence, several key pieces of information can be verified.\n\nSeveral of the named individuals have been active registering domains as recently as June 2018, and they responded to the IntrusionTruth blog posts by scrubbing their social media or by following IntrusionTruth’s Twitter account.\nNamed individuals ZHANG Shilong and GAO Qiang have significant connections to known Chinese hacking forums, and they have sourced tools currently in use by China-based cyber adversaries. \nZHANG has registered several sites with overlapping registrant details that show both his affiliation with several physical technology firm addresses as well as his residence in Tianjin. \nNamed firm Huaying Haitai has been connected to a Chinese Ministry of Industry and Information Technology (MIIT) sponsored attack and defense competition; this is similar to GOTHIC PANDA’s ties to an active defense lab sponsored by China Information Technology Evaluation Center (CNITSEC).\nHuaying Haitai has previously hired Chinese students with Japanese language skills; this is significant, as STONE PANDA has engaged in several campaigns targeting Japanese firms. \nThe MSS Tianjin Bureau is confirmed to be located at the described address, not far from many of the registrant addresses listed by ZHANG as well the firms GAO was likely recruiting for. \n\nMore details that may further illuminate these findings and provide a higher confidence in connecting STONE PANDA to the MSS Tianjin Bureau are likely to emerge.\nBackground\nThroughout May 2017, using a variety of historical information and open-source intelligence (OSINT), IntrusionTruth released several blog posts identifying several individuals connected to Boyusec. Though CrowdStrike Intelligence had suspected GOTHIC PANDA was an MSS contractor for several years, the IntrusionTruth posts and subsequent research by RecordedFuture into MSS ties to the China Information Technology Evaluation Center (CNITSEC\/中国信息安全测评中心) corroborated additional details from various sources and provided a higher degree of confidence. Confidence in these findings was further boosted when the U.S. Department of Justice named Boyusec and several of the described individuals in an indictment, and detailed GOTHIC PANDA tactics, techniques, and procedures (TTPs) in detail.\nCrowdStrike Falcon Intelligence was able to independently verify the majority of this information and concluded that not only is CNITSEC associated with the MSS, but its former director WU Shizhong (吴世忠) was simultaneously dual-hatted as the director of the MSS Technology\/13th Bureau (国家安全部科技局局长)1 2 3,  implying that the MSS plays a crucial role in China’s code review of foreign products and is now able to cherry pick high-value vulnerabilities from its own capable domestic bug hunting teams. CNITSEC’s role in code review for foreign entities has led to its access to Microsoft’s source code dating back to 2003 and the use by KRYPTONITE PANDA of a high-value vulnerability (CVE-2018-0802), discovered by Chinese firm Qihoo 360, a month before it was publicly revealed.\nWU Shizhong Presenting on the “Digital Silk Road” at the Second Wuzhen World Internet Conference in 2015\nAs research into the IntrusionTruth leads on STONE PANDA continues, Falcon Intelligence has already observed some consistencies with known MSS operations.\nSinking Like a STONE   \nGAO Qiang (高\/郜 强)\nMany of the personal details for GAO were scrubbed shortly after IntrusionTruth’s post introducing him went live, including his Tencent QQ account. The blog connects him to the moniker fisherxp via an initial spear-phishing campaign from 2010 previously attributed to STONE PANDA. Multiple sites with profile pictures appear to show the owner of the fisherxp accounts, though this has yet to be independently confirmed as GAO. Fisherxp’s QQ shows his alternate username as 肥猪 or “big porker”. IntrusionTruth later links GAO to several documented Uber rides to the MSS Tianjin Bureau’s office address where both his first name, Qiang\/强, and 猪 are used by the app to identify him and tie him to the QQ number 420192. CrowdStrike cannot confirm the validity of these Uber receipts at this time.\nHowever, fisherxp’s account on popular Chinese technology forum 51CTO is still active and shows that he has downloaded not only the open-source DarkComet RAT and numerous password cracking tools, but more importantly, several favorite tools used by a plethora of known Chinese cyber adversaries including Gh0st RAT 3.6, zxarps (an ARP-spoofing tool by legacy hacker LZX), and lcx.exe (a port-forwarding tool by legacy hacker LCX)4.\nZHANG Shilong (张世龙)\nZHANG was originally introduced by IntrusionTruth as a reciprocal follower of fisherxp’s Twitter account via his own @baobeilong account. Baobeilong (宝贝龙\/”Baby Dragon”) also maintained a GitHub account that had forked both the Quasar and Trochilus RATs, two open-source tools historically used by STONE PANDA, but the account has since been scrubbed. This information was verified by CrowdStrike before being removed completely. Falcon Intelligence recently independently conducted detailed analysis of the RedLeaves malware used to target numerous Japanese defense groups and found it was directly sourced from Trochilus code, but it has undergone several evolutions and contains prefixes suggesting it could also be used to target Russia and the DPRK. There is no conclusive evidence at this time that RedLeaves is solely attributed to STONE PANDA. \nBaobeilong did maintain a Flickr account with numerous pictures that proved key in identifying his location later, similar to how cpyy’s photos helped identify his affiliation to the People’s Liberation Army (PLA) in CrowdStrike’s PUTTER PANDA report.\nIntrusionTruth then drew connections from baobeilong’s other online accounts to registrant details for xiaohong[.]org, which dated back to 2007 and revealed ZHANG’s full name—ZHANG Shilong. From there, a trail of overlapping registrant details reveals ZHANG’s hanzi characters for his name (张世龙), likely one of his personal home addresses, potential work addresses and several email addresses:\n\nlong@xiaohong[.]org\nbaobei@xiaohong[.]org\natreexp@yahoo[.]com.cn \nrobin4700@foxmail[.]com\neshilong@vip.qq[.]com   \n\nSpecifically tracing registrant details from atreexp → robin4700 → eshilong shows that ZHANG was active registering sites as recently as June 5, 2018, including a personal blog where his picture and name features prominently along with several technology-related blog posts.  \nA picture from baobeilong’s Flickr account shows a fire at the Tianjin Medical Center 120\nLaoying Baichen Instruments\nThe original blog post on GAO lists his contact information in recruitment postings for two separate companies, one of which is Laoying Baichen Instruments (characters unknown at the time of this writing). No records could be found for such a firm, however, IntrusionTruth lists the address associated with it as Room 1102, Guanfu Mansion, 46 Xinkai Road, Hedong District, Tianjin (天津市河东区新开路46号冠福大厦1102). \nDuring the course of investigating Laoying and the Guanfu mansion, Falcon Intelligence noticed that the Guanfu Mansion is also the registered address of a firm called Tianjin Henglide Technology Co., Ltd. (恒利德天津科技有限公司), which is listed as one of only a few “review centers” certified by CNITSEC in Tianjin5. Laoying and Henglide are listed as being on different floors, however having a CNITSEC review center in the same building is noteworthy given CNITSEC’s connection to MSS and previous linkage to Boyusec\/GOTHIC PANDA.\nZhang is believed to have taken the photo of the fire from the Wanchan Meizhuan Mansion. This is relatively close to both the Yuyang Complex (one of Zhang’s listed registrant addresses) and the Guanfu Mansion, Laoying Baichen’s listed address.\nTianjin Huaying Haitai Science and Technology Development Company \nThe other firm GAO appears to have been recruiting for is Huaying Haitai (天津华盈海泰科技发展有限公司). As the IntrusionTruth blog post mentions, it is a registered firm with two listed representatives, Fang Ting (方亭) and Sun Lei (孙杰), and a listed address of 1906 Fuyu Mansion (天津市河西区解放南路中段西侧富裕大厦1-1906). \nSearches for more information on Huaying Haitai turned up two interesting government documents. One is a recruitment Excel sheet detailing recent graduates, their majors and their new employers and addresses. Huaying Haitai is listed as having hired a recently graduated female student from Nankai University in 2013 who majored in Japanese. This is interesting considering STONE PANDA’s extensive targeting of Japanese defense firms after this time period, but it is by no means conclusive evidence that the firm is connected to STONE PANDA.\n\nThe second government document lists Huaying Haitai as the co-organizer of a Network Security Attack and Defense competition with the Ministry of Industry and Information Technology’s (MIIT) national training entity, NSACE6. It was open for all students of Henan Province. \nNSACE appears to be a national education body that teaches network information security, including offensive activity7. This information is particularly interesting given Boyusec’s previous work at CNITSEC’s Guangdong subsidiary setting up a joint active defense lab8.  It suggests that these technology firms act as both shell companies and recruitment grounds for potential MSS use in cyber operations.\n\nMSS Tianjin Bureau\nThe most recent IntrusionTruth post assesses that GAO’s Uber rides frequently took him from Huaying’s address at the Fuyu Mansion to 85 Zhujiang Road (珠江道85号). \n\nWhen observed closely, the compound is a striking one complete with towers, a fenced perimeter with surveillance cameras, guarded entrances, and a building with a significant number of satellite dishes.\n\nThere are no markers on the building and no government listed address; however, it is apparently difficult for locals to determine where the Tianjin Bureau’s location is as well. There are several Baidu questions asking what transportation routes are best to get to that specific address. Three separate ones specifically mention the 85 Zhujiang Road address as the headquarters for the MSS’s Tianjin Bureau and the difficulty in finding its location9 10 11.\n\nAs with most cyber-enabled operations, satellite arrays are often indicative of installations with significant signals intelligence (SIGINT) capabilities. The Tianjin Bureau appears to have the potential for such capabilities, housing several large arrays that appear to have existed since at least January 2004.\nBarely visible satellite dishes from the street view of 85 Zhujiang Road outside the compound\nConclusion\nThere are still significant intelligence gaps that prevent Falcon Intelligence from making an assessment about STONE PANDA’s potential connections to the MSS Tianjin Bureau with a high degree of confidence. However, additional information is likely to materialize either directly from IntrusionTruth or from other firms in the infosec community who are undoubtedly looking at this material as well and may have unique insight of their own. Ultimately, IntrusionTruth’s prior releases on GOTHIC PANDA proved accurate and led to a U.S. Department of Justice indictment resulting in the dismantling of Boyusec. From their latest post, which contains GAO’s Uber receipts, it is clear the group’s information likely goes beyond merely available OSINT data. \nIt cannot be ignored that there are striking similarities between the entities associated with GOTHIC PANDA and the actors and firms mentioned in the blogs about STONE PANDA. In addition, FalconIntelligence notes that following the late 2015 Sino-U.S. brief cyber detente, much of the responsibility for western cyber intrusion operations was handed to the MSS as the PLA underwent an extensive reform that is still currently underway, and which is consolidating its military cyber forces under the Strategic Support Force. \nThough the detente saw an initial drop in Chinese intrusion activity, it has steadily been increasing over the past several years, with a majority of the intrusions into western firms being conducted by suspected contractors. These adversaries are tracked by CrowdStrike as GOTHIC PANDA, STONE PANDA, WICKED PANDA, JUDGMENT PANDA, and KRYPTONITE PANDA. Many of these adversaries have begun targeting supply chain and upstream providers to establish a potential platform for future operations and enable the collection of larger sets of data.\nWhile the APT1, PUTTER PANDA, and Operation CameraShy reports all exposed PLA units at a time when Chinese military hacking against western firms was rampant, the attention has now swung toward identifying MSS contractors. The exposure of STONE PANDA as an MSS contractor would be another blow to China’s current cyber operations given STONE PANDA’s prolific targeting of a variety of sectors, and may prompt an additional U.S. investigation at a tenuous time for Sino-U.S. relations during an ongoing trade war. However, it is important to note that such public revelations often force these actors to cease operations, improve their operational security (OPSEC), and then return stronger than before. As such, CrowdStrike Falcon Intelligence assesses that although Boyusec may have shuttered, elements of GOTHIC PANDA are likely to still be active. The same is likely to be true for STONE PANDA following a period of silence.   \nThe activities of STONE PANDA impact entities in the Aerospace & Defense, Government,  Healthcare, Technology,  Telecommunications Services of several nations. \nFor more information on how to incorporate intelligence on threat actors like STONE PANDA into your security strategy, please visit the Falcon Intelligence product page.\nFootnotes\n\nhttp:\/\/kjbz.mca.gov[.]cn\/article\/mzbzhzcwj\/201106\/20110600157934.shtml\nhttp:\/\/bjgwql[.]com\/a\/hezuojiaoliu\/2011\/0422\/288.htm\nhttp:\/\/alumni.ecnu.edu[.]cn\/s\/328\/t\/528\/3b\/02\/info80642.htm\nhttp:\/\/down.51cto[.]com\/424761\/down\/1\/\nhttp:\/\/www.djbh[.]net\/webdev\/web\/LevelTestOrgAction.do?p=nlbdLv3&id=402885cb35d11a540135d168e41e000c\nhttp:\/\/rjzyjsxy.zzia.edu[.]cn\/picture\/article\/25\/27\/01\/6c8b24a143f9959a85301d4527f0\/801f81cf-8f30-4aa4-8428-7f9d4e778e76.doc\nhttp:\/\/www.yingjiesheng[.]com\/job-001-607-536.html\nhttps:\/\/www.recordedfuture.com\/chinese-mss-behind-apt3\/\nhttps:\/\/zhidao.baidu[.]com\/question\/1046720364336588899.html?fr=iks&word=%CC%EC%BD%F2%CA%D0%D6%E9%BD%AD%B5%C085%BA%C5%CA%C7%CA%B2%C3%B4%B5%A5%CE%BB%C2%EF&ie=gbk\nhttps:\/\/zhidao.baidu[.]com\/question\/146035392.html?fr=iks&word=%CC%EC%BD%F2%CA%D0%D6%E9%BD%AD%B5%C085%BA%C5%CA%C7%CA%B2%C3%B4%B5%A5%CE%BB%C2%EF&ie=gbk\nhttps:\/\/zhidao.baidu[.]com\/question\/223614321.html?fr=iks&word=%CC%EC%BD%F2%CA%D0%D6%E9%BD%AD%B5%C085%BA%C5%CA%C7%CA%B2%C3%B4%B5%A5%CE%BB%C2%EF&ie=gbk","url":"https:\/\/www.crowdstrike.com\/blog\/two-birds-one-stone-panda\/"},{"Unnamed: 0":0,"query":"APT3","text":"Adobe has already released a patch for CVE-2015-3113 with an out-of-band security bulletin ( https:\/\/helpx.adobe.com\/security\/products\/flash-player\/apsb15-14.html ). FireEye recommends that Adobe Flash Player users update to the latest version as soon as possible.  FireEye MVX detects this threat as a web infection, the IPS engine reports the attack as CVE-2015-3113, and the SHOTPUT backdoor is reported as Backdoor.APT.CookieCutter.  APT3  The China-based threat group FireEye tracks as APT3, aka UPS, is responsible for this exploit and the activity identified in our previous blog post, Operation Clandestine Fox . This group is one of the more sophisticated threat groups that FireEye Threat Intelligence tracks, and they have a history of introducing new browser-based zero-day exploits (e.g., Internet Explorer, Firefox, and Adobe Flash Player). After successfully exploiting a target host, this group will quickly dump credentials, move laterally to additional hosts, and install custom backdoors. APT3’s command and control (CnC) infrastructure is difficult to track, as there is little overlap across campaigns.  Activity Overview  In the last several weeks, APT3 actors launched a large-scale phishing campaign against organizations in the following industries:   Aerospace and Defense  Construction and Engineering  High Tech  Telecommunications  Transportation   Upon clicking the URLs provided in the phishing emails, targets were redirected to a compromised server hosting JavaScript profiling scripts. Once a target host was profiled, victims downloaded a malicious Adobe Flash Player SWF file and an FLV file, detailed below. This ultimately resulted in a custom backdoor known as SHOTPUT, detected by FireEye as Backdoor.APT.CookieCutter , being delivered to the victim’s system.  The payload is obscured using xor encoding and appended to a valid GIF file.   Attack Vector  The phishing emails used by APT3 during this campaign were extremely generic in nature, almost appearing to be spam. An example email body:  Save between $200-450 by purchasing an Apple Certified Refurbished iMac through this link. Refurbished iMacs come with the same 1-year extendable warranty as new iMacs. Supplies are limited, but update frequently.  Don't hesitate . . .>Go to Sale  The string “>Go to Sale” was a link that used the following URL structure:  hxxp:\/\/<subdomain>.<legitdomain>.<TLD>\/<directory>\/<alphanumericID>.html  Exploit Details  The attack exploits an unpatched vulnerability in the way Adobe Flash Player parses Flash Video (FLV) files. The exploit uses common vector corruption techniques to bypass Address Space Layout Randomization (ASLR), and uses Return-Oriented Programming (ROP) to bypass Data Execution Prevention (DEP).  A neat trick to their ROP technique makes it simpler to exploit and will evade some ROP detection techniques.  Shellcode is stored in the packed Adobe Flash Player exploit file alongside a key used for its decryption. The payload is xor encoded and hidden inside an image.  Exploit Packaging  The Adobe Flash Player exploit is packed with a simple RC4 packer. The RC4 key and ciphertext are BinaryData blobs that the packer uses to decrypt the layer 2 Adobe Flash Player file. Once decrypted, layer 2 is executed with loader.loadBytes.  Vector Corruption  Layer 2 uses a classic Adobe Flash Player Vector corruption technique to develop its heap corruption vulnerability to a full relative read\/write available to ActionScript3. In this technique, the attacker sprays Adobe Flash Player Vectors to the heap, and triggers a write vulnerability to change the size of one of the vectors. The attacker can then perform subsequent reads and writes to memory outside the intended boundaries of the corrupted Vector object from AS3. For more details on this technique, see Flash in 2015 .  Once the attacker has limited read\/write access to memory, they choose to corrupt a second Vector to increase their access to a range of 0x3fffffff bytes. This second Vector is used for the remainder of the exploit.  Return-Oriented Programming  The attackers use a ROP chain to call kernel32!VirtualAlloc to mark their shellcode as executable before jumping to their shellcode.  Instead of writing their ROP chain to the heap along with their shellcode and payload, they used a different technique. Usually, exploit developers will corrupt a built-in Adobe Flash Player object such as a Sound object. Instead, the attackers chose to define their own class in AS3 with a function that takes a lot of arguments:  class CustomClass { public function victimFunction(arg1:uint, arg2:uint, …, arg80:uint):uint }  Then, the attackers can simply overwrite the function pointer with a gadget that adds to the stack pointer and returns to pivot to ROP. They have no need to identify the absolute address of the ROP chain and preserve it in a register for a typical xchg reg32, esp pivot. Additionally, storing the ROP chain on the stack will evade ROP detection mechanisms designed around detecting when the stack pointer points outside of a thread’s stack region.  this.customObj.victimFunction( 6f73b68b, \/\/ ret; (ROPsled) …, 6f73b68a, \/\/pop eax 1f140100, 6fd36da1, \/\/call Kernel32!VirtualAlloc(0x1f140000, 0x10000, 0x1000, 0x40) 1f140000, \/\/ Address 00010000, \/\/ Size 00001000, \/\/ Type 00000040, \/\/ Protection = RWX 6f73b68b*9 \/\/ ret (ROPsled) 6fd36da7*2 \/\/ ret 6f73aff0 pop ecx 6fd36da7 6fd36da7 jmp [eax] … ) this.customObj.victimFunction pointer modified to: 00000000`6de533dc 5e          pop     rsi 00000000`6de533dd 83c448      add     esp,48h 00000000`6de533e0 c3          ret  Lastly, the ROP chain has a ROPsled following the call to VirtualAlloc. This could just be an artifact of development, or it could be designed to bypass detection mechanisms that test for valid return addresses up to a limited depth at calls to VirtualAlloc.  Full Exploit Flow  1.     Create a new Video object  2.     Fetch the payload  3.     Attach the video to a new NetStream  4.     Spray the heap with Adobe Flash Player Vectors  a.     Create a Vector containing 98688 Vectors containing 1022 uints  b.     Set the first two dwords in each Vector<uint> to 0x41414141, 0x42424242  5.     Create holes for the controlled FLV object  a.     Free approximately every 3 rd Vector in the spray  6.     Spray custom class objects for future control transfer  a.     Define a new class CustomClass  i.     Define a function victimFunction with lots of arguments  b.     Create a Vector of 0x100 Vectors of 1007 references to an CustomClass instance  7.     Fetch and play the FLV exploit  a.     The FLV file will allocate an attacker controlled object in one of the holes from step 5  b.     The attacker controlled object will overwrite the length field of an adjacent vector  8.     Re-fill holes from step 5 with Vectors as in step 4  9.     Find the corrupted vector  a.     Search through Vectors from step 4  b.     Check the length of each Vector to find one that is abnormally large  10.  Corrupt a second Vector (Vector2)  a.     Using the corrupted Vector from step 9 to read\/write relative memory addresses  i.     Search memory for an adjacent vector  ii.     Overwrite the length field with 0x3fffffff  iii.     Verify that a corrupted vector with length 0x3fffffff now exists in the spray  1.     If not, undo corruption and attempt to corrupt the next vector  11.  Decrypt shellcode and store it and the payload on the heap  12.  Overwrite the CustomClass.victimFunction function pointer  a.     Find the sprayed CustomClass object instance references from step 6  b.     The new function is a form of “pivot” that transfers control to the attacker  13.  Build ROP chain on the stack and call it  a.     Find ROP gadgets in memory using Vector2  i.     Including a call to kernel32!VirtualAlloc  b.     Call the corrupted CustomClass.victimFunction from step 6.a.i  i.     Arguments to the function are the gadgets of the ROP chain  ii.     They are conveniently pushed onto the stack  iii.     Corrupted vtable from step 12 calls a pivot  1.     The “pivot” just adds to to the stack pointer and returns because the ROP chain is on  the stack  14.  ROP chain calls shellcode  a.     Call kernel32!VirtualAlloc  b.     jmp to shellcode  15.  Shellcode calls payload  a.     Shellcode searches memory for the payload, which is stored inside an image  b.     Shellcode decodes the payload by xoring each byte (that is not 0 or 0x17) with 0x17  Conclusion  Once APT3 has access to a target network, they work quickly and they are extremely proficient at enumerating and moving laterally to maintain their access. Additionally, this group uses zero-day exploits, continually updated custom backdoors, and throwaway CnC infrastructure, making it difficult to track them across campaigns.  Acknowledgements  Thank you to the following contributors to this blog!  ·      Joseph Obed, Ben Withnell, Kevin Zuk, Genwei Jiang, and Corbin Souffrant of FireEye","url":"https:\/\/www.fireeye.com\/\/blog\/threat-research\/2015\/06\/operation-clandestine-wolf-adobe-flash-zero-day.html"},{"Unnamed: 0":0,"query":"APT3","text":"The MsnMM Campaigns [pdf]  For over half a decade, the Naikon APT waged multiple attack campaigns on sensitive targets throughout South-eastern Asia and around the South China Sea. It maintained a heavy offensive focus on Myanmar, Vietnam, Singapore, the Philippines, Malaysia, and Laos. Targets and victims included ASEAN governmental agencies and government departments, investment enterprises, military, law enforcement and border control organizations, embassies, university faculties and others.  Parts of the campaigns have been publicly discussed according to the nature of their tools. For example, the MsnMM backdoors started out with internal names like “WinMM” and “SslMM”, and their file naming spoofed MSN Talk and Msn Gaming Zone. The backdoor term “naikon” was derived from the User-Agent string “NOKIAN95”. But msnMM, naikon, sakto, and rarstone backdoors are all used by the same actor that we call the Naikon APT. Their second stage tools largely remained unknown, but a list is included in this report.  The Naikon attackers attempted to exfiltrate sensitive geo-political, military, and economic data; to intercept communications and to maintain surveillance on their victims throughout the MsnMM campaigns. Their toolset and techniques changed over time in many minor ways, and appear to be run by Chinese-speaking individuals. The group’s infrastructure, reliant on web apps located mostly via dynamic dns domains, overlapped across these campaigns. As previously described, the APT’s methods and technologies are simple, but highly effective against its targets’ defenses. We do not find 0-days here.  Much of Naikon’s spear-phish and decoy document content, as well as its deployment, coincided approximately with highly-charged geopolitical events. The consistent list of military, economic, and political targets gave away the actor’s interests. Naikon’s earliest campaigns deployed the exe_exchange, winMM, and sys10 backdoors, and the codebase was later built out into more custom tools. The MsnMM campaigns were waged into the start of 2014, and then dropped off before picking up again later in the year and into 2015.  Regarding interaction with other APTs, it’s interesting to note that Naikon APT victims overlap with Cycldek APT victims.  Cycldek is another persistent, but weaker APT. In addition, not only does the APT30 target profile match the Naikon APT, its toolset also features minor but noticeable similarities. And the later Naikon campaigns led to an all out APT v APT confrontation with the Hellsing APT , when “the empire struck back.”  Although aspects of the malware set have been discussed on some blogs and in other papers, there hasn’t been an accurate report bringing together details of the MsnMM, Sys10, and Naikon campaigns as the work of one crew, the Naikon APT. Finally, while this report looks into their past activity, the Naikon APT remains active, deploying a more recent codebase. The top targets for 2015 that we are aware of include organizations in Myanmar, Cambodia, Vietnam, Thailand, and Laos.","url":"https:\/\/securelist.com\/the-naikon-apt-and-the-msnmm-campaigns\/70029\/"},{"Unnamed: 0":1,"query":"APT3","text":"Our recent report, “ The Chronicles of the Hellsing APT: the Empire Strikes Back ” began with an introduction to the Naikon APT, describing it as “One of the most active APTs in Asia, especially around the South China Sea”. Naikon was mentioned because of its role in what turned out to be a unique and surprising story about payback. It was a Naikon attack on a Hellsing-related organization that first introduced us to the Hellsing APT.  Considering the volume of Naikon activity observed and its relentless, repeated attack attempts, such a confrontation was worth looking into, so we did.  The #NaikonAPT group was spear-phished by an actor we now call “Hellsing” Tweet  The Naikon APT aligns with the actor our colleagues at FireEye recently revealed to be APT30 , but we haven’t discovered any exact matches. It is hardly surprising that there is an element of overlap, considering both actors have for years mined victims in the South China Sea area, apparently in search of geo-political intelligence.  The #NaikonAPT group has for 5 years mined victims, apparently in search of geo-political intelligence Tweet  This Naikon report will be complemented by a follow-on report that will examine the Naikon TTP and the incredible volume of attack activity around the South China Sea that has been going on since at least 2010.  Noteworthy operational and logistical characteristics of this APT include:   At least five years of high volume, high profile,  geo-political attack activity  Geographical  focus – per-country, individual operator assignment and proxy presence  Dynamic, well organized infrastructure  Reliance on an externally developed, consistent set of tools comprising a full-featured backdoor, a builder, and an exploit builder  High success rate in infiltrating national organisations in ASEAN countries   Highly Focused and Effective Around the South China Sea  In the spring of 2014, we noticed an increase in the volume of attack activity by the Naikon APT. The attackers appeared to be Chinese-speaking and targeted mainly top-level government agencies and civil and military organizations in countries such as the Philippines, Malaysia, Cambodia, Indonesia, Vietnam, Myanmar, Singapore, Nepal, Thailand, Laos and China.   Decoy  An attack typically starts with an email carrying an attachment that contains information of interest to the potential victim. The document may be based on information from open sources or on proprietary information stolen from other compromised systems.  This bait “document”, or email attachment, appears to be a standard Word document, but is in fact an CVE-2012-0158 exploit, an executable with a double extension, or an executable with an RTLO filename, so it can execute code without the user’s knowledge or consent. When the executable is launched, spyware is installed on the victim computer at the same time as a decoy document is displayed to the user; fooling them into thinking they have simply opened a document.  Configuration  The Naikon tool of choice generates a special, small, encrypted file which is 8,000 bytes in size, containing code to be injected into the browser along with configuration data. With the help of a start-up module, this whole file is injected into the browser memory and decrypts the configuration block containing the following:   C&C server  Ports and path to the server  User-agent string  Filenames and paths to its components  Hash sums of the user API functions   The same code then downloads its main body from the C&C server using the SSL protocol, loads it independently from the operating system functions and, without saving it to the hard drive, hands over control to the XS02 function. All functionality is handled in memory.   Payload  The main module is a remote administration utility. Using SSL, the module establishes a reverse connection to the C&C server as follows: it sets up an outgoing connection to the C&C server and checks if there is a command that it should execute. If there is, it executes the command and returns the result to the C&C. There are 48 commands in the module’s repertoire, which a remote operator can use to effectively control the victim computer. This includes taking a complete inventory, downloading and uploading data, installing add-on modules, or working with the command line.  The main module supports 48 commands, which the attackers can use to control the victim machine #NaikonAPT Tweet  Here is the complete list of commands:      0  CMD_MAIN_INFO    1  CMD_PROCESS_REFRESH    2  CMD_PROCESS_NAME    3  CMD_PROCESS_KILL    4  CMD_PROCESS_MODULE    5  CMD_DRIVE_REFRESH    6  CMD_DIRECTORY    7  CMD_DIRECTORY_CREATE    8  CMD_DIRECTORY_CREATE_HIDDEN    9  CMD_DIRECTORY_DELETE    10  CMD_DIRECTORY_RENAME    11  CMD_DIRECOTRY_DOWNLOAD    12  CMD_FILE_REFRESH    13  CMD_FILE_DELETE    14  CMD_FILE_RENAME    15  CMD_FILE_EXECUTE_NORMAL    16  CMD_FILE_EXECUTE_HIDDEN    17  CMD_FILE_EXECUTE_NORMAL_CMD    18  CMD_FILE_EXECUTE_HIDDEN_CMD    19  CMD_FILE_UPLOAD    20  CMD_FILE_DOWNLOAD    21  CMD_WINDOWS_INFO    22  CMD_WINDOWS_MESSAGE    23  CMD_SHELL_OPEN    24  CMD_SHELL_CLOSE    25  CMD_SHELL_WRITE    26  CMD_SERVICE_REFRESH    27  CMD_SERVICE_CONTROL    28  CMD_PROGRAM_INFO    29  CMD_UNINSTALL_PROGRAM    30  CMD_REGESTRY_INFO    31  CMD_ADD_AUTO_START    32  CMD_MY_PLUGIN    33  CMD_3RD_PLUGIN    34  CMD_REG_CREATEKEY    35  CMD_REG_DELETEKEY    36  CMD_REG_SETVALUE    37  CMD_REG_DELETEVALUE    38  CMD_SELF_KILL    39  CMD_SELF_RESTART    40  CMD_SELF_CONFIG    41  CMD_SELF_UPDATE    42  CMD_SERVER_INFO    43  CMD_INSTALL_SERVICE    44  CMD_FILE_DOWNLOAD2    45  CMD_RESET    46  CMD_CONNECTION_TABLE    50  CMD_HEART_BEAT      Several modifications of the main module exist. There are no fundamental differences between modifications; it’s just that extra features get added to the latest versions, such as compression and encryption of transmitted data, or the piecemeal download of large files.      d085ba82824c1e61e93e113a705b8e9a  118272  Aug 23 18:46:57 2012    b4a8dc9eb26e727eafb6c8477963829c  140800  May 20 11:56:38 2013    172fd9cce78de38d8cbcad605e3d6675  118784  Jun 13 12:14:40 2013    d74a7e7a4de0da503472f1f051b68745  190464  Aug 19 05:30:12 2013    93e84075bef7a11832d9c5aa70135dc6  154624  Jan 07 04:39:43 2014      CC-Proxy-Op  C&C server operations are characterized by the following:   Low maintenance requirements  Organized geo-specific task assignments  Different approaches to communication   The C&C servers must have required only a few operators to manage the entire network. Each operator appears to have focused on their own particular set of targets, because a correlation exists between C&C and the location of targets\/victims.  There is a geo-specific correlation between the location of #NaikonAPT C&Cs and that of targets\/victims Tweet  Communication with victim systems changed depending on the target involved. In some cases, a direct connection was established between the victim computer and the C&C. In other cases, the connection was established via dedicated proxy servers installed on dedicated servers rented in third countries. In all likelihood, this additional setup was a reaction to the network administrators in some targets limiting or monitoring outbound network connections from their organizations.  Here is a partial list of C&C servers and victim locations, demonstrating the geo-specific correlation:      ID  Jakarta  linda.googlenow.in    ID  Jakarta  admin0805.gnway.net    ID  Jakarta  free.googlenow.in    ID   frankhere.oicp.net    ID  Bandung  frankhere.oicp.net    ID  Bandung  telcom.dhtu.info    ID  Jakarta  laotel08.vicp.net    JP  Tokyo  greensky27.vicp.net    KH   googlemm.vicp.net    KH  Phnom Penh  googlemm.vicp.net    MM   peacesyou.imwork.net    MM   sayakyaw.xicp.net    MM   ubaoyouxiang.gicp.net    MM  Yangon  htkg009.gicp.net    MM   kyawthumyin.xicp.net    MM   myanmartech.vicp.net    MM   test-user123.vicp.cc    MY   us.googlereader.pw    MY   net.googlereader.pw    MY   lovethai.vicp.net    MY   yahoo.goodns.in    MY  Putrajaya  xl.findmy.pw    MY  Putrajaya  xl.kevins.pw    PH  Caloocan  oraydns.googlesec.pw    PH  Caloocan  gov.yahoomail.pw    PH   pp.googledata.pw    PH   xl.findmy.pw    PH   mlfjcjssl.gicp.net    PH   o.wm.ggpw.pw    PH   oooppp.findmy.pw    PH   cipta.kevins.pw    PH   phi.yahoomail.pw    SG  Singapore  xl.findmy.pw    SG  Singapore  dd.googleoffice.in    VN  Hanoi  moziliafirefox.wicp.net    VN  Hanoi  bkav.imshop.in    VN  Hanoi  baomoi.coyo.eu    VN  Dong Ket  macstore.vicp.cc    VN  Hanoi  downloadwindows.imwork.net    VN  Hanoi  vietkey.xicp.net    VN  Hanoi  baomoi.vicp.cc    VN  Hanoi  downloadwindow.imwork.net    VN  Binh Duong  www.ttxvn.net    VN  Binh Duong  vietlex.gnway.net    VN  Hanoi  www.ttxvn.net    VN  Hanoi  us.googlereader.pw    VN  Hanoi  yahoo.goodns.in    VN  Hanoi  lovethai.vicp.net    VN  Hanoi  vietlex.gnway.net      XSControl – the Naikon APT’s “victim management software”  In the Naikon scheme, a C&C server can be specialized XSControl software running on the  host machine. It can be used to manage an entire network of infected clients. In some cases, a proxy is used to tunnel victim traffic to the XSControl server. A Naikon proxy server is a dedicated server that accepts incoming connections from victim computers and redirects them to the operator’s C&C. An individual Naikon proxy server can be set up in any target country with traffic tunnelling from victim systems to the related C&C servers  XSControl is written in .NET with the use of DevExpress:    Its main capabilities are:   Accept initial connections from clients  Provide clients with the main remote administration module  Enable them to remotely administer infected computers with the help of a GUI  Keep logs of client activity  Keep logs of operator activity  Upload logs and files to an FTP server   The operator’s activity logs contain the following:   An XML database of downloaded files, specifying the time of operation, the remote path and the local path  A database of file names, the victim computer registry keys for the folders and requested sections  A history of executed commands   Country X, Operator X  Now let’s do an overview of one Naikon campaign, focusing on country “X”.  Analysis revealed that the cyber-espionage campaign against country X had been going on for many years. Computers infected with the remote control modules provided attackers with access to employees’ corporate email and internal resources, and access to personal and corporate email content hosted on external services.  Below is a partial list of organizations affected by Naikon’s “operator X’s” espionage campaign in country X.   Office of the President  Military Forces  Office of the Cabinet Secretary  National Security Council  Office of the Solicitor General  Intelligence Services  Civil Aviation Authority  Department of Justice  Federal Police  Executive\/Presidential Administration and Management Staff   A few of these organizations were key targets and under continuous, real-time monitoring. It was during operator X’s network monitoring that the attackers placed Naikon proxies within the countries’ borders, to cloak and support real-time outbound connections and data exfiltration from high-profile victim organizations.  In order to obtain employees’ credentials, operator X sometimes used keyloggers. If necessary, operator X delivered them via the remote control client. In addition to stealing keystrokes, this attacker also intercepted network traffic. Lateral movements included copying over and remotely setting up winpcap across desktop systems within sensitive office networks, then remotely setting up AT jobs to run these network sniffers. Some APTs like Naikon distribute tools such as these across multiple systems in order to regain control if it is lost accidentally and to maintain persistence.  The #NaikonAPT group took advantage of cultural idiosyncrasies in its target countries Tweet  Operator X also took advantage of cultural idiosyncrasies in its target countries, for example, the regular and widely accepted use of personal Gmail accounts for work. So it was not difficult for the Naikon APT to register similar-looking email addresses and to spear-phish targets with attachments, links to sites serving malware, and links to google drive.  The empire strikes back  Every once in a while the Naikon group clashes with other APT groups that are also active in the region. In particular, we noticed that the Naikon group was spear-phished by an actor we now call “Hellsing”. More details about the cloak and dagger games between Naikon and Hellsing can be found in our blogpost: “ The Chronicles of the Hellsing APT: The Empire Strikes Back “.   Read more about how you can protect your company against the Naikon threat actor here","url":"https:\/\/securelist.com\/the-naikon-apt\/69953\/"},{"Unnamed: 0":0,"query":"APT3","text":"APT3 Hackers Linked to Chinese Ministry of State Security\r\n\nIndependent researchers and experts from threat intelligence firm Recorded Future are confident that the cyber espionage group tracked as APT3 is directly linked to the Chinese Ministry of State Security (MSS).\nWhile much of the security community typically tries to avoid making attribution statements, arguing that false flags make this task difficult, there are some individuals and companies that don’t shy away from accusing governments of conducting sophisticated cyberattacks.\nA mysterious group called “intrusiontruth,” which claims to focus on investigating some of the most important advanced persistent threat (APT) actors, has recently published a series of blog posts on APT3, a group that is also known as UPS Team, Gothic Panda, Buckeye and TG-0110.\nThe cyberspies, believed to be sponsored by China, have been active since at least 2009, targeting many organizations in the United States and elsewhere via spear-phishing, zero-day exploits, and various other tools and techniques. Researchers noticed last year that APT3 had shifted its attention from the U.S. and the U.K. to Hong Kong, where it had mainly targeted political entities using a backdoor dubbed “Pirpi.”\nIntrusiontruth has conducted an analysis of APT3’s command and control (C&C) infrastructure, particularly domain registration data. Their research led to two individuals, named Wu Yingzhuo and Dong Hao, who apparently registered many of the domains used by the threat actor.\nBoth these individuals are listed as shareholders for a China-based security firm called the Guangzhou Boyu Information Technology Company, or Boyusec. In November 2016, the Washington Free Beacon learned from Pentagon intelligence officials that this company had been working with Chinese telecoms giant Huawei to develop spyware-laden security products that would be loaded onto computers and phones. The unnamed officials said Boyusec was “closely connected” to the Chinese Ministry of State Security.\nIntrusiontruth concluded that either Boyusec has two shareholders with the same name as members of APT3, or Boyusec is in fact APT3, which is the more likely scenario.\nRecorded Future has dug deeper to find more evidence connecting APT3 to China’s MSS. In a report published on Wednesday, the company said it had attributed the group directly to the MSS with “a high degree of confidence.”\nResearchers pointed out that in addition to Huawei, which claimed to use Boyusec for security evaluations of its corporate intranet, Boyusec was also a partner of the Guangdong Information Technology Security Evaluation Center (Guangdong ITSEC), and the organizations have been collaborating on an active defense lab since 2014.\nGuangdong ITSEC is apparently a subordinate of the China Information Technology Evaluation Center (CNITSEC), which, according to academic research, is run by the Ministry of State Security.\nExperts believe many of the ministry’s subordinates, particularly ones at provincial and local levels, have legitimate public missions and act as a cover-up for intelligence operations.\n“Companies in sectors that have been victimized by APT3 now must adjust their strategies to defend against the resources and technology of the Chinese government. In this real-life David vs. Goliath situation, customers need both smart security controls and policy, as well as actionable and strategic threat intelligence,” Recorded Future said in its report.\nRelated: Flash Player Flaw Used by APT3 Group Added to Magnitude Exploit Kit\nRelated: China-Linked Group Uses New Malware in Japan Attacks\nRelated: Serious Breach Linked to Chinese APTs Comes to Light","url":"https:\/\/www.securityweek.com\/apt3-hackers-linked-chinese-ministry-state-security"},{"Unnamed: 0":1,"query":"APT3","text":"China-Linked APT3 Group Focuses Attacks on Hong Kong\r\n\nA China-linked cyberespionage group has shifted its attention from the United States to Hong Kong, where it has targeted more than a dozen organizations over the past year.\nFireEye reported last week that APT3, a threat actor believed to be sponsored by China, had targeted two Hong Kong government agencies in early August. The attackers had used spear-phishing emails to trick recipients into installing what the security firm said was a previously unseen piece of malware.\nAPT3, also known as UPS Team, Gothic Panda, Buckeye and TG-0110, has been active since at least 2009. The group’s attacks often involved zero-day vulnerabilities and flaws that had just been patched.\nMany of the group’s earlier attacks focused on the United States, including government organizations. However, Symantec, which tracks the threat actor as Buckeye, noticed last year that the hackers had become increasingly interested in Hong Kong.\nSymantec observed roughly 82 APT3 victims since the beginning of 2015, but experts pointed out that the group had cast a wide net and only 17 of these organizations were persistently targeted. The list of victims included 13 organizations in Hong Kong, three in the U.S. and one in the U.K.\nWhile there were some periods last year when all three countries had been targeted, researchers noticed that the U.K. and the U.S. were no longer attacked starting with March 2016.\nIn the recent attacks observed by Symantec, mostly aimed at political entities in Hong Kong, APT3 used ZIP archives and Windows shortcut (.lnk) files to deliver a backdoor dubbed by the security firm Pirpi.\nThe infection method appears to be the same in the attacks observed by FireEye – a ZIP archive contains a shortcut file that downloads malware. However, the early August attacks spotted by FireEye did not leverage Pirpi, which has been around since 2010 and which the company tracks as Backdoor.APT.CookieCutter. Instead, the security firm said they involved a new malware tool.\nThis suggests that China may have stepped up its attacks just before the Hong Kong legislative elections that took place on September 4. The Chinese government has been increasingly concerned about Hong Kong’s push for more political independence.\nIn addition to Pirpi, Symantec observed APT3 using various other tools, including keyloggers, remote command execution tools, system information harvesting tools, and browser password stealers. Researchers said the group appears to be focusing on file and print servers, which suggests they are mainly interested in stealing documents.","url":"https:\/\/www.securityweek.com\/china-linked-apt3-group-focuses-attacks-hong-kong"},{"Unnamed: 0":2,"query":"APT3","text":"APT3 Group Using Windows OLE Vulnerability: FireEye\r\n\nThe attack group known as APT3 is now using exploits for recently-patched Windows vulnerabilities, according to a report from FireEye.\n\nAPT3 is believed to be behind 'Operation Clandestine Fox', a campaign first disclosed in April when the group began using a zero-day in Internet Explorer in targeted attacks. In May, the attackers began specifically targeting Windows XP machines running Internet Explorer 8. The group has also been seen using social networks to fool targets into installing malware.\n\n\"APT3…the actors responsible for Operation Clandestine Fox has quietly continued to send waves of spearphishing messages over the past few months,\" FireEye researchers blogged. \"This actor initiated their most recent campaign on November 19, 2014 targeting multiple organizations. The attacker leveraged multiple exploits, targeting both CVE-2014-6332 and CVE-2014-4113. CVE-2014-6332 was disclosed publicly on 2014-11-11 and is a Windows OLE Automation Array Remote Code Execution vulnerability. CVE-2014-4113 is a privilege escalation vulnerability that was disclosed publicly on 2014-10-14.\"\n\n\"The use of CVE-2014-6332 is notable, as it demonstrates that multiple classes of actors, both criminal and APT alike, have now incorporated this exploit into their toolkits,\" the researchers continued. \"Further, the use of both of these two known vulnerabilities in tandem is notable for APT3. This actor is historically known for leveraging zero-day vulnerabilities in widespread but infrequent phishing campaigns. The use of known exploits and more frequent attacks may indicate both a shift in strategy and operational tempo for this group.\"\n\nCVE-2014-6332 was fixed earlier this month during Patch Tuesday. The bug garnered significant attention because it had exploitable for nearly two decades. The vulnerability affected all versions of Windows from Windows 95 on, and has been remotely exploitable since Internet Explorer 3.0.\nCVE-2014-4113 meanwhile exists when the Windows kernel-mode driver improperly handles objects in memory. An attacker who exploited it could potentially run arbitrary code in kernel mode.\n\n\"Although APT3 is well known for employing zero-day exploits in their attacks, recent activity has demonstrated that they will also attack targets with known exploits or social engineering,\" the FireEye researchers wrote. \"Since Operation Clandestine Fox, we have observed this actor execute multiple attacks that did not rely on zero-day exploits. The combination of this sustained operational tempo and lack of zero-day exploits may indicate that this group has changed strategy and has decided to attack more frequently and does not have steady access to zero-day exploit code.\"\n\"No matter the strategy, this actor has shown an ability to operate successfully,\" the researchers added.","url":"https:\/\/www.securityweek.com\/apt3-group-using-windows-ole-vulnerability-fireeye"},{"Unnamed: 0":3,"query":"APT3","text":"Flash Player Flaw Used by APT3 Group Added to Magnitude Exploit Kit\r\n\nAn exploit for a Flash Player vulnerability patched by Adobe last week with the release of version 18.0.0.194 has been integrated into the Magnitude exploit kit.\nThe existence of the heap buffer overflow vulnerability (CVE-2015-3113) that can be exploited for arbitrary code execution was brought to light by FireEye. The security firm discovered that the flaw has been leveraged by the China-based attack group known as APT3 (UPS) in a large-scale phishing campaign aimed at organizations in the aerospace and defense, construction and engineering, telecommunications, high-tech, and transportation industries.\nThe security hole, which according to Trend Micro is similar to a previously discovered bug (CVE-2015-3043), exists due to the way Adobe Flash Player parses Flash Video (FLV) files.\nFour days after Adobe patched the vulnerability, the French security researcher “Kafeine” noticed that an exploit for the bug had been included in the Magnitude exploit kit. The expert reported on Sunday that cybercriminals have been using the exploit to deliver the Cryptowall ransomware.\nJérôme Segura, senior security researcher at Malwarebytes, believes the exploit for CVE-2015-3113 will be added to other kits “very soon.” However, Kafeine told SecurityWeek that he had not seen the exploit in any other kits as of June 29, 4:00 AM EST.\nIt’s not uncommon for cybercriminals to start exploiting Flash Player vulnerabilities in their operations shortly after they are patched by Adobe. In late May, an exploit for a Flash Player bug fixed by Adobe on May 11 was added to the Angler exploit kit. A few days later, experts noticed that exploits for the same bug had been added to the Magnitude, Neutrino, and Nuclear Pack kits.\nExperts told SecurityWeek that in many cases malicious actors develop these exploits by reverse engineering the patches. In the case of zero-day flaws, the exploit kit teams either have skilled members who develop the exploits themselves, or they have the funds to acquire them from the black market, said malware analyst Yonathan Klijnsma.\nThe authors of different exploit kits are usually in direct competition so they don’t share exploits. However, it’s not uncommon for them to reverse engineer the exploits created by other teams.\n“Once a new exploit has been introduced in one kit, it’s pretty easy for others to copy it,” Timo Hirvonen, senior researcher at F-Secure, told SecurityWeek earlier this month. “Some criminals might be behind several exploit kits, just like Paunch was behind Blackhole and Cool, and they may use the same exploit in all their kits.”","url":"https:\/\/www.securityweek.com\/flash-player-flaw-used-apt3-group-added-magnitude-exploit-kit"},{"Unnamed: 0":4,"query":"APT3","text":"U.S. Indicts Chinese For Hacking Siemens, Moody’s\r\n\nU.S. authorities filed charges Monday against three China-based hackers for stealing sensitive information from U.S. based companies, including data from Siemens industrial groups and accessing a high-profile email account at Moody’s. \nWu Yingzhuo, Dong Hao and Xia Lei, who the Department of Justice (DOJ) says are Chinese nationals and residents of China, were indicted by a grand jury for a series of cyber-attacks against three corporate victims in the financial, engineering and technology industries between 2011 and May 2017.  \nVictims named in the indictment include Moody’s Analytics, Siemens, and GPS technology firm Trimble.\nAccording to the FBI, the hackers work for Guangzhou Bo Yu Information Technology Company Limited, a firm that purports to be a China-based Internet security firm also known as “Boyusec.”\nTracked as APT3 by FireEye, and Gothic Panda by CrowdStrike, the group is also known as UPS Team, Buckeye and TG-0110, and has previously been linked to the Chinese Ministry of State Security (MSS).\n“We’ve tracked their activity back to 2007 and they are one of the most technically advanced state-affiliated actors in China,” Adam Meyers, VP of Intelligence at CrowdStrike, told SecurityWeek. “Their previous targeting includes industries such as Aerospace, Defense, Energy, Technology, NGOs, etc., that are primarily aligned with China’s economic objectives.”\nIn November 2016, the Washington Free Beacon learned from Pentagon intelligence officials that Boyusec had been working with Chinese telecoms giant Huawei to develop spyware-laden security products that would be loaded onto computers and phones. The unnamed officials said Boyusec was “closely connected” to the Chinese Ministry of State Security.\nAccording to the indictment, the hackers:\n• Stole approximately 407 gigabytes of proprietary commercial data pertaining to Siemens’s energy, technology and transportation businesses.\n• Accessed the internal email server of Moody’s Analytics and placed a forwarding rule in the email account of a prominent employee, and set it to forward all emails to and from the account to web-based email accounts controlled by the attackers.\n• Stole at least 275 megabytes of data, including compressed data, which included hundreds of files that would have assisted a Trimble competitor in developing, providing and marketing a similar product without incurring millions of dollars in research and development costs.\n“The primary goal of the co-conspirators’ unauthorized access to victim computers was to search for, identify, copy, package, and steal data from those computers, including confidential business and commercial information, work product, and sensitive victim employee information, such as usernames and passwords that could be used to extend unauthorized access within the victim systems,” the DOJ said.  “For the three victim entities listed in the Indictment, such information included hundreds of gigabytes of data regarding the housing finance, energy, technology, transportation, construction, land survey, and agricultural sectors.”\nIntrusion Truth previously conducted an analysis of APT3’s command and control (C&C) infrastructure, and analyzed domain registration data. Their research led to two individuals, named Wu Yingzhuo and Dong Hao, who apparently registered many of the domains used by the threat actor.\nResearchers noticed last year that the group had shifted its attention from the U.S. and the U.K. to Hong Kong, where it had mainly targeted political entities using a backdoor dubbed “Pirpi.” \nCrowdStrike has seen an uptick in activity by the group since 2016, Meyers said.\nIn addition to Pirpi, Symantec observed APT3 using various other tools, including keyloggers, remote command execution tools, system information harvesting tools, and browser password stealers. Researchers said the group appears to be focusing on file and print servers, which suggests they are mainly interested in stealing documents to support their espionage efforts.\n“Defendants Wu, Dong and Xia launched coordinated and targeted cyber intrusions against businesses operating in the United States, including here in the Western District of Pennsylvania, in order to steal confidential business information,” said Acting U.S. Attorney Song. “These conspirators masked their criminal conspiracy by exploiting unwitting computers, called ‘hop points,’ conducting ‘spearphish’ email campaigns to gain unauthorized access to corporate computers, and deploying malicious code to infiltrate the victim computer networks.”","url":"https:\/\/www.securityweek.com\/us-indicts-chinese-hacking-siemens-moody"},{"Unnamed: 0":5,"query":"APT3","text":"Adobe Flash Player Zero-Day Exploited in Attack Campaign\r\n\nAdobe Systems released an emergency update today to address a security vulnerability in Adobe Flash Player that is being exploited in a large-scale phishing campaign.\nThe bug, CVE-2015-3113, is a heap buffer overflow issue. It was discovered by researchers at FireEye, who have linked it to attacks by the hacking crew APT3 that have targeted a number of industries, including the telecommunications, transportation and aerospace and defense sectors.\n\"Adobe is aware of reports that CVE-2015-3113 is being actively exploited in the wild via limited, targeted attacks,\" Adobe stated in its advisory. \"Systems running Internet Explorer for Windows 7 and below, as well as Firefox on Windows XP, are known targets.\"\nAccording to FireEye, the attackers' emails contained links to compromised web servers that served either benign content or a malicious Adobe Flash Player file exploiting the bug.\n\"Upon clicking the URLs provided in the phishing emails, targets were redirected to a compromised server hosting JavaScript profiling scripts,\" FireEye researchers blogged. \"Once a target host was profiled, victims downloaded a malicious Adobe Flash Player SWF file and an FLV file, detailed below. This ultimately resulted in a custom backdoor known as SHOTPUT, detected by FireEye as Backdoor.APT.CookieCutter, being delivered to the victim’s system.\"\n\"The attack exploits an unpatched vulnerability in the way Adobe Flash Player parses Flash Video (FLV) files,\" the researchers explained. \"The exploit uses common vector corruption techniques to bypass Address Space Layout Randomization (ASLR), and uses Return-Oriented Programming (ROP) to bypass Data Execution Prevention (DEP). A neat trick to their ROP technique makes it simpler to exploit and will evade some ROP detection techniques. Shellcode is stored in the packed Adobe Flash Player exploit file alongside a key used for its decryption. The payload is xor encoded and hidden inside an image.\"\nAPT3 has been linked to the use of browser-based zero-days in the past, and will typically dump credentials and move laterally across a compromised network to hit additional victims, the FireEye researchers added.\n\"Now that the exploit has been discovered, most security and operations teams are scrambling to do one of two things – race to deploy the newest patch before hackers can leverage the exploit for an attack,\" said Clinton Karr, senior security strategist at Bromium. \"Or test the patch to make sure it integrates with legacy systems. This latest zero-day and others before it could have been isolated in the first place. Only by isolating the threat are security and ops teams granted the grace period needed to test and deploy these critical patches.\"\n\"The vulnerability lies in the video decoding part of Flash and the exploit shows some signs of sophistication by introducing new techniques in their use of ROP,\" blogged Qualys CTO Wolfgang Kandek. \"Patch as quickly as possible. 0-days once discovered this way tend to spread quickly to other cyber criminal groups. Adobe mentions that all known targets seem to use Windows 7 and Internet Explorer and Firefox on Windows XP, but we don't recommend holding back on patching even if you are running other configurations (hopefully not XP, though). Users of IE10\/11 and Google Chrome will get their patches through their browsers directly, everybody else will need to download directly from Adobe.\"","url":"https:\/\/www.securityweek.com\/adobe-flash-player-zero-day-exploited-attack-campaign"},{"Unnamed: 0":6,"query":"APT3","text":"State-Sponsored Attackers Use Web Analytics for Reconnaissance\r\n\nA threat group believed to be sponsored by a nation state has compromised over 100 websites in an effort to track and profile potential targets, FireEye reported on Monday.\nThe reconnaissance campaign, which FireEye has been tracking since last year, is similar and possibly related to the activities of the Russia-linked advanced persistent threat (APT) group identified as Waterbug (Symantec) and Turla (Kaspersky Lab). The actor is mainly known for its operations involving malware toolkits such as Turla (Snake\/Uroburos) and Epic Turla (Wipbot\/Tavdig).\nWeb analytics allows advertisers and other organizations to measure web traffic and determine the most efficient ways of reaching the targeted audience. However, the same tools and techniques can also be leveraged by malicious actors.\nAccording to FireEye, attackers have used web analytics and open source tools to collect data about potential victims and their devices, information they can use to track and profile targets and possibly infect them with malware.\nThe group monitored by the security firm has hijacked more than 100 carefully selected websites in what is referred to as a strategic web compromise. On these websites, the malicious hackers injected a small piece of code that silently redirects visitors to a second compromised website that hosts a profiling script.\nThe script, dubbed by FireEye “WITCHCOVEN,” collects the victim’s computer and browser configuration and deploys a persistent tracking cookie, also known as a “supercookie,” on their device.\n“We believe the actors analyze the collected data to identify unique users and pair them with information about their computer to later deploy exploits tailored to their particular software and computer configuration,” FireEye said in its report.\nFor example, if the attackers determine that the targeted user is running outdated software that is known to contain serious vulnerabilities, they can easily hack their machine using available exploits, without the need to expose zero-days. Zero-day exploits are likely used only against a limited number of victims whose computers are fully patched, FireEye explained.\nFireEye says this tactic has been used in targeted operations by other APT groups, including the Chinese actor APT3 in Operation Clandestine Wolf, and the Russian group APT28 in Operation Russian Doll.\nThe data collected by the threat group observed by FireEye can also be useful for creating well-crafted spear phishing emails, for building a user profile that can be leveraged for traditional espionage, and creating a database of potential targets, the security firm said.\nFireEye has determined that the more than 100 compromised websites are likely to be visited by people interested in international travel, diplomacy, international economics, energy production and policy, and government matters. The list of targets includes government, embassy, higher education and research, entertainment and culture, NGO, international law, media, consumer goods and retail, energy, construction and engineering, visa services, and high tech websites in tens of countries across the world.\nOf particular interest appear to be executives, military personnel, government officials, and diplomats from Europe and the United States.\nFireEye customers in sectors such as education, government, financial services, energy and utilities, legal, healthcare, entertainment, media, hospitality, manufacturing, services and consulting, and high tech have reported seeing WITCHCOVEN infections.\nThe security firm believes the reconnaissance campaign is sponsored by a nation state based on the profile of the targeted entities, the scale of the activity and the scope of the operation, and the lack of obvious exploit or malware delivery, which indicates that the attackers want to limit exposure of their tools most likely because they are running a long-term operation with specific intelligence requirements.\nRelated Reading: Researchers Hack Infrastructure of Iran-Linked Cyber Spies","url":"https:\/\/www.securityweek.com\/state-sponsored-attackers-use-web-analytics-reconnaissance"},{"Unnamed: 0":7,"query":"APT3","text":"New Adobe Flash Player Flaw Shares Similarities With Previous Vulnerability: Trend Micro\r\n\nResearchers at Trend Micro say the zero-day vulnerability patched Tuesday by Adobe Systems has a similar underlying cause as an older flaw.\nOn Tuesday, Adobe patched CVE-2015-3113 - a vulnerability in Adobe Flash Player being exploited in the wild by the attack group APT3.\n\"Our analysis of the current flaw reveals that the root cause of CVE-2015-3113 is similar to CVE-2015-3043,\" blogged Trend Micro Threats Analyst Peter Pi. \"Both cause a buffer overflow within the Flash Player code. In fact, code targeting the previous exploit can also cause crashes in version 18.0.0.160 (the version immediately before this emergency update).\"\nBoth vulnerabilities can be used to run arbitrary code on targeted systems if they visit a site with a malicious Flash file. Both are also heap overflow vulnerabilities in the FLV audio parsing flow, reside in how Flash Player processes audio with the Nellymoser codec and can be triggered by modifying the FLV file’s audio tag, explained Pi.\n\"They both overflow a hardcoded length heap buffer with a length of 0x2000,\" he wrote. \"CVE-2015-3043 and CVE-2015-3113 both trigger this bug using sample_count * sample_size > 0x2000, and bypass the length check.\"\nAdobe patched CVE-2015-3043 in 17.0.0.169 by limiting the sample count acquired from the FLV audio tag. In version 18.0.0.160, the code underwent significant changes, Pi noted.\n\"The GetSampleCount function checks the final buffer size needed,\" he explained. \"If the final buffer size is larger than 0x2000, it will limit it to 0x2000. However, this ignores the Nellymoser decode function’s hardcoded double operation; this can be used to trigger a heap buffer overflow once again.\"\nAccording to Pi, both vulnerabilities \"share the same underlying root cause.\"\n\"This incident highlights how important careful development of patches is, to prevent patched bugs from being re-exploited at a later time,\" Pi wrote. \"Regression testing must also be a part of software development in order to check that old bugs do not threaten new versions of software.\"\nIn a statement to SecurityWeek, Adobe said it performs regression testing as part of its standard testing process.\n\"As the Trend Micro article notes, CVE-2015-3113 and CVE-2015-3043 are similar, but different,\" according to the company. \"We will be performing a 0-day review on this issue to determine whether the regression test did not consistently reproduce the issue or whether there is another reason the similarity was not immediately noted and addressed.\"","url":"https:\/\/www.securityweek.com\/new-adobe-flash-player-flaw-shares-similarities-previous-vulnerability-trend-micro"},{"Unnamed: 0":0,"query":"APT3","text":"Buckeye cyberespionage group shifts gaze from US to Hong Kong Several organizations in Hong Kong are being targeted by a cyberespionage group known as Buckeye. Buckeye (also known as APT3, Gothic Panda, UPS Team, and TG-0110) is a cyberespionage group that is believed to have been operating for well over half a decade. Traditionally, the group attacked organizations in the US as well as other targets. However, Buckeye’s focus appears to have changed as of June 2015, when the group began compromising political entities in Hong Kong. Since March 2016, the group has appeared to mostly focus on organizations in Hong Kong, sending malicious emails to targets as recently as August 4, and attempting to spread within compromised networks in order to steal information. Using the combined threat intelligence of Symantec and Blue Coat Systems, we have built a clear and concise picture of how Buckeye has evolved its tactics in recent years. This has allowed us to further enhance our protection capabilities against the group’s campaigns. Background Symantec has observed Buckeye activity dating back to 2009, involving attacks on various organizations in several regions. Buckeye used a remote access Trojan (Backdoor.Pirpi) in attacks against a US organization’s network in 2009. The group delivered Backdoor.Pirpi through malicious attachments or links in convincing spear-phishing emails. Symantec has identified additional tools used by the group, which will be discussed later. Buckeye has been known to exploit zero-day vulnerabilities in the past, such as CVE-2010-3962 in an campaign in 2010 and CVE-2014-1776 in 2014. Although other zero-day attacks have been reported, they have not been confirmed by Symantec. All zero-day exploits known, or suspected, to have been used by this group are for vulnerabilities in Internet Explorer and Flash. Shifting focus of attacks More recently, Symantec telemetry has revealed Backdoor.Pirpi connections from compromised computers based in Hong Kong dating back to August 2015. The infections significantly increased in number towards the end of March 2016 and the beginning of April 2016. Additional investigations discovered related malware samples and determined that targeted organizations were political entities in Hong Kong. In at least some of these recent attacks, Buckeye used spear-phishing emails with a malicious .zip attachment. The .zip archive attached to the email contains a Windows shortcut (.lnk) file with the Microsoft Internet Explorer logo. Clicking on the shortcut ultimately leads to Backdoor.Pirpi being downloaded and executed on the affected computer. Who’s being targeted? From 2015 to date, Symantec identified approximately 82 organizations in various regions that had Buckeye tools present on their network. However, this is not an accurate picture of the targets of interest to Buckeye. The group casts a wide net while trawling for targets but only remains active on the networks of organizations it is interested in. Symantec determined a more accurate picture of Buckeye’s targets by looking at where Buckeye remained active on the network longer than a day, deployed additional tools, and spread onto multiple computers. After these filters were applied to our data, we found a total of 17 organizations, located in Hong Kong (13), the US (3), and the UK (1). It should be noted that this data goes back to 2015 and that the proportion of targets in Hong Kong from March 2016 would be considerably higher. Up to mid-2015, Buckeye’s traditional targets were varying categories of US organizations, which match the types of victims seen in the UK. Buckeye interests changed substantially around June 2015 when the group began infecting organizations in Hong Kong. Infections in the UK and US ceased shortly after this time. Malware and tools Buckeye uses a number of hacking tools as well as malware. Many of the hacking tools are open source applications that have been patched or modified in some manner by Buckeye in an attempt to evade detection. Buckeye uses Backdoor.Pirpi, a remote access Trojan capable of reading, writing, and executing files and programs. Backdoor.Pirpi also collects information about the target’s local network, including the domain controller and workstations. As mentioned previously, Buckeye also uses a number of hacking tools, including the following: Keylogger: The keylogger is configured using the command line parameters: NetworkService, Replace, Install, Register and Unregister. These parameters install it as a service. The keylogger then records keystrokes in encrypted files, for example: thumbcache_96.dbx. It also gathers network information such as the MAC address, IP address, WINS, DHCP server, and gateway. RemoteCMD: This tool executes commands on remote computers, similar to the PsExec tool. Usage is: %s shareIp domain [USER INFORMATION|[USER NAME AND PASSWORD]] [\/run:[COMMAND]] The commands to be passed consist of upload, download, Service (create, delete, start, stop), delete, rename, and AT PwDumpVariant: This tool imports lsremora.dll (often downloaded by the attacker as part of the toolset) and uses the GetHash export of this DLL. On execution, the tool injects itself into lsass.exe and is triggered with the argument “dig”. OSinfo: OSInfo is a general purpose, system information gathering tool. It has the following command line argument help: info <Server\/Domain> [options] [options]: -d Domain -o OsInfo -t TsInfo -n NetuseInfo -s ShareInfo ShareDir -c Connect Test -a Local And Global Group User Info -l Local Group User Info -g Global Group User Info -ga Group Administrators -gp Group Power Users -gd Group Domain Admins -f <infile> \/\/input server list from infile, OneServerOneLine info <\\\\server> <user> ChromePass: A tool from NirSoft used for recovering passwords stored in the Chrome browser. Lazagne: A compiled Python tool that extracts passwords from various locally installed application classes, such as web browsers. The full list is: chats, svn, wifi, mails, windows, database, sysadmin, and browsers. Buckeye seems to target file and print servers, which makes it likely the group is looking to steal documents. This, coupled with the group’s use of zero-day exploits in the past, customized tools, and the types of organizations being targeted would suggest that Buckeye is a state-sponsored cyberespionage group. Protection Symantec, Norton, and Blue Coat products protect against the activities of this cyberespionage group. Symantec and Norton products offer the following detections: Antivirus Backdoor.Pirpi Backdoor.Pirpi!dr Backdoor.Pirpi!gen1 Backdoor.Pirpi!gen2 Backdoor.Pirpi!gen3 Backdoor.Pirpi!gen4 Backdoor.Pirpi.A Backdoor.Pirpi.B Backdoor.Pirpi.C Backdoor.Pirpi.D Downloader.Pirpi Downloader.Pirpi!g1 Intrusion prevention system System Infected: Backdoor.Pirpi Activity 3 Update–September 14, 2016: Indicators of compromise We have compiled a list of indicators of compromise for the campaigns described in this blog.","url":"https:\/\/www.symantec.com\/connect\/blogs\/buckeye-cyberespionage-group-shifts-gaze-us-hong-kong"}]