[{"Unnamed: 0":0,"query":"APT30","text":"Today FireEye released a report on a threat group we call APT 30 – one of many threat groups we track. You may have seen other reports from FireEye that talk about attackers focused directly on Western targets - but this report details an attack group specifically targeting governments and businesses across the Indian subcontinent and the ASEAN nations. These persistent and methodical attackers have successfully targeted organizations across these regions for a decade, and have largely evaded detection until recently.  If any organization, large or small, felt that advanced cyber attack affected only well-known companies and countries with large GDPs, this report should make you think twice.  As APAC CTO for FireEye, I regularly find that organizations in Asia feel they are not likely to be a target of advanced cyber threat. In fact, advanced attackers, aware of the complacency, are exploiting it. The reality is that groups like APT 30 are actively and successfully stealing sensitive information across the region, and this region has some of the highest levels of targeted attacks that we see across the world. Asia’s businesses and governments are heavily targeted, but without the ability to detect these attacks they are largely unprotected from their impacts. This group has been able to operate successfully and remain undetected for many years and has not even had to change their attack infrastructure – a clear sign that their victims don’t realize this is happening.  Business and government leaders should take action: cyber espionage, including that conducted by nation-states, is a very real problem across India and ASEAN. Today, 37% of FireEye’s customers in APAC detected advanced cyber attacks in the 2nd half of 2014 – in other words our customers in this region are 33% more likely to be targeted than the global average of 27%. This attack group, and others, are collectively stealing vast troves of information from all levels of government, defense, media, finance, manufacturing, telecommunications, and other industries - everything from business plans to contract negotiations to manufacturing and design schematics.  The impacts can include the loss of key intellectual property, enabling competitors to steal market share, the loss of negotiation position information leading to inferior contracts and terms of trade, and the loss of major construction contracts due to competitive underbidding.  The economic and diplomatic impacts of such espionage are very serious; since most governments and businesses in the region don't have the ability to detect, prevent, analyze and respond to these attacks, we may never know the full impact of APT30. What is clear is that these attacks can be detected and the impacts can be addressed but only with the right combination of technology, intelligence and expertise.  For security practitioners, we have shared our Indicators of Compromise for you to deploy in your environments here: https:\/\/github.com\/fireeye\/iocs  You can access the report here .","url":"https:\/\/www.fireeye.com\/\/blog\/executive-perspective\/2015\/04\/apt30_and_lessonsfo.html"},{"Unnamed: 0":1,"query":"APT30","text":"APT30: The Mechanics\nBehind a Decade Long Cyber Espionage Operation     When our Singapore-based FireEye Labs team\nexamined malware aimed predominantly at entities in Southeast Asia and\nIndia, we suspected that we were peering into a regionally focused\ncyber espionage operation. In our latest Threat Intelligence Report,\n“APT 30 and the Mechanics of a Long-Running Cyber Espionage\nOperation,” we uncover a decade-long operation focused on\ntargets—government and commercial—who hold key political, economic,\nand military information about the region.  This report shares the tools, tactics,\nand procedures of APT 30 for organizations across the region to\nquickly begin to detect, prevent, analyze, and respond to this\nconsistent threat. It also outlines the profile of the attacker for\nsecurity practitioners to better understand their threats.  In this report you will learn:   How cyber espionage is not limited\nto targeting just the United States  Why the South East\nAsian region has a specific set of challenges in cyber security  Why the most successful APT groups use the path of least\nresistance to evade detection  The benefits of sharing\nThreat Intelligence publicly   Download the report today.","url":"https:\/\/www.fireeye.com\/\/current-threats\/apt-groups\/rpt-apt30.html"},{"Unnamed: 0":0,"query":"APT30","text":"The MsnMM Campaigns [pdf]  For over half a decade, the Naikon APT waged multiple attack campaigns on sensitive targets throughout South-eastern Asia and around the South China Sea. It maintained a heavy offensive focus on Myanmar, Vietnam, Singapore, the Philippines, Malaysia, and Laos. Targets and victims included ASEAN governmental agencies and government departments, investment enterprises, military, law enforcement and border control organizations, embassies, university faculties and others.  Parts of the campaigns have been publicly discussed according to the nature of their tools. For example, the MsnMM backdoors started out with internal names like “WinMM” and “SslMM”, and their file naming spoofed MSN Talk and Msn Gaming Zone. The backdoor term “naikon” was derived from the User-Agent string “NOKIAN95”. But msnMM, naikon, sakto, and rarstone backdoors are all used by the same actor that we call the Naikon APT. Their second stage tools largely remained unknown, but a list is included in this report.  The Naikon attackers attempted to exfiltrate sensitive geo-political, military, and economic data; to intercept communications and to maintain surveillance on their victims throughout the MsnMM campaigns. Their toolset and techniques changed over time in many minor ways, and appear to be run by Chinese-speaking individuals. The group’s infrastructure, reliant on web apps located mostly via dynamic dns domains, overlapped across these campaigns. As previously described, the APT’s methods and technologies are simple, but highly effective against its targets’ defenses. We do not find 0-days here.  Much of Naikon’s spear-phish and decoy document content, as well as its deployment, coincided approximately with highly-charged geopolitical events. The consistent list of military, economic, and political targets gave away the actor’s interests. Naikon’s earliest campaigns deployed the exe_exchange, winMM, and sys10 backdoors, and the codebase was later built out into more custom tools. The MsnMM campaigns were waged into the start of 2014, and then dropped off before picking up again later in the year and into 2015.  Regarding interaction with other APTs, it’s interesting to note that Naikon APT victims overlap with Cycldek APT victims.  Cycldek is another persistent, but weaker APT. In addition, not only does the APT30 target profile match the Naikon APT, its toolset also features minor but noticeable similarities. And the later Naikon campaigns led to an all out APT v APT confrontation with the Hellsing APT , when “the empire struck back.”  Although aspects of the malware set have been discussed on some blogs and in other papers, there hasn’t been an accurate report bringing together details of the MsnMM, Sys10, and Naikon campaigns as the work of one crew, the Naikon APT. Finally, while this report looks into their past activity, the Naikon APT remains active, deploying a more recent codebase. The top targets for 2015 that we are aware of include organizations in Myanmar, Cambodia, Vietnam, Thailand, and Laos.","url":"https:\/\/securelist.com\/the-naikon-apt-and-the-msnmm-campaigns\/70029\/"},{"Unnamed: 0":1,"query":"APT30","text":"Our recent report, “ The Chronicles of the Hellsing APT: the Empire Strikes Back ” began with an introduction to the Naikon APT, describing it as “One of the most active APTs in Asia, especially around the South China Sea”. Naikon was mentioned because of its role in what turned out to be a unique and surprising story about payback. It was a Naikon attack on a Hellsing-related organization that first introduced us to the Hellsing APT.  Considering the volume of Naikon activity observed and its relentless, repeated attack attempts, such a confrontation was worth looking into, so we did.  The #NaikonAPT group was spear-phished by an actor we now call “Hellsing” Tweet  The Naikon APT aligns with the actor our colleagues at FireEye recently revealed to be APT30 , but we haven’t discovered any exact matches. It is hardly surprising that there is an element of overlap, considering both actors have for years mined victims in the South China Sea area, apparently in search of geo-political intelligence.  The #NaikonAPT group has for 5 years mined victims, apparently in search of geo-political intelligence Tweet  This Naikon report will be complemented by a follow-on report that will examine the Naikon TTP and the incredible volume of attack activity around the South China Sea that has been going on since at least 2010.  Noteworthy operational and logistical characteristics of this APT include:   At least five years of high volume, high profile,  geo-political attack activity  Geographical  focus – per-country, individual operator assignment and proxy presence  Dynamic, well organized infrastructure  Reliance on an externally developed, consistent set of tools comprising a full-featured backdoor, a builder, and an exploit builder  High success rate in infiltrating national organisations in ASEAN countries   Highly Focused and Effective Around the South China Sea  In the spring of 2014, we noticed an increase in the volume of attack activity by the Naikon APT. The attackers appeared to be Chinese-speaking and targeted mainly top-level government agencies and civil and military organizations in countries such as the Philippines, Malaysia, Cambodia, Indonesia, Vietnam, Myanmar, Singapore, Nepal, Thailand, Laos and China.   Decoy  An attack typically starts with an email carrying an attachment that contains information of interest to the potential victim. The document may be based on information from open sources or on proprietary information stolen from other compromised systems.  This bait “document”, or email attachment, appears to be a standard Word document, but is in fact an CVE-2012-0158 exploit, an executable with a double extension, or an executable with an RTLO filename, so it can execute code without the user’s knowledge or consent. When the executable is launched, spyware is installed on the victim computer at the same time as a decoy document is displayed to the user; fooling them into thinking they have simply opened a document.  Configuration  The Naikon tool of choice generates a special, small, encrypted file which is 8,000 bytes in size, containing code to be injected into the browser along with configuration data. With the help of a start-up module, this whole file is injected into the browser memory and decrypts the configuration block containing the following:   C&C server  Ports and path to the server  User-agent string  Filenames and paths to its components  Hash sums of the user API functions   The same code then downloads its main body from the C&C server using the SSL protocol, loads it independently from the operating system functions and, without saving it to the hard drive, hands over control to the XS02 function. All functionality is handled in memory.   Payload  The main module is a remote administration utility. Using SSL, the module establishes a reverse connection to the C&C server as follows: it sets up an outgoing connection to the C&C server and checks if there is a command that it should execute. If there is, it executes the command and returns the result to the C&C. There are 48 commands in the module’s repertoire, which a remote operator can use to effectively control the victim computer. This includes taking a complete inventory, downloading and uploading data, installing add-on modules, or working with the command line.  The main module supports 48 commands, which the attackers can use to control the victim machine #NaikonAPT Tweet  Here is the complete list of commands:      0  CMD_MAIN_INFO    1  CMD_PROCESS_REFRESH    2  CMD_PROCESS_NAME    3  CMD_PROCESS_KILL    4  CMD_PROCESS_MODULE    5  CMD_DRIVE_REFRESH    6  CMD_DIRECTORY    7  CMD_DIRECTORY_CREATE    8  CMD_DIRECTORY_CREATE_HIDDEN    9  CMD_DIRECTORY_DELETE    10  CMD_DIRECTORY_RENAME    11  CMD_DIRECOTRY_DOWNLOAD    12  CMD_FILE_REFRESH    13  CMD_FILE_DELETE    14  CMD_FILE_RENAME    15  CMD_FILE_EXECUTE_NORMAL    16  CMD_FILE_EXECUTE_HIDDEN    17  CMD_FILE_EXECUTE_NORMAL_CMD    18  CMD_FILE_EXECUTE_HIDDEN_CMD    19  CMD_FILE_UPLOAD    20  CMD_FILE_DOWNLOAD    21  CMD_WINDOWS_INFO    22  CMD_WINDOWS_MESSAGE    23  CMD_SHELL_OPEN    24  CMD_SHELL_CLOSE    25  CMD_SHELL_WRITE    26  CMD_SERVICE_REFRESH    27  CMD_SERVICE_CONTROL    28  CMD_PROGRAM_INFO    29  CMD_UNINSTALL_PROGRAM    30  CMD_REGESTRY_INFO    31  CMD_ADD_AUTO_START    32  CMD_MY_PLUGIN    33  CMD_3RD_PLUGIN    34  CMD_REG_CREATEKEY    35  CMD_REG_DELETEKEY    36  CMD_REG_SETVALUE    37  CMD_REG_DELETEVALUE    38  CMD_SELF_KILL    39  CMD_SELF_RESTART    40  CMD_SELF_CONFIG    41  CMD_SELF_UPDATE    42  CMD_SERVER_INFO    43  CMD_INSTALL_SERVICE    44  CMD_FILE_DOWNLOAD2    45  CMD_RESET    46  CMD_CONNECTION_TABLE    50  CMD_HEART_BEAT      Several modifications of the main module exist. There are no fundamental differences between modifications; it’s just that extra features get added to the latest versions, such as compression and encryption of transmitted data, or the piecemeal download of large files.      d085ba82824c1e61e93e113a705b8e9a  118272  Aug 23 18:46:57 2012    b4a8dc9eb26e727eafb6c8477963829c  140800  May 20 11:56:38 2013    172fd9cce78de38d8cbcad605e3d6675  118784  Jun 13 12:14:40 2013    d74a7e7a4de0da503472f1f051b68745  190464  Aug 19 05:30:12 2013    93e84075bef7a11832d9c5aa70135dc6  154624  Jan 07 04:39:43 2014      CC-Proxy-Op  C&C server operations are characterized by the following:   Low maintenance requirements  Organized geo-specific task assignments  Different approaches to communication   The C&C servers must have required only a few operators to manage the entire network. Each operator appears to have focused on their own particular set of targets, because a correlation exists between C&C and the location of targets\/victims.  There is a geo-specific correlation between the location of #NaikonAPT C&Cs and that of targets\/victims Tweet  Communication with victim systems changed depending on the target involved. In some cases, a direct connection was established between the victim computer and the C&C. In other cases, the connection was established via dedicated proxy servers installed on dedicated servers rented in third countries. In all likelihood, this additional setup was a reaction to the network administrators in some targets limiting or monitoring outbound network connections from their organizations.  Here is a partial list of C&C servers and victim locations, demonstrating the geo-specific correlation:      ID  Jakarta  linda.googlenow.in    ID  Jakarta  admin0805.gnway.net    ID  Jakarta  free.googlenow.in    ID   frankhere.oicp.net    ID  Bandung  frankhere.oicp.net    ID  Bandung  telcom.dhtu.info    ID  Jakarta  laotel08.vicp.net    JP  Tokyo  greensky27.vicp.net    KH   googlemm.vicp.net    KH  Phnom Penh  googlemm.vicp.net    MM   peacesyou.imwork.net    MM   sayakyaw.xicp.net    MM   ubaoyouxiang.gicp.net    MM  Yangon  htkg009.gicp.net    MM   kyawthumyin.xicp.net    MM   myanmartech.vicp.net    MM   test-user123.vicp.cc    MY   us.googlereader.pw    MY   net.googlereader.pw    MY   lovethai.vicp.net    MY   yahoo.goodns.in    MY  Putrajaya  xl.findmy.pw    MY  Putrajaya  xl.kevins.pw    PH  Caloocan  oraydns.googlesec.pw    PH  Caloocan  gov.yahoomail.pw    PH   pp.googledata.pw    PH   xl.findmy.pw    PH   mlfjcjssl.gicp.net    PH   o.wm.ggpw.pw    PH   oooppp.findmy.pw    PH   cipta.kevins.pw    PH   phi.yahoomail.pw    SG  Singapore  xl.findmy.pw    SG  Singapore  dd.googleoffice.in    VN  Hanoi  moziliafirefox.wicp.net    VN  Hanoi  bkav.imshop.in    VN  Hanoi  baomoi.coyo.eu    VN  Dong Ket  macstore.vicp.cc    VN  Hanoi  downloadwindows.imwork.net    VN  Hanoi  vietkey.xicp.net    VN  Hanoi  baomoi.vicp.cc    VN  Hanoi  downloadwindow.imwork.net    VN  Binh Duong  www.ttxvn.net    VN  Binh Duong  vietlex.gnway.net    VN  Hanoi  www.ttxvn.net    VN  Hanoi  us.googlereader.pw    VN  Hanoi  yahoo.goodns.in    VN  Hanoi  lovethai.vicp.net    VN  Hanoi  vietlex.gnway.net      XSControl – the Naikon APT’s “victim management software”  In the Naikon scheme, a C&C server can be specialized XSControl software running on the  host machine. It can be used to manage an entire network of infected clients. In some cases, a proxy is used to tunnel victim traffic to the XSControl server. A Naikon proxy server is a dedicated server that accepts incoming connections from victim computers and redirects them to the operator’s C&C. An individual Naikon proxy server can be set up in any target country with traffic tunnelling from victim systems to the related C&C servers  XSControl is written in .NET with the use of DevExpress:    Its main capabilities are:   Accept initial connections from clients  Provide clients with the main remote administration module  Enable them to remotely administer infected computers with the help of a GUI  Keep logs of client activity  Keep logs of operator activity  Upload logs and files to an FTP server   The operator’s activity logs contain the following:   An XML database of downloaded files, specifying the time of operation, the remote path and the local path  A database of file names, the victim computer registry keys for the folders and requested sections  A history of executed commands   Country X, Operator X  Now let’s do an overview of one Naikon campaign, focusing on country “X”.  Analysis revealed that the cyber-espionage campaign against country X had been going on for many years. Computers infected with the remote control modules provided attackers with access to employees’ corporate email and internal resources, and access to personal and corporate email content hosted on external services.  Below is a partial list of organizations affected by Naikon’s “operator X’s” espionage campaign in country X.   Office of the President  Military Forces  Office of the Cabinet Secretary  National Security Council  Office of the Solicitor General  Intelligence Services  Civil Aviation Authority  Department of Justice  Federal Police  Executive\/Presidential Administration and Management Staff   A few of these organizations were key targets and under continuous, real-time monitoring. It was during operator X’s network monitoring that the attackers placed Naikon proxies within the countries’ borders, to cloak and support real-time outbound connections and data exfiltration from high-profile victim organizations.  In order to obtain employees’ credentials, operator X sometimes used keyloggers. If necessary, operator X delivered them via the remote control client. In addition to stealing keystrokes, this attacker also intercepted network traffic. Lateral movements included copying over and remotely setting up winpcap across desktop systems within sensitive office networks, then remotely setting up AT jobs to run these network sniffers. Some APTs like Naikon distribute tools such as these across multiple systems in order to regain control if it is lost accidentally and to maintain persistence.  The #NaikonAPT group took advantage of cultural idiosyncrasies in its target countries Tweet  Operator X also took advantage of cultural idiosyncrasies in its target countries, for example, the regular and widely accepted use of personal Gmail accounts for work. So it was not difficult for the Naikon APT to register similar-looking email addresses and to spear-phish targets with attachments, links to sites serving malware, and links to google drive.  The empire strikes back  Every once in a while the Naikon group clashes with other APT groups that are also active in the region. In particular, we noticed that the Naikon group was spear-phished by an actor we now call “Hellsing”. More details about the cloak and dagger games between Naikon and Hellsing can be found in our blogpost: “ The Chronicles of the Hellsing APT: The Empire Strikes Back “.   Read more about how you can protect your company against the Naikon threat actor here","url":"https:\/\/securelist.com\/the-naikon-apt\/69953\/"},{"Unnamed: 0":0,"query":"APT30","text":"FireEye Uncovers Decade-Long Cyber Espionage Campaign Targeting South East Asia\r\n\n\nFireEye on Sunday uncovered details of a decade-long cyber espionage campaign carried out by China targeting governments, journalists and businesses in South East Asia and India.\nLikely state sponsored by the Chinese government, FireEye said the threat actor group has been conducting cyber espionage operations since at least 2005 and is one of the first to use malware that infects air-gapped networks.\nDubbed APT30 by FireEye, the group is supported by seasoned software developers following well-organized software development practices.\nAccording to FireEye, the attackers are “particularly interested” in targets holding information related to regional political, military, and economic issues, disputed territories, and media outlets and journalists who cover topics pertaining to China and the legitimacy of the Chinese Communist Party.\nThe group has consistently targeted organizations located in Malaysia, Vietnam, Thailand, Nepal, Singapore, Philippines and Indonesia among others.\nIn a 69-page report released Sunday, FireEye said APT30 uses three pieces of malware designed to spread to removable drives with the intent of eventually infecting and stealing data from computers located on air-gapped networks. \n“While APT30 is certainly not the only group to build functionality to infect air-gapped networks into their operations, they appear to have made this a consideration at the very beginning of their development efforts in 2005, significantly earlier than many other advanced groups we track,” the report said.\nThe attackers are likely operating at a sufficiently large scale that they benefit from the automated management of many of their tools, FireEye said, adding that the threat actors are interested in maintaining the latest and greatest versions of their tools in their victims’ environments.\n“This suite of tools includes downloaders, backdoors, a central controller, and several components designed to infect removable drives and cross air-gapped networks to steal data,” the report said.\nFireEye said many of the attack tools have not been used by any other threat actors.\nInterestingly, the attack tools, tactics, and procedures (TTPs) have remained markedly consistent since inception – a rare finding as most APT actors typically change up their TTPs regularly to evade detection, FireEye said.\nThe developers of the attack tools “systematically label” and keep track of their malware versioning and go as far as using mutexes and events to ensure only a single copy is running at any given time.\nThe malware command and control (C2) communications include a version check feature that enables the malware to update itself and provide a continuous update management capability. \u2028 \nThe attackers frequently registered their own domains for use with malware C2, some of the which have been in use for many years.\n“APT30 appears to focus not on stealing businesses’ valuable intellectual property or cutting-edge technologies, but on acquiring sensitive data about the immediate Southeast Asia region, where they pursue targets that pose a potential threat to the influence and legitimacy of the Chinese Communist Party,” the report concluded.\nFireEye believes the attempts to compromise journalists and media outlets could be used to punish outlets that do not provide favorable coverage. \nAs expected, China denied any involvement in the cyber attacks.\n\"The Chinese government firmly opposes hacking attacks, this position is consistent and clear,\" foreign ministry spokesman Hong Lei in Beijing, told AFP.\n“Advanced threat group like APT 30 illustrate that state-sponsored cyber espionage affects a variety of governments and corporations across the world,” said Dan McWhorter, VP of threat intelligence at FireEye. “Given the consistency and success of APT 30 in Southeast Asia and India, the threat intelligence on APT 30 we are sharing will empower the region’s governments and businesses to quickly begin to detect, prevent, analyze and respond to this established threat.”\nThe report is available online in PDF format.\nFireEye also plans to publish indicators of compromise (IOCs) which can be downloaded from GitHub to help organizations detect APT 30 activity.\n*Updated with China response","url":"https:\/\/www.securityweek.com\/fireeye-uncovers-decade-long-cyber-espionage-campaign-targeting-south-east-asia"},{"Unnamed: 0":1,"query":"APT30","text":"Naikon Threat Group Linked to Chinese Army\r\n\nCyber threat intelligence companies ThreatConnect and Defense Group released on Thursday a joint report linking the advanced persistent threat (APT) group known as “Naikon” to a unit of the Chinese People’s Liberation Army (PLA).\nNaikon, a threat actor that has been active since at least 2010, has been targeting organizations around the South China Sea in search for geopolitical intelligence. The group has focused its efforts on breaching the systems of government, military and civil organizations in countries such as Malaysia, the Philippines, Cambodia, Vietnam, Indonesia, Myanmar, Singapore, Laos and Nepal.\nThe activities of what later would become known as the Naikon APT came to light in 2012 when a hacktivist using the online moniker “Hardcore Charlie” published thousands of documents allegedly stolen from the systems of a Beijing-based military contractor named the China National Import & Export Corp (CEIEC). The files appeared to come from the networks of various governments and businesses in the U.S. and countries in the South China Sea region.\nThe group’s operations and tools were later analyzed by researchers at Trend Micro, ThreatConnect, which in may 2014 noted that the actor’s efforts were aligned with the Chinese government’s interests, and Kaspersky, which noted in a report published earlier this year that the members of the group were Chinese speakers.\nThe report published now by ThreatConnect and Defense Group covers various aspects of Naikon’s operations, including infrastructure, tools and tactics. However, researchers have focused on the connection between Naikon and one of the PLA’s technical reconnaissance bureaus (TBRs), namely the one located in the Chinese city of Kunming and known as Unit 78020.\nThe report has been released just as Chinese President Xi Jinping heads to Washington for summit talks with his U.S. counterpart Barack Obama on topics such as cyber theft and the South China Sea.\nThe intelligence gathered by ThreatConnect and Defense Group for attribution purposes focuses on a dynamic domain used by Naikon since at least 2010, namely greensky27.vicp.net.\nAn analysis of the IP addresses associated with this domain shows that the city of Kunming is a central hub since a majority of connections have been traced there.\nThis and other data collected by experts has led them to believe that the individual controlling greensky27.vicp.net is located near or in Kunming. Further analysis has revealed that this person is likely a PLA officer named Ge Xing.\nOne of the clues tying Ge Xing to the greensky27.vicp.net domain is the “GreenSky27” moniker. The man has utilized this username on several online platforms, including the microblogging platform QQ Weibo, forums, and social media websites.\nAccount information collected by researchers along with photographs posted by GreenSky27 on the Web allowed investigators to determine that Ge Xing from Kunming is behind this online moniker. Furthermore, evidence available on Chinese websites and his online profiles shows the connection between this individual and the PLA.\n“He launched his career as a PLA officer by attending the PLA International Studies University in 1998. Academic papers written by Ge Xing as a graduate student specifically place him at the Kunming TRB in 2008. Photos from his GreenSky27 QQ Weibo account from 2011 to 2014 place him at the Kunming TRB headquarters compound, underscoring his ongoing connection with the PLA,” researchers wrote in their report.\nAfter finding evidence linking Ge Xing to the PLA, experts looked for clues showing the man’s involvement in the Naikon campaigns. Researchers determined that whenever Ge’s posts on personal accounts indicated that he was traveling outside of Kunming, the greensky27.vicp.net infrastructure was either offline or parked. The domain went dormant when Ge’s child was born and when he visited a memorial hall dedicated to his family’s ancestors.\nThreatConnect and Defense Group also noted that activity on the domain dropped considerably in May 2014 when the U.S. Department of Justice announced charging five Chinese military officers from the Army’s Unit 61398. On the same day, ThreatConnect published a report on Naikon’s activities.\nIn the report published this year, Kaspersky Lab pointed out that Naikon’s activities align closely with a group dubbed by FireEye “APT30.” Toni Gidwani, director of analysis and production at ThreatConnect, noted that APT30 is a different group.\n“Although there appears to be some common targeting between the two APTs, there are differences between how the two register and manage their infrastructure,” Gidwani told SecurityWeek. “At this point in our research, we would not say they align closely although that certainly does not preclude the possibility of multiple China-based APTs targeting South China Sea equities.”","url":"https:\/\/www.securityweek.com\/naikon-threat-group-linked-chinese-army"},{"Unnamed: 0":2,"query":"APT30","text":"FireEye Uncovers Decade-Long Cyber Espionage Campaign Targeting South East Asia\r\n\n\nFireEye on Sunday uncovered details of a decade-long cyber espionage campaign carried out by China targeting governments, journalists and businesses in South East Asia and India.\nLikely state sponsored by the Chinese government, FireEye said the threat actor group has been conducting cyber espionage operations since at least 2005 and is one of the first to use malware that infects air-gapped networks.\nDubbed APT30 by FireEye, the group is supported by seasoned software developers following well-organized software development practices.\nAccording to FireEye, the attackers are “particularly interested” in targets holding information related to regional political, military, and economic issues, disputed territories, and media outlets and journalists who cover topics pertaining to China and the legitimacy of the Chinese Communist Party.\nThe group has consistently targeted organizations located in Malaysia, Vietnam, Thailand, Nepal, Singapore, Philippines and Indonesia among others.\nIn a 69-page report released Sunday, FireEye said APT30 uses three pieces of malware designed to spread to removable drives with the intent of eventually infecting and stealing data from computers located on air-gapped networks. \n“While APT30 is certainly not the only group to build functionality to infect air-gapped networks into their operations, they appear to have made this a consideration at the very beginning of their development efforts in 2005, significantly earlier than many other advanced groups we track,” the report said.\nThe attackers are likely operating at a sufficiently large scale that they benefit from the automated management of many of their tools, FireEye said, adding that the threat actors are interested in maintaining the latest and greatest versions of their tools in their victims’ environments.\n“This suite of tools includes downloaders, backdoors, a central controller, and several components designed to infect removable drives and cross air-gapped networks to steal data,” the report said.\nFireEye said many of the attack tools have not been used by any other threat actors.\nInterestingly, the attack tools, tactics, and procedures (TTPs) have remained markedly consistent since inception – a rare finding as most APT actors typically change up their TTPs regularly to evade detection, FireEye said.\nThe developers of the attack tools “systematically label” and keep track of their malware versioning and go as far as using mutexes and events to ensure only a single copy is running at any given time.\nThe malware command and control (C2) communications include a version check feature that enables the malware to update itself and provide a continuous update management capability. \u2028 \nThe attackers frequently registered their own domains for use with malware C2, some of the which have been in use for many years.\n“APT30 appears to focus not on stealing businesses’ valuable intellectual property or cutting-edge technologies, but on acquiring sensitive data about the immediate Southeast Asia region, where they pursue targets that pose a potential threat to the influence and legitimacy of the Chinese Communist Party,” the report concluded.\nFireEye believes the attempts to compromise journalists and media outlets could be used to punish outlets that do not provide favorable coverage. \nAs expected, China denied any involvement in the cyber attacks.\n\"The Chinese government firmly opposes hacking attacks, this position is consistent and clear,\" foreign ministry spokesman Hong Lei in Beijing, told AFP.\n“Advanced threat group like APT 30 illustrate that state-sponsored cyber espionage affects a variety of governments and corporations across the world,” said Dan McWhorter, VP of threat intelligence at FireEye. “Given the consistency and success of APT 30 in Southeast Asia and India, the threat intelligence on APT 30 we are sharing will empower the region’s governments and businesses to quickly begin to detect, prevent, analyze and respond to this established threat.”\nThe report is available online in PDF format.\nFireEye also plans to publish indicators of compromise (IOCs) which can be downloaded from GitHub to help organizations detect APT 30 activity.\n*Updated with China response","url":"https:\/\/www.securityweek.com\/fireeye-uncovers-decade-long-cyber-espionage-campaign-targeting-south-east-asia"}]